# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author angela.garcia
resource-adapters=Configuraci\u00F3n del subsistema de adaptadores de recursos
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author angela.garcia
resource-adapters.add=Agrega el subsistema de adaptadores de recursos.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author angela.garcia
resource-adapters.remove=Borra el subsistema de adaptadores de recursos
resource-adapters.resource-adapter=La configuraci\u00F3n de los adaptadores de recursos
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author angela.garcia
ironjacamar=Modelo representando los adaptadores de recursos activados por el archivo ironjacamar.xml dentro del rar.
ironjacamar.resource-adapter=La configuraci\u00F3n de los adaptadores de recursos
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author angela.garcia
admin-objects=Especifica un objeto de administraci\u00F3n.
admin-objects.add=Agregar un objeto de administraci\u00F3n.
admin-objects.remove=Borra el objeto de administraci\u00F3n.
admin-objects.class-name=Especifica el nombre del la clase completamente calificada de un objeto de administraci\u00F3n.
admin-objects.config-properties=Propiedades de configuraci\u00F3n definidas de manera personalizada.
admin-objects.enabled=Especifica si se debe habilitar un objeto de administraci\u00F3n
admin-objects.jndi-name=Especifica el nombre JNDI para el objeto de administraci\u00F3n. 
admin-objects.use-java-context=El configurar esto como 'false' enlazar\u00E1 el objeto al JNDI global. 
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author angela.garcia
resource-adapter=La configuraci\u00F3n de un adaptador de recursos.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author angela.garcia
resource-adapter.add=Agrega un nuevo adaptador de recursos.  Se requier por lo menos uno\: ARQUIVE o MODULE. 
resource-adapter.remove=Borrar el adaptador de recursos.
resource-adapter.activate=Fuerza la activaci\u00F3n de la configuraci\u00F3n del adaptador de recursos sin recargar el servidor.
resource-adapter.admin-objects=La configuraci\u00F3n de los objetos de administraci\u00F3n de este adaptador de recursos.
resource-adapter.archive=Especifica el archivador adaptador de recursos.
resource-adapter.statistics-enabled=Define si las estad\u00EDsticas del tiempo de ejecuci\u00F3n est\u00E1n habilitadas o no
resource-adapter.statistics=Estad\u00EDsticas del tiempo de ejecuci\u00F3n que el adaptador de recursos proporciona. 
resource-adapter.module=Especifica el m\u00F3dulo desde el cual se va a cargar el adaptador de recursos.
resource-adapter.beanvalidationgroups=Especifica los grupos de validaci\u00F3n de beans que se deben utilizar.
resource-adapter.bootstrap-context=Especifica el nombre \u00FAnico del contexto bootstrap que se debe utilizar.
resource-adapter.connection-definitions=La configuraci\u00F3n de las definiciones de conexi\u00F3n de este adaptador de recursos.
resource-adapter.config-properties=Propiedades de configuraci\u00F3n definidas de manera personalizada.
resource-adapter.clear-statistics=Limpia los valores de estad\u00EDsticas para este recurso.
resource-adapter.transaction-support=Especifica el nivel de soporte de transacciones del adaptador de recursos.
resource-adapter.wm-security=Activa y desactiva wm.security para el adaptador de recursos. En caso de 'false', se ignorar\u00E1n todos los par\u00E1metros, inclusive los predeterminados.
resource-adapter.wm-security-mapping-required=Define si el mapeo es requerido para credenciales de seguridad.
resource-adapter.wm-security-domain=Define el nombre del dominio de seguridad de PicketBox que deber\u00EDa utilizarse.
resource-adapter.wm-elytron-security-domain=Define el nombre del dominio de seguridad de Elytron que deber\u00EDa utilizarse.
resource-adapter.wm-security-default-principal=Define el nombre principal predeterminado que debe ser agregado a la instancia del asunto utilizado.
resource-adapter.wm-security-default-group=Define el grupo predeterminado que debe ser agregado a la instancia del asunto utilizado.
resource-adapter.wm-security-default-groups=Define la lista de grupos predeterminados que debe ser agregada a la instancia del asunto utilizado.
resource-adapter.wm-security-mapping-groups.from=Especifica el valor asignado en el par de mapeo.
resource-adapter.wm-security-mapping-groups.to=Especifica el valor asignado en el par de mapeo.
resource-adapter.wm-security-mapping-users.from=Especifica el valor original en el par de mapeo.
resource-adapter.wm-security-mapping-users.to=Especifica el valor asignado en el par de mapeo.
resource-adapter.wm-security-mapping-group=Un mapeo de grupo.
resource-adapter.wm-security-mapping-user=Un mapeo de usuario.
resource-adapter.wm-security-mapping-groups=Una lista de mapeo de grupos.
resource-adapter.wm-security-mapping-users=Una lista de mapeo de usuarios.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author angela.garcia
deployment-subsystem=La informaci\u00F3n del tiempo de ejecuci\u00F3n para los adaptadores de recursos. Contiene estad\u00EDsticas e informaci\u00F3n del adaptador de recursos activada por ironjacamar.xml y operaciones.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions, author angela.garcia
statistics=Estad\u00EDsticas del tiempo de ejecuci\u00F3n que el adaptador de recursos proporciona. 
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author angela.garcia
config-properties=Una propiedad de configuraci\u00F3n definida de manera personalizada.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author angela.garcia
config-properties.add=Agrega una propiedad de configuraci\u00F3n definida de manera personalizada.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author angela.garcia
config-properties.remove=Borra la propiedad de configuraci\u00F3n definida de manera personalizada.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author angela.garcia
config-properties.value=Valor de la propiedad de configuraci\u00F3n definida de manera personalizada.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author angela.garcia
connection-definitions=Especifica una definici\u00F3n de conexi\u00F3n.
connection-definitions.add=Agrega una definici\u00F3n de conexi\u00F3n.
connection-definitions.remove=Borra la definici\u00F3n de conexi\u00F3n.
connection-definitions.allocation-retry-wait-millis=El elemento  en milisegundos de espera de reintentos de asignaci\u00F3n especifica la cantidad de tiempo en milisegundos a esperar entre re-intentos al asignar una conexi\u00F3n.
connection-definitions.allocation-retry=El elemento de asignaci\u00F3n de re-intentos indica el n\u00FAmero de veces que se debe intentar el asignar una conexi\u00F3n antes de presentar una excepci\u00F3n.
connection-definitions.background-validation-millis=El elemento background-validation-millis especifica la cantidad de tiempo en milisegundos que la validaci\u00F3n de segundo plano ejecutar\u00E1. El cambiar este valor requiere reiniciar el servidor
connection-definitions.background-validation=Un elemento para especificar que las conexiones deben ser validadas en el hilo del segundo plano versus validarlas antes de utilizarlas. El cambiar este valor requiere reiniciar el servidor.
connection-definitions.blocking-timeout-wait-millis=El elemento blocking-timeout-millis especifica la cantidad de tiempo m\u00E1xima en milisegundos para bloquear al esperar una conexi\u00F3n antes de presentar una excepci\u00F3n. Note que esto s\u00F3lo bloquea mientras espera para bloquear una conexi\u00F3n y nunca presentar\u00E1 una excepci\u00F3n si el crear una nueva conexi\u00F3n toma mucho tiempo de manera poco habitual.
connection-definitions.class-name=Especifica el nombre del la clase completamente calificada de una f\u00E1brica de conexiones administrada o un objeto admin.
connection-definitions.clear-statistics=Limpiar los valores de las estad\u00EDsticas para estas definiciones de conexi\u00F3n del adaptador de recursos.
connection-definitions.statistics=La estad\u00EDstica de tiempo de ejecuci\u00F3n provista por las definiciones de conexi\u00F3n del adaptador de recursos.
connection-definitions.config-properties=Propiedades de configuraci\u00F3n definidas de manera personalizada.
connection-definitions.connectable=Habilitar el uso de CMR. Esta funcionalidad significa que un recurso local puede participar de manera confiable en una transacci\u00F3n XA.
connection-definitions.tracking=Define si una conexi\u00F3n IronJacamar debe trazar los handle de conexi\u00F3n a trav\u00E9s de l\u00EDmites de transacciones.
connection-definitions.mcp=Define the ManagedConnectionPool implementation. Por ejemplo\: org.jboss.jca.core.connectionmanager.pool.mcp.SemaphoreArrayListManagedConnectionPool
connection-definitions.enlistment-trace=Define si WildFly/IronJacamar debe registrar los trazados de inscripciones
connection-definitions.enabled=Especifica si se debe habilitar el adaptador de recursos.
connection-definitions.flush-all-connection-in-pool=Vac\u00EDa todas las conexiones en el grupo.
connection-definitions.dump-queued-threads-in-pool=Vaciado de hilos en cola en el grupo
connection-definitions.flush-idle-connection-in-pool=Vac\u00EDa todas las conexiones inactivas en el grupo.
connection-definitions.flush-invalid-connection-in-pool=Vac\u00EDa todas las conexiones inv\u00E1lidas en el grupo.
connection-definitions.flush-gracefully-connection-in-pool=Vac\u00EDa de forma normal todas las conexiones en el grupo.
connection-definitions.flush-strategy=Especifica la manera como el grupo debe vaciarse en caso de un error.
connection-definitions.idle-timeout-minutes=Especifica el tiempo m\u00E1ximo, en minutos,  en que una conexi\u00F3n puede estar inactiva antes de cerrarla. El tiempo m\u00E1ximo real tambi\u00E9n depende del tiempo de escaneo IdleRemover, el cual es la mitad del valor m\u00EDnimo de  idle-timeout-minutes de cualquier grupo. Si cambia este valor deber\u00E1 reiniciar el servidor.
connection-definitions.jndi-name=Especifica el nombre JNDI para la f\u00E1brica de conexiones.
connection-definitions.interleaving=Un elemento para habilitar el intercalo de conexiones XA.
connection-definitions.max-pool-size=Especifica el n\u00FAmero m\u00E1ximo de conexiones para un grupo. No se crear\u00E1n m\u00E1s conexiones en cada sub-pool.
connection-definitions.min-pool-size=Especifica el n\u00FAmero m\u00EDnimo de conexiones para un grupo.
connection-definitions.initial-pool-size=Especifica el elemento inicial de las conexiones que puede contener un grupo.
connection-definitions.capacity-incrementer-class=La clase que define la pol\u00EDtica para incrementar conexiones en el grupo.
connection-definitions.capacity-incrementer-properties=Las propiedades que van a ser inyectadas en la clase que define la pol\u00EDtica para incrementar conexiones en el grupo.
connection-definitions.capacity-decrementer-class=La clase que define la pol\u00EDtica para disminuir conexiones en el grupo.
connection-definitions.capacity-decrementer-properties=Las propiedades que van a ser inyectadas en la clase para disminuir las conexiones en el grupo.
connection-definitions.no-recovery=Especifica si el pool de conexiones se debe excluir de la recuperaci\u00F3n.
connection-definitions.no-tx-separate-pool=A Oracle no le gusta que las conexiones XA se utilicen tanto adentro como afuera de una transacci\u00F3n JTA. Para solucionar este problema puede crear sub-pools separados para los diferentes contextos.
connection-definitions.pad-xid=Especifica si el Xid debe ser rellenado.
connection-definitions.pool-name=Especifica el nombre del pool para la fuente de datos utilizada para la administraci\u00F3n.
connection-definitions.pool-prefill=Especifica si el grupo se debe llenar previamente. Si cambia este valor deber\u00E1 reiniciar el servidor.
connection-definitions.pool-fair=Define si el uso de grupo debe ser equitativo. 
connection-definitions.pool-use-strict-min=Especifica si el min-pool-size  debe considerarse de forma exacta.
connection-definitions.query-timeout=El tiempo de expiraci\u00F3n de una petici\u00F3n configurado en segundos. 
connection-definitions.recovery-password=La contrase\u00F1a que se utiliza para la recuperaci\u00F3n.
connection-definitions.recovery-credential-reference=Credencial (del almac\u00E9n de credenciales) para autenticar la conexi\u00F3n de recuperaci\u00F3n
connection-definitions.recovery-credential-reference.store=El nombre del almac\u00E9n de credenciales que mantiene el alias en la credencial
connection-definitions.recovery-credential-reference.type=El tipo de credencial que designa esta referencia
connection-definitions.recovery-credential-reference.alias=El alias que designa un secreto almacenado o una credencial almacenada en el almac\u00E9n
connection-definitions.recovery-credential-reference.clear-text=Secreto especificado mediante texto sin cifrar (verifique la manera en que el almac\u00E9n de credenciales proporciona credenciales/secretos a servicios)
connection-definitions.recovery-plugin-class-name=El nombre completamente calificado de la clase de la implementaci\u00F3n del plugin de recuperaci\u00F3n.
connection-definitions.recovery-plugin-properties=Las propiedades para el plugin de recuperaci\u00F3n.
connection-definitions.recovery-security-domain=El dominio de PicketBox que se utiliza para la recuperaci\u00F3n.
connection-definitions.recovery-elytron-enabled=Indica que se utilizar\u00E1 un contexto de autenticaci\u00F3n de Elytron para la recuperaci\u00F3n.
connection-definitions.recovery-authentication-context=El contexto de autenticaci\u00F3n de Elytron utilizado para la recuperaci\u00F3n (se utilizar\u00E1 el authentication-context actual si no se especifica).
connection-definitions.recovery-username=El nombre de usuario que se utiliza para la recuperaci\u00F3n.
connection-definitions.same-rm-override=Al usar este atributo, usted puede establecer de forma incondicional si javax.transaction.xa.XAResource.isSameRM(XAResource) retorna 'true' o 'false'.
connection-definitions.security-application=Indica que los par\u00E1metros application-supplied, tales como desde  getConnection(user, pw), sirven para distinguir conexiones en el grupo.
connection-definitions.security-domain=Especifica el dominio de seguridad de PicketBox que define el javax.security.auth.Subject que se utiliza para distinguir las conexiones en el grupo.
connection-definitions.security-domain-and-application=Indica que los par\u00E1metros proporcionados por la aplicaci\u00F3n, tal como getConnection(user, pw) o Subject (del dominio de seguridad de PicketBox),  se utilizan para distinguir las conexiones en el grupo.
connection-definitions.elytron-enabled=Habilita la seguridad de Elytron para gestionar la autenticaci\u00F3n de conexiones. El authentication-context de Elytron que se utilizar\u00E1 ser\u00E1 el contexto actual si no se especifica un contexto (consulte authentication-context).
connection-definitions.authentication-context=El contexto de autenticaci\u00F3n de Elytron que define el javax.security.auth.Subject que se utiliza para distinguir las conexiones en el grupo.
connection-definitions.authentication-context-and-application=Indica que los par\u00E1metros proporcionados por la aplicaci\u00F3n, tal como getConnection(user, pw) o Subject (proporcionado por Elytron despu\u00E9s de la autenticaci\u00F3n mediante el authentication-context configurado), se utilizan para distinguir las conexiones en el grupo.
connection-definitions.set-tx-query-timeout=Si debe establecer el tiempo de expiraci\u00F3n de la petici\u00F3n con base en el tiempo que queda hasta que expira la transacci\u00F3n. Se utilizar\u00E1 el tiempo de expiraci\u00F3n de petici\u00F3n configurado si ho hay transacci\u00F3n.
connection-definitions.test-connection-in-pool=Prueba si se puede obtener una conexi\u00F3n.
connection-definitions.use-ccm=Habilita el uso de un administrador de conexiones en cach\u00E9.
connection-definitions.sharable=Habilita el uso de las conexiones de recursos compartidos, lo cual permite que una asociaci\u00F3n lazy sea activada. 
connection-definitions.enlistment=Define si la inscripci\u00F3n lazy debe ser utilizada si recibe soporte para el adaptador de recursos.
connection-definitions.use-fast-fail=Si debe fallar la asignaci\u00F3n de una conexi\u00F3n en el primer intento si es inv\u00E1lido ('true') o seguir intentando hasta que el pool acabe con todas las conexiones potenciales ('false').
connection-definitions.use-java-context=El configurar esto como 'false' enlazar\u00E1 el objeto al JNDI global. 
connection-definitions.use-try-lock=El tiempo de expiraci\u00F3n configurado para bloqueos internos en los objetos del adaptador de recursos en segundos.
connection-definitions.wrap-xa-resource=Especifica si se deben envolver las instancias XAResource en una instancia org.jboss.tm.XAResourceWrapper.
connection-definitions.xa-resource-timeout=El valor se pasa a XAResource.setTransactionTimeout(), en segundos. 
connection-definitions.validate-on-match=Especifica si la validaci\u00F3n de la conexi\u00F3n se debe realizar cuando una f\u00E1brica de conexiones trata de coincidir con una conexi\u00F3n administrada. Suele ser exclusivo para el uso de la validaci\u00F3n de segundo plano.
statistics.workmanager=Especifica un administrador de trabajo.
statistics.distributed-workmanager=Especifica un administrador de trabajo que puede distribuir trabajo.
statistics.resource-adapter=M\u00E9trica de un adaptador de recursos.
statistics.statistics=Colecci\u00F3n de informaci\u00F3n de tiempo de ejecuci\u00F3n para las definiciones de conexi\u00F3n y los administradores de trabajo de los adaptadores de recursos
statistics.ironjacamar=Modelo representando los adaptadores de recursos activados por el archivo ironjacamar.xml dentro del rar.
statistics.clear-statistics=Limpia los valores de las estad\u00EDsticas para este recurso.
statistics.statistics-enabled=Define si las estad\u00EDsticas del tiempo de ejecuci\u00F3n est\u00E1n habilitadas o no
statistics.connection-definitions=Estad\u00EDsticas para las definiciones de conexiones
statistics.workmanager.work-active=N\u00FAmero de trabajos activos actualmente
statistics.workmanager.work-successful=N\u00FAmero de trabajos completados exitosamente.
statistics.workmanager.work-failed=N\u00FAmero de trabajos fallidos
statistics.workmanager.dowork-accepted=N\u00FAmero de llamadas doWork aceptadas
statistics.workmanager.dowork-rejected=N\u00FAmero de llamadas doWork rechazadas
statistics.workmanager.schedulework-accepted=N\u00FAmero de llamadas scheduleWork aceptadas
statistics.workmanager.schedulework-rejected=N\u00FAmero de llamadas scheduleWork rechazadas
statistics.workmanager.startwork-accepted=N\u00FAmero de llamadas startWork aceptadas
statistics.workmanager.startwork-rejected=N\u00FAmero de llamadas startWork rechazadas
statistics.workmanager.statistics-enabled=Especifica si las estad\u00EDsticas del administrador de trabajo est\u00E1n habilitadas.
statistics.workmanager.workmanager-statistics-enabled=Especifica si las estad\u00EDsticas del administrador de trabajo est\u00E1n habilitadas.
statistics.workmanager.workmanager-statistics-enabled.deprecated=Use 'statistics-enabled'.
statistics.workmanager.distributed-workmanager-statistics-enabled=Especifica si las estad\u00EDsticas del administrador de trabajo distribu\u00EDdo est\u00E1n habilitadas.
statistics.workmanager.distributed-workmanager-statistics-enabled.deprecated=Use 'statistics-enabled'.
statistics.workmanager.dowork-distribution-enabled=Especifica si la distribuci\u00F3n est\u00E1 habilitada para las llamadas doWork.
statistics.workmanager.schedulework-distribution-enabled=Especifica si la distribuci\u00F3n est\u00E1 habilitada para las llamadas scheduleWork.
statistics.workmanager.startwork-distribution-enabled=Especifica si la distribuci\u00F3n est\u00E1 habilitada para las llamadas startWork.
