# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author jdimanos
resource-adapters=Konfiguration des Ressourcenadapter-Untersystems.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author jdimanos
resource-adapters.add=F\u00FCgt das Ressourcenadapter-Untersystem hinzu.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author jdimanos
resource-adapters.remove=Entfernt das Ressourcenadapter-Untersystem.
resource-adapters.resource-adapter=Die Konfiguration der Ressourcenadapter.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author jdimanos
ironjacamar=Modell, das durch die ironjacamar.xml Datei innerhalb von rar aktivierte Ressourcen-Adapter repr\u00E4sentiert.
ironjacamar.resource-adapter=Die Konfiguration der Ressourcenadapter.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author jdimanos
admin-objects=Legt ein Administrationsobjekt fest.
admin-objects.add=F\u00FCgen Sie ein Administrationsobjekt hinzu
admin-objects.remove=Entfernen Sie das Administrationsobjekt
admin-objects.class-name=Legt den vollst\u00E4ndigen Klassennamen eines Administrationsobjekts fest.
admin-objects.config-properties=Benutzerdefinierte config-Properties.
admin-objects.enabled=Legt fest, ob das Administrationsobjekt aktiviert sein sollte.
admin-objects.jndi-name=Legt den JNDI-Namen f\u00FCr das Administrationsobjekt fest.
admin-objects.use-java-context=Wird dies auf "false" gesetzt, so wird das Objekt in das allgemeine JNDI eingebunden.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author jdimanos
resource-adapter=Die Konfiguration des Ressourcenadapters.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author jdimanos
resource-adapter.add=Einen neuen Ressourcen-Adapter hinzuf\u00FCgen. Entweder ARCHIVE oder MODULE ist erforderlich.
resource-adapter.remove=Den Ressourcen-Adapter entfernen.
resource-adapter.activate=Ressourcen-Adapter config-Aktivierung ohne Server-Reload erzwingen.
resource-adapter.admin-objects=Die Konfiguration der Admin-Objekte dieses Ressourcenadapters.
resource-adapter.archive=Legt das Ressourcen-Adapter Archiv fest.
resource-adapter.statistics-enabled=Definieren, ob Runtime-Statistiken aktiviert sind oder nicht.
resource-adapter.statistics=Vom Ressourcen-Adapter bereitgestellte Runtime-Statistiken.
resource-adapter.module=Legt das Modul fest, aus dem der Ressourcen-Adapter geladen wird.
resource-adapter.beanvalidationgroups=Legt die zu verwendenden Bean-Validierungsgruppen fest. 
resource-adapter.bootstrap-context=Legt den eindeutigen Namen des Bootstrap-Kontext fest, der verwendet werden soll. 
resource-adapter.connection-definitions=Die Konfiguration der Connection-Definitionen dieses Ressourcenadapters.
resource-adapter.config-properties=Benutzerdefinierte config-Properties.
resource-adapter.clear-statistics=Bereinigen Sie die Statistikwerte f\u00FCr diese Ressource.
resource-adapter.transaction-support=Legt die Transaktions-Supportebene des Ressourcen-Adapters fest.
resource-adapter.wm-security=wm.security f\u00FCr diesen Ressourcen-Adapter an-/ausschalten. Falls "false", werden alle wm-security-* Parameter ignoriert, sogar die Standardwerte.
resource-adapter.wm-security-mapping-required=Definiert, ob ein Mapping erforderlich ist f\u00FCr Sicherheitsberechtigungen.
resource-adapter.wm-security-domain=Definiert den Namen der PicketBox-Sicherheitsdomain, die verwendet werden soll.
resource-adapter.wm-elytron-security-domain=Definiert den Namen der Elytron-Sicherheitsdomain, die verwendet werden soll.
resource-adapter.wm-security-default-principal=Definiert einen standardm\u00E4\u00DFigen Principal-Namen, der zur verwendeten Subject-Instanz hinzugef\u00FCgt werden soll.
resource-adapter.wm-security-default-group=Definiert eine standardm\u00E4\u00DFige Gruppe, die zur verwendeten Subject-Instanz hinzugef\u00FCgt werden soll.
resource-adapter.wm-security-default-groups=Definiert eine standardm\u00E4\u00DFige Gruppenliste, die zur verwendeten Subject-Instanz hinzugef\u00FCgt werden soll.
resource-adapter.wm-security-mapping-groups.from=Legen Sie den Ursprungswert in einem Mapping-Paar fest.
resource-adapter.wm-security-mapping-groups.to=Legen Sie den zugeordneten Wert in einem Mapping-Paar fest.
resource-adapter.wm-security-mapping-users.from=Legen Sie den Ursprungswert in einem Mapping-Paar fest.
resource-adapter.wm-security-mapping-users.to=Legen Sie den zugeordneten Wert in einem Mapping-Paar fest.
resource-adapter.wm-security-mapping-group=Ein Gruppen-Mapping.
resource-adapter.wm-security-mapping-user=Ein Benutzer-Mapping.
resource-adapter.wm-security-mapping-groups=Eine Liste mit Gruppen-Mappings.
resource-adapter.wm-security-mapping-users=Eine Liste mit Benutzer-Mappings.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author jdimanos
deployment-subsystem=Runtime-Informationen f\u00FCr Ressourcen-Adapter. Sie enthalten Statistiken und Informationen von durch ironjacamar.xml aktivierte Ressourcen-Adapter.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions, author Hedda Peters
statistics=Vom Ressourcen-Adapter bereitgestellte Runtime-Statistiken.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author jdimanos
config-properties=Eine benutzerdefinierte config-Properties.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author jdimanos
config-properties.add=F\u00FCgen Sie eine benutzerdefinierte config-Property hinzu.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author jdimanos
config-properties.remove=Entfernen Sie die benutzerdefinierte config-Property. 
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author jdimanos
config-properties.value=Benutzerdefinierter config-Property-Wert.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author jdimanos
connection-definitions=Legt die Connection-Definitionen fest.
connection-definitions.add=F\u00FCgen Sie die Connection-Definition hinzu.
connection-definitions.remove=Entfernen Sie die Connection-Definition.
connection-definitions.allocation-retry-wait-millis=Das allocation-retry-wait-millis Element spezifiziert die Zeitspanne in Millisekunden, die zwischen den Neuversuchen zur Zuweisung einer Verbindung gewartet werden soll.
connection-definitions.allocation-retry=Das allocation-retry Element spezifiziert die Anzahl der Versuche zur Zuweisung einer Verbindung, bevor eine Ausnahme ausgegeben werden soll.
connection-definitions.background-validation-millis=Das background-validation-millis Element spezifiziert die Zeitspanne in Millisekunden, in der die Hintergrundpr\u00FCfung l\u00E4uft. \u00C4nderungen des Wertes erfordern einen Neustart des Servers.
connection-definitions.background-validation=Dies Element spezifiziert, dass Verbindungen auf einem Hintergrund-Thread gepr\u00FCft werden sollen, statt vor deren Verwendung. \u00C4nderungen des Wertes erfordern einen Neustart des Servers.
connection-definitions.blocking-timeout-wait-millis=Das blocking-timeout-millis Element spezifiziert die maximale Zeitspanne in Millisekunden, die blockiert werden soll, w\u00E4hrend auf eine Verbindung gewartet wird, bevor eine Ausnahme ausgegeben wird. Beachten Sie, dass dadurch nur blockiert wird, w\u00E4hrend auf das Sperren einer Verbindung gewartet wird; hingegen wird keine Ausnahme ausgegeben, wenn die Erstellung einer Verbindung nur sehr lange dauert.
connection-definitions.class-name=Legt den vollst\u00E4ndigen Klassennamen einer gemanagten Connection-Factory oder admin-Objekt fest.
connection-definitions.clear-statistics=L\u00F6schen von Statistikwerten f\u00FCr die Verbindungsdefinitionen dieses Ressourcenadapters.
connection-definitions.statistics=Von den Verbindungsdefinitionen des Ressourcen-Adapters bereitgestellte Runtime-Statistiken.
connection-definitions.config-properties=Benutzerdefinierte config-Properties.
connection-definitions.connectable=Verwendung von CMR aktivieren. Dieses Feature bedeutet, dass eine lokale Ressource auf zuverl\u00E4ssige Weise an einer XA-Transaktion teilnehmen kann.
connection-definitions.tracking=Definiert, ob IronJacamar Verbindungs-Handles \u00FCber Transaktionsgrenzen hinweg nachverfolgen soll
connection-definitions.mcp=Definiert die ManagedConnectionPool-Implementierung, z.B. org.jboss.jca.core.connectionmanager.pool.mcp.SemaphoreArrayListManagedConnectionPool
connection-definitions.enlistment-trace=Definiert, ob WildFly/IronJacamar Spuren von Eintragungen aufzeichnen soll
connection-definitions.enabled=Legt fest, ob der Ressourcen-Adapter aktiviert sein sollte.
connection-definitions.flush-all-connection-in-pool=R\u00E4umt alle Verbindungen im Pool.
connection-definitions.dump-queued-threads-in-pool=Dump der wartenden Threads im Pool durchf\u00FChren
connection-definitions.flush-idle-connection-in-pool=R\u00E4umt alle unt\u00E4tigen Verbindungen im Pool.
connection-definitions.flush-invalid-connection-in-pool=R\u00E4umt alle ung\u00FCltigen Verbindungen im Pool.
connection-definitions.flush-gracefully-connection-in-pool=R\u00E4umt ordnungsgem\u00E4\u00DF alle Verbindungen im Pool.
connection-definitions.flush-strategy=Gibt an, wie der Pool bei einem Fehler bereinigt werden soll.
connection-definitions.idle-timeout-minutes=Legt fest, wie viele Minuten eine Verbindung ungenutzt im Pool verbleibt, bevor sie geschlossen wird. Das Maximum h\u00E4ngt auch von der IdleRemover Scan-Zeit ab, diese ist die H\u00E4lfte der kleinsten idle-timeout-minutes Wertes aller Pools. \u00C4nderungen des Wertes erfordern einen Neustart des Servers.
connection-definitions.jndi-name=Legt den JNDI-Namen f\u00FCr die Connection-Factory fest. 
connection-definitions.interleaving=Ein Element, das Interleaving f\u00FCr XA-Verbindungen erm\u00F6glicht.
connection-definitions.max-pool-size=Legt die maximale Anzahl von Verbindungen im Pool fest. Es werden nie mehr Verbindungen in Unter-Pools angelegt.
connection-definitions.min-pool-size=Legt die minimale Anzahl von Verbindungen im Pool fest.
connection-definitions.initial-pool-size=Legt die anf\u00E4ngliche Anzahl von Verbindungen im Pool fest.
connection-definitions.capacity-incrementer-class=Klasse zur Definition der Richtlinie zum Erh\u00F6hen der Verbindungen im Pool
connection-definitions.capacity-incrementer-properties=Einzuf\u00FCgende Properties in die Klasse zur Definition der Richtlinie zum Erh\u00F6hen der Verbindungen im Pool
connection-definitions.capacity-decrementer-class=Klasse zur Definition der Richtlinie zum Verringern der Verbindungen im Pool
connection-definitions.capacity-decrementer-properties=Einzuf\u00FCgende Properties in die Klasse zur Definition der Richtlinie zum Verringern der Verbindungen im Pool
connection-definitions.no-recovery=Legt den Connection-Pool fest, der von der Recovery ausgeschlossen sein sollte.
connection-definitions.no-tx-separate-pool=Oracle-Datenbanken arbeiten nicht korrekt mit XA-Verbindungen, die sowohl innerhalb als auch au\u00DFerhalb von JTA-Transaktionen verwendet werden. Das Problem kann umgangen werden, indem separate Unter-Pools f\u00FCr die verschiedenen Kontexte angelegt werden.
connection-definitions.pad-xid=Legt fest, ob die Xid aufgef\u00FCllt werden soll.
connection-definitions.pool-name=Legt den Pool-Namen f\u00FCr die vom Management verwendete Datenquelle fest.
connection-definitions.pool-prefill=Legt fest, ob der Pool vorgef\u00FCllt werden soll. Die \u00C4nderung dieses Wertes erfordert einen Server-Neustart.
connection-definitions.pool-fair=Definiert, ob die Pool-Verwendung gleichberechtigt erfolgen soll.
connection-definitions.pool-use-strict-min=Legt fest, ob min-pool-size streng befolgt werden soll.
connection-definitions.query-timeout=Jegliche konfigurierte Anfragen-Timeouts in Sekunden.
connection-definitions.recovery-password=Das f\u00FCr die Wiederherstellung (Recovery) verwendete Passwort.
connection-definitions.recovery-credential-reference=Anmeldedaten (aus Anmeldedatenspeicher) zum Authentifizieren beim Wiederherstellen der Verbindung
connection-definitions.recovery-credential-reference.store=Der Name des Anmeldedatenspeichers mit dem Alias f\u00FCr die Anmeldedaten
connection-definitions.recovery-credential-reference.type=Der Anmeldedatentyp, den diese Referenz kennzeichnet
connection-definitions.recovery-credential-reference.alias=Der Alias, der den geheimen Schl\u00FCssel oder die Anmeldedaten  im Speicher kennzeichnet
connection-definitions.recovery-credential-reference.clear-text=Der in Klartext angegebene geheime Schl\u00FCssel (pr\u00FCfen Sie die Methode des Anmeldedatenspeichers zum Bereitstellen von Anmeldedaten/geheimen Schl\u00FCsseln f\u00FCr Dienste)
connection-definitions.recovery-plugin-class-name=Der vollst\u00E4ndige Klassenname der Recovery-Plugin-Implementierung.
connection-definitions.recovery-plugin-properties=Die Eigenschaften f\u00FCr den Recovery-Plugin. 
connection-definitions.recovery-security-domain=Die f\u00FCr die Wiederherstellung (Recovery) verwendete PicketBox-Sicherheitsdomain.
connection-definitions.recovery-elytron-enabled=Gibt an, dass ein Elytron-Authentifizierungskontext zur Wiederherstellung verwendet wird.
connection-definitions.recovery-authentication-context=Der zur Wiederherstellung verwendete Elytron-Authentifizierungskontext (wenn Sie dies nicht angeben, wird der aktuelle authentication-context verwendet).
connection-definitions.recovery-username=Der f\u00FCr die Wiederherstellung (Recovery) verwendete Benutzername.
connection-definitions.same-rm-override=Mittels dieses Attributs k\u00F6nnen Sie ohne jegliche Bedingungen einstellen, ob die javax.transaction.xa.XAResource.isSameRM(XAResource) "true" oder "false" ausgibt.
connection-definitions.security-application=Zeigt an, dass von der Applikation gelieferte Parameter (wie getConnection(user, pw)) verwendet werden, um Verbindungen im Pool zu unterscheiden.
connection-definitions.security-domain=Gibt die PicketBox-Sicherheitsdomain an, die das javax.security.auth.Subject definiert, das zur Unterscheidung von Verbindungen im Pool dient.
connection-definitions.security-domain-and-application=Gibt an, dass entweder von der Anwendung bereitgestellte Parameter, wie getConnection(user, pw), oder Subject (von PicketBox-Sicherheitsdomain) verwendet werden, um Verbindungen im Pool zu unterscheiden.
connection-definitions.elytron-enabled=Aktiviert die Elytron-Sicherheit zur Verarbeitung der Authentifizierung von Verbindungen. Der zu verwendende Elytron authentication-context ist der aktuelle Kontext, wenn Sie keinen Kontext angeben (siehe authentication-context).
connection-definitions.authentication-context=Gibt den Elytron-Authentifizierungskontext an, der das javax.security.auth.Subject definiert, das zur Unterscheidung von Verbindungen im Pool dient.
connection-definitions.authentication-context-and-application=Gibt an, dass entweder von der Anwendung bereitgestellte Parameter, wie getConnection(user, pw), oder Subject (wird von Elytron nach der Authentifizierung mit dem konfigurierten authentication-context bereitgestellt) verwendet werden, um Verbindungen im Pool zu unterscheiden.
connection-definitions.set-tx-query-timeout=Ob der Anfragen-Timeout auf Grundlage der verbleibenden Zeit bis zum Transaktions-Timeout eingestellt werden soll. Jeder konfigurierte Anfragen-Timeout wird verwendet, falls keine Transaktion vorliegt.
connection-definitions.test-connection-in-pool=Testen Sie, ob eine Verbindung erhalten werden kann.
connection-definitions.use-ccm=Aktivieren der Verwendung eines gecachten Verbindungs-Managers. 
connection-definitions.sharable=Aktivieren der Verwendung teilbarer Verbindungen, was die Aktivierung von Lazy-Zuweisung erm\u00F6glicht, falls unterst\u00FCtzt.
connection-definitions.enlistment=Definiert, ob Lazy-Eintragung verwendet werden soll, falls vom Ressourcen-Adapter unterst\u00FCtzt.
connection-definitions.use-fast-fail=Ob eine Verbindung beim ersten Versuch fehlschlagen soll, falls sie ung\u00FCltig ist (true), oder ob weiterversucht werden soll, bis alle potenziellen Verbindungen im Pool ersch\u00F6pft sind (false).
connection-definitions.use-java-context=Wird dies auf "false" gesetzt, so wird das Objekt in das allgemeine JNDI eingebunden.
connection-definitions.use-try-lock=Ein konfigurierter Timeout f\u00FCr interne Sperren auf den Ressourcenadapter-Objekten in Sekunden.
connection-definitions.wrap-xa-resource=Legt fest, ob die XAResource-Instanzen in einer org.jboss.tm.XAResourceWrapper-Instanz umschlossen werden sollen.
connection-definitions.xa-resource-timeout=Der Wert in Sekunden wird an XAResource.setTransactionTimeout() gegeben.
connection-definitions.validate-on-match=Legt fest, ob eine Verbindungspr\u00FCfung vorgenommen werden soll, wenn eine Connection-Factory versucht, mit einer gemanagten Verbindung \u00FCbereinzustimmen. Dies wird in der Regel nur bei der Verwendung von Hintergrundpr\u00FCfung angewendet
statistics.workmanager=Legt einen WorkManager fest.
statistics.distributed-workmanager=Legt einen WorkManager, der Arbeit verteilen kann.
statistics.resource-adapter=Metriken eines Ressourcenadapters.
statistics.statistics=Sammlung von Runtime-Informationen f\u00FCr WorkManager und Verbindunsgdefinitionen (connection-definitions) des Ressourcenadapters.
statistics.ironjacamar=Modell, das durch die ironjacamar.xml Datei innerhalb von rar aktivierte Ressourcen-Adapter repr\u00E4sentiert.
statistics.clear-statistics=Bereinigen Sie die Statistikwerte f\u00FCr diese Ressource.
statistics.statistics-enabled=Definieren, ob Runtime-Statistiken aktiviert sind oder nicht.
statistics.connection-definitions=Statistik f\u00FCr die Connection-Definitionen
statistics.workmanager.work-active=Anzahl derzeit aktiver Arbeiten
statistics.workmanager.work-successful=Anzahl erfolgreich abgeschlossener Arbeiten
statistics.workmanager.work-failed=Anzahl fehlgeschlagener Arbeiten
statistics.workmanager.dowork-accepted=Anzahl angenommener doWork-Aufrufe
statistics.workmanager.dowork-rejected=Anzahl abgewiesener doWork-Aufrufe
statistics.workmanager.schedulework-accepted=Anzahl angenommener scheduleWork-Aufrufe
statistics.workmanager.schedulework-rejected=Anzahl abgewiesener scheduleWork-Aufrufe
statistics.workmanager.startwork-accepted=Anzahl angenommener startWork-Aufrufe
statistics.workmanager.startwork-rejected=Anzahl abgewiesener startWork-Aufrufe
statistics.workmanager.statistics-enabled=Bestimmt, ob die Statistik f\u00FCr den WorkManager aktiviert ist.
statistics.workmanager.workmanager-statistics-enabled=Bestimmt, ob die Statistik f\u00FCr den WorkManager aktiviert ist.
statistics.workmanager.workmanager-statistics-enabled.deprecated=Verwenden Sie 'statistics-enabled'.
statistics.workmanager.distributed-workmanager-statistics-enabled=Bestimmt, ob die Statistik f\u00FCr den verteilten WorkManager aktiviert ist.
statistics.workmanager.distributed-workmanager-statistics-enabled.deprecated=Verwenden Sie 'statistics-enabled'.
statistics.workmanager.dowork-distribution-enabled=Legt fest, ob die Distribution f\u00FCr doWork-Aufrufe aktiviert ist.
statistics.workmanager.schedulework-distribution-enabled=Legt fest, ob die Verteilung f\u00FCr scheduleWork-Aufrufe aktiviert ist.
statistics.workmanager.startwork-distribution-enabled=Legt fest, ob die Verteilung f\u00FCr startWork-Aufrufe aktiviert ist.
