failedToSetupWeldContexts=Error al configurar contextos de Weld
failedToTearDownWeldContexts=Error al quitar contextos de Weld
processingWeldDeployment=Procesamiento de implementaci\u00F3n de Weld %s
beansXmlInNonStandardLocation=Se encontr\u00F3 el archivo beans.xml en un sitio no est\u00E1ndar\: %s, las implementaciones War deben ubicar los archivos beans.xml en WEB-INF/beans.xml
couldNotFindBeanManagerForDeployment=No se pudo encontrar BeanManager para la implementaci\u00F3n %s
startingServicesForCDIDeployment=Iniciando servicios para implementaci\u00F3n CDI\: %s
couldNotLoadPortableExceptionClass=No se pudo cargar clase de extensi\u00F3n de carga m\u00F3vil %s
injectionTypeNotValue=@Resource injection de tipo %s no es compatible con componentes no ejb. Punto de inyecci\u00F3n\: %s
startingWeldService=Iniciando servicio de Weld para implementaci\u00F3n %s
stoppingWeldService=Deteniendo servicio de Weld para implementaci\u00F3n %s
beansXmlValidationWarning=Advertencia durante el an\u00E1lisis de %s\:%s %s
beansXmlValidationError=Advertencia durante el an\u00E1lisis de %s\:%s %s
cdiAnnotationsButNotBeanArchive=La implementaci\u00F3n %s contiene anotaciones de CDI, pero no se encontr\u00F3 ning\u00FAn archivo bean (beans.xml o clase con anotaciones de definici\u00F3n de beans).
exceptionClearingThreadState=Excepci\u00F3n al eliminar el estado del hilo
errorLoadingFile=Error al cargar el archivo %s
couldNotReadEntries=No se pudieron leer las entradas
doNotUnderstandProtocol=El escaner URL no entiende el protocolo URL %s; no se escanear\u00E1n los beans CDI.
duplicateBeansXml=Se han encontrado WEB-INF/ beans.xml y WEB-INF/classes/META-INF /beans.xml. No es port\u00E1til usar ambas ubicaciones al mismo tiempo. Weld va a usar la ubicaci\u00F3n anterior para esta implementaci\u00F3n.
couldNotGetBeansXmlAsURL=No se pudo obtener el archivo beans.xml como URL al procesar el archivo\: %s
couldNotLoadInterceptorClass=No se pudo cargar la clase de interceptor\: %s
extensionDoesNotImplementExtension=El servicio %s no implement\u00F3 la interfaz javax.enterprise.inject.spi.Extension
viewNotFoundOnEJB=Vista de tipo %s no se encontr\u00F3 en EJB %s
couldNotInjectField=Error al realizar inyecci\u00F3n CDI del campo\: %s en %s
couldNotInjectMethod=Error al realizar inyecci\u00F3n CDI del m\u00E9todo\: %s en %s
moreThanOneBeanConstructor=La clase %s tiene m\u00E1s de un constructor anotado con @Inject
attemptingToInjectInjectionPointIntoField=Componente %s est\u00E1 tratando de inyectar el  InjectionPoint en un campo\: %s
couldNotResolveInjectionPoint=No se pudo resolver bean CDI para punto de inyecci\u00F3n %s con calificadores %s 
attemptingToInjectInjectionPointIntoNonBean=Componente %s est\u00E1 tratando de inyectar el  InjectionPoint en un m\u00E9todo en un componente que no es un bean CDI %s
unknownInterceptorClassForCDIInjection=Clase de interceptor desconocido para inyecci\u00F3n CDI %s
parameterCannotBeNull=%s no puede ser nulo
injectionPointNotAJavabean=El punto de inyecci\u00F3n representa un m\u00E9todo que no sigue las convenciones de JavaBean (debe tener exactamente un par\u00E1metro) %s
annotationNotFound=No se encontr\u00F3 anotaci\u00F3n %s en %s
ejbNotResolved=No se pudo resolver inyecci\u00F3n @EJB parar %s en %s
moreThanOneEjbResolved=Resuelto m\u00E1s de un EJB para @EJB injection de %s en %s. Se encontraron %s
couldNotDetermineUnderlyingType=No se pudo determinar la clase de bean del tipo de punto de inyecci\u00F3n de %s
couldNotFindPersistenceUnit=Error al inyectar unidad de persistencia en bean administrado CDI . No se puede encontrar una unidad de persistencia denominada '%s' en implementaci\u00F3n '%s' para el punto de inyecci\u00F3n %s
securityNotEnabled=No se pudo inyectar SecurityManager, la seguridad no est\u00E1 habilitada
singletonNotSet=Singleton no  fue especificado para %s. Esto significa que usted est\u00E1 intentando acceder a una implementaci\u00F3n de Weld con Thread Context ClassLoader que no est\u00E1 asociada con la implementaci\u00F3n.
alreadyRunning=%s ya se est\u00E1 ejecutando
notStarted=%s no ha iniciado
beanDeploymentNotFound=No se encontr\u00F3 BeanDeploymentArchive con ID %s en implementaci\u00F3n
couldNotFindResource.1=Error al inyectar recursos en el bean administrado CDI. No se puede encontrar un recurso llamado %s
cannotDetermineResourceName=No se puede determinar  un  nombre de recurso. Tanto  jndiName como mappedName son nulos
cannotInject=No se puede inyectar punto de inyecci\u00F3n %s 
cannotUseAtRuntime=%s puede utilizarse en ejecuci\u00F3n
rejectAttributesMustBeTrue=Estos atributos deben ser 'true' para usar con CDI 1.0 '%s'
couldNotFindResource.2=Error al inyectar recursos en el bean administrado CDI. No se puede encontrar un recurso llamado %s definido en %s
beanArchiveDiscovered=%s descubiertos
nameNotFoundInIndex=%s no se encontr\u00F3 en el \u00EDndice de compuesto
unableToLoadAnnotation=No se puede cargar la anotraci\u00F3n %s 
cannotLoadClass=No se puede cargar %s
loadingProxiesUsingDeploymentClassLoader=Utilizando el cargador de clases de implementaci\u00F3n para cargar las clases proxy para el m\u00F3dulo %s. No funcionar\u00E1 el acceso privado del paquete. Para arreglar esto el m\u00F3dulo debe declarar las dependencias en %s
componentInterceptorSupportNotAvailable=No hay soporte de interceptor de componentes disponible para\: %s
