failedToSetupWeldContexts=Falha ao montar os contextos Weld
failedToTearDownWeldContexts=Falha ao desmontar os contextos Weld
processingWeldDeployment=Processamento da implanta\u00E7\u00E3o weld %s
couldNotFindBeanManagerForDeployment=N\u00E3o foi poss\u00EDvel encontrar BeanManager para implanta\u00E7\u00E3o %s 
startingServicesForCDIDeployment=Iniciando os  Servi\u00E7os para a implanta\u00E7\u00E3o CDI\: %s
couldNotLoadPortableExceptionClass=N\u00E3o foi poss\u00EDvel carregar a classe de extens\u00E3o port\u00E1til %s
injectionTypeNotValue=A inje\u00E7\u00E3o @Resource do tipo %s n\u00E3o \u00E9 suportada para os componentes n\u00E3o-ejb. Ponto de inje\u00E7\u00E3o\: %s
startingWeldService=Inicializa\u00E7\u00E3o do servi\u00E7o weld para a implanta\u00E7\u00E3o %s
stoppingWeldService=Interrup\u00E7\u00E3o do servi\u00E7o Weld para implanta\u00E7\u00E3o %s
beansXmlValidationWarning=Aviso ao pesquisar %s\:%s %s
beansXmlValidationError=Aviso ao pesquisar %s\:%s %s
cdiAnnotationsButNotBeanArchive=Implanta\u00E7\u00E3o %s cont\u00E9m anota\u00E7\u00F5es CDI por\u00E9m n\u00E3o foi encontrado arquivo bean (nenhum beans.xml ou classe com anota\u00E7\u00F5es definidas por bean presentes).
exceptionClearingThreadState=Exce\u00E7\u00E3o ao desmontando estado de thread 
couldNotReadEntries=N\u00E3o foi poss\u00EDvel ler as entradas
doNotUnderstandProtocol=O scanner URL n\u00E3o entende o protocolo URL %s, os bens de CDI n\u00E3o podem ser escaneados.
duplicateBeansXml=Encontrados ambos WEB-INF/beans.xml e WEB-INF/classes/META-INF/beans.xml. N\u00E3o \u00E9 port\u00E1til utilizar ambos locais ao mesmo tempo. Weld utilizar\u00E1 o antigo local para esta implementa\u00E7\u00E3o.
couldNotGetBeansXmlAsURL=N\u00E3o foi poss\u00EDvel obter o arquivo beans.xml no processamento do arquivo\: %s
couldNotLoadInterceptorClass=N\u00E3o foi poss\u00EDvel carregar a classe do interceptador\: %s
extensionDoesNotImplementExtension=Servi\u00E7o %s n\u00E3o implantou a interface javax.enterprise.inject.spi.Extension
viewNotFoundOnEJB=A visualiza\u00E7\u00E3o do tipo %s n\u00E3o foi encontrada no EJB %s
unknownInterceptorClassForCDIInjection=Classe de interceptor desconhecida para a inje\u00E7\u00E3o CDI %s
parameterCannotBeNull=%s n\u00E3o pode ser nulo
injectionPointNotAJavabean=O ponto de inje\u00E7\u00E3o representa um m\u00E9todo que n\u00E3o segue as conven\u00E7\u00F5es do JavaBean (deve possuir exatamente um par\u00E2metro) %s
annotationNotFound=Anota\u00E7\u00E3o %s n\u00E3o foi encontrada em %s 
ejbNotResolved=N\u00E3o foi poss\u00EDvel resolver a inje\u00E7\u00E3o @EJB para %s em %s
moreThanOneEjbResolved=Foi resolvido mais de um EJB para a inje\u00E7\u00E3o @EJB de %s em %s. Foi encontrado %s
couldNotDetermineUnderlyingType=N\u00E3o foi poss\u00EDvel determinar a classe de bean a partir do tipo do ponto de inje\u00E7\u00E3o de %s
couldNotFindPersistenceUnit=Erro ao injetar a unidade de persist\u00EAncia no bean gerenciado CDI. N\u00E3o foi poss\u00EDvel encontrar a unidade de persist\u00EAncia nomeada '%s' na implanta\u00E7\u00E3o %s para ponto de inje\u00E7\u00E3o  %s
securityNotEnabled=N\u00E3o foi poss\u00EDvel injetar SecurityManager, a seguran\u00E7a n\u00E3o est\u00E1 ativada
singletonNotSet=O singleton n\u00E3o foi configurado para %s. Isto significa que voc\u00EA est\u00E1 tentando acessar uma implanta\u00E7\u00E3o weld com ClassLoader do Contexto do Thread que n\u00E3o est\u00E1 associado com a implanta\u00E7\u00E3o.
alreadyRunning=%s j\u00E1 est\u00E1 executando
notStarted=%s n\u00E3o foi iniciado
beanDeploymentNotFound=N\u00E3o foi encontrado BeanDeploymentArchive com a id %s na implanta\u00E7\u00E3o
couldNotFindResource.1=Erro ao injetar recurso no bean gerenciado CDI. N\u00E3o foi poss\u00EDvel encontrar um recurso denominado %s 
cannotDetermineResourceName=N\u00E3o foi poss\u00EDvel determinar o nome do recurso. Ambos jndiName e mappedName s\u00E3o nulos
cannotInject=N\u00E3o foi poss\u00EDvel injetar ponto de inje\u00E7\u00E3o %s
cannotUseAtRuntime=%s n\u00E3o pode ser utilizado em runtime
rejectAttributesMustBeTrue=Estes atributos devem ser 'verdadeiros' para uso com CDI 1.0 '%s'
couldNotFindResource.2=Erro ao injetar recurso em bean gerenciado CDI. N\u00E3o \u00E9 poss\u00EDvel encontrar um recurso denominado %s definido em %s
beanArchiveDiscovered=%s descoberto 
nameNotFoundInIndex=%s n\u00E3o foi encontrado no \u00EDndice de composi\u00E7\u00E3o
unableToLoadAnnotation=N\u00E3o \u00E9 poss\u00EDvel carregar anota\u00E7\u00E3o %s
cannotLoadClass=N\u00E3o foi poss\u00EDvel carregar %s
loadingProxiesUsingDeploymentClassLoader=Usando o classloader de implanta\u00E7\u00E3o para carregar as classes proxy para o m\u00F3dulo %s. O acesso package-private n\u00E3o funcionar\u00E1. Para corrigir isto, este m\u00F3dulo deve declarar depend\u00EAncias no %s
componentInterceptorSupportNotAvailable=Componente suporte de interceptor n\u00E3o dispon\u00EDvel para\: %s
