undertow=El subsistema Undertow
undertow.add=Operaci\u00F3n de adici\u00F3n de subsistema
undertow.remove=Operaci\u00F3n de retiro de subsistema
undertow.configuration=null
undertow.default-virtual-host=El host virtual predeterminado a usar para implementaciones
undertow.default-servlet-container=El contenedor predeterminado Servlet a ser utilizado para implementaciones
undertow.default-server=El servidor predeterminado a usar para las implementaciones.
undertow.instance-id=El ID de instancia de cl\u00FAster
undertow.statistics-enabled=Configura si las estad\u00EDsticas est\u00E1n habilitadas. Los cambios se efect\u00FAan de inmediato en las estad\u00EDsticas del nivel de conector, las estad\u00EDsticas de nivel de implementaci\u00F3n solamente se ver\u00E1n afectadas despu\u00E9s de que la implementaci\u00F3n haya sido reimplementada (o el contenedor haya sido recargado). 
undertow.default-security-domain=El dominio de seguridad utilizado por las implementaciones Web
undertow.buffer-cache=La cach\u00E9 b\u00FAfer utilizada para guardar en cach\u00E9 el contenido est\u00E1tico
undertow.buffer-cache.add=Agrega una cach\u00E9 b\u00FAfer
undertow.buffer-cache.remove=Retira una cach\u00E9 b\u00FAfer
undertow.buffer-cache.name=El nombre de la cach\u00E9
undertow.buffer-cache.buffer-size=El tama\u00F1o de un b\u00FAfer individual en bytes.
undertow.buffer-cache.buffers-per-region=La cantidad de b\u00FAferes en una reg\u00ED\u00F3n
undertow.buffer-cache.max-regions=N\u00FAmero m\u00E1ximo de regiones
undertow.server=Un servidor
undertow.server.add=Agrega un servidor
undertow.server.remove=Retira un servidor
undertow.server.name=El nombre del servidor
undertow.server.default-host=Los servidores de host virtual predeterminado
undertow.server.servlet-container=Los servidores de contenedor de Servlet predeterminado
undertow.server.http-listener=Un oyente HTTP
undertow.server.https-listener=Un oyente HTTP
undertow.server.ajp-listener=Un oyente AJP
undertow.server.host=El host de los servidores
undertow.servlet-container=Un contenedor Servlet
undertow.servlet-container.add=Agrega un contenedor Servlet
undertow.servlet-container.remove=Retrira un contenedor de Servlet
undertow.servlet-container.name=El nombre de un contenedor Servlet
undertow.servlet-container.default-buffer-cache=La cach\u00E9 de b\u00FAfer a usar para guardar los recursos est\u00E1ticos,
undertow.servlet-container.stack-trace-on-error=Si una p\u00E1gina de error con el trazado de pila debe ser generado en caso de error. Los valores son 'all', 'none' y 'local-only'.
undertow.servlet-container.setting=Los par\u00E1metros del contenedor Servlet
undertow.servlet-container.persistent-sessions=Si el contenedor Servlet debe persistir sesiones a trav\u00E9s de las reimplementaciones.
undertow.servlet-container.allow-non-standard-wrappers=Si se define como 'true', entonces los envoltorios de petici\u00F3n y respuesta que no extienden las clases de envoltorio est\u00E1ndares pueden ser utilizados.
undertow.servlet-container.use-listener-encoding=Usar la codificaci\u00F3n definida en el oyente
undertow.servlet-container.ignore-flush=Ignorar los vaciados en el flujo de salida de Servlet. En la mayor\u00EDa de los casos, estos vaciados afectan el rendimiento sin raz\u00F3n alguna.
undertow.servlet-container.default-encoding=Codificaci\u00F3n predeterminada a usar para todas las aplicaciones implementadas.
undertow.servlet-container.eager-filter-initialization=Si es 'true', las llamadas Undertow filtran init () en el inicio de la implementaci\u00F3n y no en la primera petici\u00F3n. 
undertow.servlet-container.default-session-timeout=El tiempo de espera de la sesi\u00F3n predeterminada (en minutos) para todas las aplicaciones implementadas en el contenedor.
undertow.servlet-container.use-global-request-controller=Si esto es 'true', Undertow se registrar\u00E1 con el controlador de peticiones globales. Esto tendr\u00E1 un leve  impacto en el rendimiento, pero permitir\u00E1 el apagado normal y el l\u00EDmite global en el n\u00FAmero de peticiones activas en el servidor.
undertow.servlet-container.disable-caching-for-secured-pages=Indica si Undertow debe definir los encabezamientos para inhabilitar la cach\u00E9 de las p\u00E1ginas protegidas. Al inhabilitarla puede ocasionar problemas de seguridad, ya que las p\u00E1ginas confidenciales pueden ser guardadas en la cach\u00E9 por un intermediario.
undertow.servlet-container.mime-mapping=Configuraci\u00F3n del mapeo de Servlet Mime
undertow.servlet-container.welcome-file=Un archivo de bienvenida.
undertow.servlet-container.directory-listing=Especifica si la escucha debe estar habilitada para los Servlet predeterminados.
undertow.servlet-container.proactive-authentication=Indica si la autenticaci\u00F3n proactiva debe ser utilizada. Si es 'true', un usuario siempre ser\u00E1 autenticado si las credenciales est\u00E1n presentes.
undertow.servlet-container.session-id-length=La longitud del ID de sesi\u00F3n generado. El ID de sesi\u00F3n m\u00E1s extenso es el m\u00E1s seguro. Este n\u00FAmero se refiere al n\u00FAmero de bytes aleatorios que se utilizan para generar el ID de sesi\u00F3n, el ID actual que es enviado al cliente ser\u00E1 codificado como base64, por lo tanto, ser\u00E1 33 % m\u00E1s largo (Por ejemplo, un ID de sesi\u00F3n de 30 resultar\u00E1 en un valor de cookie de una longitud de 40). 
undertow.servlet-container.max-sessions=El n\u00FAmero m\u00E1ximo de sesiones que pueden estar activas al mismo tiempo
undertow.servlet-container.disable-file-watch-service=Si esto es 'true', entonces el servicio de vigilancia del archivo no ser\u00E1 utilizado para monitorizar los cambios de las implementaciones explotadas.
undertow.servlet-container.disable-session-id-reuse=Si se configura como verdadero, entonces nunca se reutilizar\u00E1 un ID de sesi\u00F3n desconocido, y se generar\u00E1 un ID de sesi\u00F3n nuevo. Si se configura como falso, se reutilizar\u00E1 solo si est\u00E1 presente en el administrador de sesiones de otra implementaci\u00F3n, para permitir que se comparta el mismo ID de sesi\u00F3n entre las aplicaciones del mismo servidor.
undertow.mime-mapping=Configuraci\u00F3n del mapeo del contenedor Servlet Mime
undertow.mime-mapping.add=Agrega un mapeo Mime
undertow.mime-mapping.remove=Retira un mapeo Mime
undertow.mime-mapping.value=El tipo Mime para este mapeo
undertow.welcome-file=El archivo de bienvenida
undertow.welcome-file.add=Agrega un archivo de bienvenida.
undertow.welcome-file.remove=Retira un archivo de bienvenida.
undertow.error-page=P\u00E1ginas de errores del servidor
undertow.handler=Manejadores Undertow
undertow.handler.add=Agregar el elemento del manejador
undertow.handler.remove=Retira el elemento deel manejador
undertow.handler.name=El nombre del manejador
undertow.filter=Filtros Undertow 
undertow.filter.add=Agrega un elemento de filtro
undertow.filter.remove=Retira un elemento de filtro
undertow.filter.name=El nombre del filtro
undertow.ajp-listener=Un oyente AJP
undertow.ajp-listener.add=Agrega un oyente AJP
undertow.ajp-listener.remove=Retira un oyente AJP
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.access-log=La configuraci\u00F3n de registro de acceso para este servidor virtual.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.access-log.add=A\u00F1ade configuraci\u00F3n de registro de acceso a este servidor virtual.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.access-log.remove=Borra la configuraci\u00F3n de registro de acceso de este  servidor virtual.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.access-log.pattern=El patr\u00F3n de registro de acceso.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.access-log.prefix=Prefijo para el nombre de archivo de registro.
undertow.access-log.suffix=Sufijo para el nombre de archivo de registro.
undertow.access-log.directory=Directorio en el cual guardar los registros.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.access-log.rotate=Rota a diario el registro de acceso.
undertow.access-log.worker=Nombre del Worker a utilizar para el registro
undertow.access-log.use-server-log=Si el registro debe escribirse en el registro del servidor, en lugar de un archivo separado. 
undertow.access-log.relative-to=El directorio al que la ruta es relativa. 
undertow.access-log.extended=Si el registro usa el formato de archivo de registro extendido
undertow.access-log.predicate=Predicado que determina si la petici\u00F3n debe ser registrada
undertow.single-sign-on=La configuraci\u00F3n de un mecanismo de autenticaci\u00F3n SSO.
undertow.single-sign-on.add=Agrega un mecanismo de antenticaci\u00F3n SSO.
undertow.single-sign-on.remove=Elimina el mecanismo de autenticaci\u00F3n SSO.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.single-sign-on.domain=El dominio de cookies que ser\u00E1 utilizado.
undertow.single-sign-on.path=Ruta de cookie
undertow.single-sign-on.http-only=Establece el atributo de cookie httpOnly 
undertow.single-sign-on.secure=Establece el atributo de cookie seguro.
undertow.single-sign-on.cookie-name=Nombre de la cookie
undertow.single-sign-on.key-store=Referencia al almac\u00E9n de claves que contiene una entrada de clave privada.
undertow.single-sign-on.key-alias=Alias de la entrada de clave privada que se us\u00F3 para firmar y verificar la conexi\u00F3n de cierre del canal de retorno.
undertow.single-sign-on.credential-reference=La referencia de la credencial para descifrar la entrada de clave privada.
undertow.single-sign-on.credential-reference.store=El nombre del almac\u00E9n de credenciales que mantiene el alias en la credencial.
undertow.single-sign-on.credential-reference.alias=El alias que designa un secreto almacenado o una credencial almacenada en el almac\u00E9n.
undertow.single-sign-on.credential-reference.type=El tipo de credencial que designa esta referencia.
undertow.single-sign-on.credential-reference.clear-text=El secreto especificado mediante texto sin cifrar. Verifique la manera en que el almac\u00E9n de credenciales proporciona credenciales/secretos a servicios.
undertow.single-sign-on.client-ssl-context=Referencia al contexto SSL que se us\u00F3 para proteger la conexi\u00F3n de cierre del canal de retorno.
undertow.listener=Oyente HTTP
undertow.listener.add=Agrega un oyente
undertow.listener.remove=Nombre del oyente
undertow.listener.name=El nombre del oyente
undertow.listener.socket-binding=El enlace de socket del oyente.
undertow.listener.worker=El Worker XNIO de los oyentes
undertow.listener.buffer-pool=El grupo de b\u00FAfer de los oyentes
undertow.listener.enabled=Si el oyente est\u00E1 habilitado
undertow.listener.enabled.deprecated=Los atributos habilitados est\u00E1n siendo depreciados, ya que presentan problemas en la aplicaci\u00F3n de la consistencia de configuraci\u00F3n.
undertow.listener.scheme=El esquema del oyente  puede ser HTTP o HTTPS. Por defecto, el esquema se tomar\u00E1 de la petici\u00F3n AJP  entrante.
undertow.listener.certificate-forwarding=Si se debe habilitar el reenv\u00EDo de certificados. Si est\u00E1 activado, el oyente tomar\u00E1 el certificado del atributo SSL_CLIENT_CERT. Esto solamente  debe habilitarse si est\u00E1 detr\u00E1s de un proxy y si el proxy est\u00E1 configurado para establecer siempre estos encabezados.
undertow.listener.ssl-context=Hace referencia al contexto SSL que va a ser utilizado por este oyente.
undertow.listener.security-realm=Los oyentes del dominio de seguridad
undertow.listener.security-realm.deprecated=Utiliza un atributo ssl-context para hacer referencia directamente a un contexto SSL configurado.
undertow.listener.max-post-size=El tama\u00F1o m\u00E1ximo de un publicaci\u00F3n que puede ser aceptada en bytes.
undertow.listener.buffer-pipelined-data=Si debemos poner las solicitudes canalizadas en memoria b\u00FAfer
undertow.listener.allow-encoded-slash=Si una petici\u00F3n viene codificada o en caracteres (p.ej, %2F), ser\u00E1n descodificados.
undertow.listener.decode-url=Si esto es 'true', el analizador decodificar\u00E1 los par\u00E1metros de la URL y los  de consulta ,mediante la codificaci\u00F3n de caracteres seleccionada (UTF-8 de forma predeterminada). Si esto es 'false', no se decodificar\u00E1n. Esto permitir\u00E1 a un manejador descodificarlos en cualquier set de caracteres deseado.
undertow.listener.url-charset=Charset URL
undertow.listener.max-header-size=El tama\u00F1o m\u00E1ximo de un encabezamiento de petici\u00F3n http en bytes.
undertow.listener.max-headers=El n\u00FAmero m\u00E1ximo de encabezamientos que ser\u00E1 le\u00EDdo. Se utiliza para proteger contra las vulnerabilidades hash.
undertow.listener.max-cookies=El n\u00FAmero m\u00E1ximo de cookies que ser\u00E1 le\u00EDdo. Se utiliza para proteger contra las vulnerabilidades hash.
undertow.listener.max-parameters=El n\u00FAmero m\u00E1ximo de par\u00E1metros que ser\u00E1 le\u00EDdo. Se utiliza para proteger contra las vulnerabilidades hash. Se aplica a los par\u00E1metros de consulta y a los datos de publicaci\u00F3n (POST) , pero no es acumulaiva (p.ej., puede tener un m\u00E1ximo de  2* par\u00E1metros en total).
undertow.listener.verify-client=El modo de autenticaci\u00F3n del cliente SSL deseado para los canales SSL
undertow.listener.verify-client.deprecated=Cuando se hace referencia a un SSLContext, se debe configurar directamente para el modo de verificaci\u00F3n del cliente requerido.
undertow.listener.always-set-keep-alive=Si esto es 'true', entonces se agregar\u00E1 el encabezado Connection\: el encabezado keep-alive ser\u00E1 agregado a las respuestas, incluso cuando la especificaci\u00F3n no lo requiera estrictamente.
undertow.listener.redirect-socket=Si este oyente soporta peticiones non-SSL, y se recibe una solicitud para la cual una <security-constraint> correspondiente requiera transporte SSL, Undertow redirigir\u00E1 autom\u00E1ticamente la solicitud al puerto de enlace de socket especificado aqu\u00ED.
undertow.listener.proxy-address-forwarding=Habilita la gesti\u00F3n del encabezado x-forwarded-host (y otros encabezados x-forwarded-*) y usa la informaci\u00F3n de este encabezado para configurar la direcci\u00F3n remota. Solo debe utilizarse detr\u00E1s de un proxy de confianza que configure estos encabezados; de lo contrario, un usuario remoto puede falsificar su direcci\u00F3n IP.
undertow.listener.enabled-cipher-suites=Configura las cifras SSL habilitadas
undertow.listener.enabled-cipher-suites.deprecated=Cuando se hace referencia a un SSLContext se debe configurar con los paquetes de cifras que van a ser soportadas.
undertow.listener.enabled-protocols=Configura los protocolos SSL
undertow.listener.enabled-protocols.deprecated=Cuando se hace referencia a un SSLContext se debe configurar con los protocolos soportados.
undertow.listener.max-buffered-request-size=El tama\u00F1o m\u00E1ximo  de una petici\u00F3n en b\u00FAfer, en bytes. Las peticiones no suelen ser almacenadas en b\u00FAfer, el caso m\u00E1s com\u00FAn es cuando se realiza una renegociaci\u00F3n de SSL para una solicitud POST, y los datos de Post  deben estar almacenados en el b\u00FAfer para poder realizar la renegociaci\u00F3n.
undertow.listener.record-request-start-time=Si esto es 'true', entonces Undertow registrar\u00E1 la petici\u00F3n en el tiempo de inicio para que pueda ser registrada. Esto tiene un impacto leve en el rendimiento, pero medible.
undertow.listener.allow-equals-in-cookie-value=Si esto es 'true', Undertow autorizar\u00E1 los caracteres iguales non-escaped en valores de cookie sin comillas. Los valores de cookies sin comillas no  pueden contener el caracter  igual. Si est\u00E1 presente, el valor terminar\u00E1 antes del signo igual. El valor de la cookie restante, se descartar\u00E1.
undertow.listener.no-request-timeout=El tiempo en milisegundos  durante el cual  la conexi\u00F3n puede estar inactiva antes de que  sea cerrada por el contenedor. 
undertow.listener.request-parse-timeout=La cantidad m\u00E1xima de tiempo (en milisegundos) que puede utilizarse al analizar la solicitud.
undertow.listener.receive-buffer=El tama\u00F1o en bytes de un b\u00FAfer de recepci\u00F3n.
undertow.listener.send-buffer=El tama\u00F1o en bytes de un b\u00FAfer de env\u00EDo.
undertow.listener.max-connections=El n\u00FAmero m\u00E1ximo de lecturas simult\u00E1neas permitidas en la paginaci\u00F3n.
undertow.listener.tcp-backlog=Configura un servidor con el backlog especificado.
undertow.listener.tcp-keep-alive=Configura  un canal para enviar mensajes TCP keep-alive de forma dependiente de la implementaci\u00F3n.
undertow.listener.read-timeout=Configura un tiempo de espera de lectura para un socket, en milisegundos. Si el tiempo de espera termina sin haber transcurrido una lectura correcta, la siguiente lectura del socket lanzar\u00E1 una excepci\u00F3n {@link ReadTimeoutException}.
undertow.listener.write-timeout=Configura un tiempo de espera de escritura para un socket, en milisegundos. Si el tiempo de espera termina sin haber transcurrido una escritura correcta, la siguiente escritura del socket lanzar\u00E1 una excepci\u00F3n  {@link WriteTimeoutException}.
undertow.listener.resolve-peer-address=Activa la b\u00FAsqueda DNS de host
undertow.listener.enable-connector-statistics=Indica si las estad\u00EDsticas del conector est\u00E1n habilitadas. Esto permitir\u00E1 el acceso a las estad\u00EDsticas, a costa del rendimiento.
undertow.listener.request-count=El n\u00FAmero de peticiones procesadas por este oyente.
undertow.listener.bytes-sent=El n\u00FAmero de bytes que han sido enviados en este oyente.
undertow.listener.bytes-received=El n\u00FAmero de bytes que han sido recibidos por este oyente.
undertow.listener.error-count=El n\u00FAmero de 500 respuestas que han sido enviadas por este oyente.
undertow.listener.processing-time=El tiempo total de procesamiento de todas las peticiones manejadas por este oyente.
undertow.listener.max-processing-time=El tiempo total de procesamiento m\u00E1ximo utilizado por una petici\u00F3n en este oyente.
undertow.listener.reset-statistics=Restablece a cero todas las estad\u00EDsticas del conector. 
undertow.listener.enable-http2=Habilita el soporte HTTP2 para este oyente
undertow.listener.enable-spdy=Habilita el soporte HTTP2 para este oyente. Esto ha sido depreciado y no tiene ning\u00FAn efecto, se deber\u00E1 utilizar HTTP/2 en su lugar.
undertow.listener.enable-spdy.deprecated=SPDY ha sido remplazado por HTTP/2
undertow.listener.disallowed-methods=Una lista separada por comas de los m\u00E9todos HTTP que no est\u00E1n permitidos.
undertow.listener.ssl-session-cache-size=El n\u00FAmero m\u00E1ximo de sesiones SSL activas
undertow.listener.ssl-session-cache-size.deprecated=Ahora puede ser configurado en el contexto de seguridad Elytron.
undertow.listener.ssl-session-timeout=El tiempo de espera en segundos para las sesiones SSL
undertow.listener.ssl-session-timeout.deprecated=Ahora puede ser configurado en el contexto de seguridad Elytron.
undertow.listener.secure=Si esto es 'true', entonces las solicitudes que se originaron de este oyente se marcan como seguras, incluso si la solicitud no est\u00E1 utilizando HTTPS.
undertow.listener.max-ajp-packet-size=El tama\u00F1o m\u00E1ximo de los paquetes AJP con soporte. Si es modificado tiene que incrementarse en el equilibrador de carga y el servidor de segundo plano.
undertow.listener.http2-enable-push=Especifica si el env\u00EDo del servidor est\u00E1 habilitado para esta conexi\u00F3n
undertow.listener.http2-max-frame-size=El tama\u00F1o m\u00E1ximo del marco HTTP/2
undertow.listener.http2-max-concurrent-streams=El n\u00FAmero m\u00E1ximo de flujos HTTP/2 que pueden estar activos al mismo tiempo en una conexi\u00F3n sencilla.
undertow.listener.http2-max-header-list-size=El tama\u00F1o m\u00E1ximo de los encabezados de solicitudes que el servidor est\u00E1 preparado para aceptar.
undertow.listener.http2-initial-window-size=El tama\u00F1o de la ventana de control de flujo que supervisa qu\u00E9 tan r\u00E1pido como el cliente env\u00EDa datos al servidor.
undertow.listener.http2-header-table-size=El tama\u00F1o en bytes de la tabla de encabezados para la compresi\u00F3n HPACK.  Esta cantidad de memoria ser\u00E1 asignada por conexi\u00F3n para compresi\u00F3n. Los valores m\u00E1s grandes usan m\u00E1s memoria, pero pueden mejorar la compresi\u00F3n.
undertow.listener.require-host-http11=Requiere que todas las solicitudes HTTP/1.1 tengan un encabezado de 'Host', de conformidad con RFC. Si la solicitud no incluye este encabezado, se rechazar\u00E1 con un 403.
undertow.host=Un host Undertow
undertow.host.add=Agrega un nuevo host
undertow.host.remove=Borra un host
undertow.host.name=El nombre de host.
undertow.host.alias=Alias para el host
undertow.host.default-web-module=M\u00F3dulo Web predeterminado
undertow.host.setting=Configuraci\u00F3n
undertow.host.default-response-code=Si est\u00E1 definido, ser\u00E1 el c\u00F3digo de respuesta devuelto en caso que el contexto solicitado no exista en el servidor.
undertow.host.disable-console-redirect=Si est\u00E1 definido como 'true', /console redirect no se habilitar\u00E1 para este host, el predeterminado es 'false'.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp=Configuraci\u00F3n del contenedor de JSP.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.add=A\u00F1ade la configuraci\u00F3n del contenedor de JSP.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.remove=Borra la configuraci\u00F3n del contenedor de JSP.
undertow.setting.jsp.development=Activar el modo de derarrollo, el cual permite la recarga inmediata de JSP.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.disabled=Inhabilita el contenedor JSP.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.keep-generated=Guarda los Servlets generados.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.trim-spaces=Corta algunos espacios del Servlet generado.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.tag-pooling=Habilita un pooling de etiquetas.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.mapped-file=Asigna la fuente de JSP.
undertow.setting.jsp.check-interval=Revise el intervalo para actualizaciones de JSP mediante un hilo en segundo plano. Esto no afecta la mayor\u00EDa de implementaciones donde las notificaciones de cambio de JSP se gestionan a trav\u00E9s del API de notificaci\u00F3n del sistema de archivos. Esto solo entra en vigor si el servicio de vigilancia de archivos est\u00E1 deshabilitado.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.modification-test-interval=Cantidad m\u00EDnima del tiempo entre dos pruebas para actualizaciones en segundos.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.recompile-on-fail=Reintenta las compilaciones de JSP fallidas en cada petici\u00F3n. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.smap=Habilita SMAP.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.dump-smap=Escribe datos SMAP al archivo.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.generate-strings-as-char-arrays=Genera cadenas constantes como un array de caracteres
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.error-on-use-bean-invalid-class-attribute=Habilita errores cuando se utiliza una clase err\u00F3nea en useBean.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.scratch-dir=Especifica un directorio de trabajo diferente.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.source-vm=Nivel de fuente de MV para compilaci\u00F3n.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.target-vm=Nivel de MV de destino para compilaci\u00F3n.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.java-encoding=Especifica la codificaci\u00F3n utilizada para fuentes de Java.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author guegl
undertow.setting.jsp.x-powered-by=Habilita la publicidad del motor de JSP en x-powered-by.
undertow.setting.jsp.display-source-fragment=Cuando se presenta un error de runtime, intenta desplegar el fragmento de fuente de JSP. 
undertow.setting.jsp.optimize-scriptlets=Indica si los scriptletsJSP deben ser optimizados para retirar la concatenaci\u00F3n de cadenas
undertow.setting.session-cookie=Configuraci\u00F3n de la cookie de sesi\u00F3n
undertow.setting.session-cookie.add=Agrega la configuraci\u00F3n de la cookie de sesi\u00F3n
undertow.setting.session-cookie.remove=Retira la configuraci\u00F3n de la cookie de sesi\u00F3n
undertow.setting.session-cookie.name=Nombre de la cookie
undertow.setting.session-cookie.http-only=Es una cookie http-only
undertow.setting.session-cookie.secure=\u00BFEs una cookie segura?
undertow.setting.session-cookie.domain=Dominio de cookies
undertow.setting.session-cookie.comment=Comentario de cookie
undertow.setting.session-cookie.max-age=Edad m\u00E1xima de la cookie
undertow.setting.persistent-sessions=Sesiones de persistencia de sesi\u00F3n
undertow.setting.persistent-sessions.enabled=Si es 'true', las sesiones persistentes se habilitar\u00E1n
undertow.setting.persistent-sessions.add=Agrega los recursos de sesiones persistentes
undertow.setting.persistent-sessions.remove=Retira los recursos de sesiones persistentes
undertow.setting.persistent-sessions.path=La ruta al directorio de datos de las sesiones persistentes. Si son sesiones 'null' ser\u00E1n almacenadas en memoria.
undertow.setting.persistent-sessions.relative-to=El directorio al que la ruta es relativa. 
undertow.handler.simple-error-page=Configuraci\u00F3n de p\u00E1gina de error simple
undertow.setting.websockets=Indica si websockets est\u00E1n habilitados para este contenedor
undertow.setting.websockets.add=Agrega soporte para websockets
undertow.setting.websockets.remove=Retira el soporte para websockets
undertow.setting.websockets.dispatch-to-worker=Si las llamadas deben hacerse hacia un hilo de Worker. Si es 'false', entonces se ejecutar\u00E1n en el hilo de E/S, el cual es m\u00E1s r\u00E1pido. Sin embargo,  se debe tener cuidado de no realizar operaciones de bloqueo.
undertow.setting.websockets.worker=El worker que va a utilizar para implementaciones websocket
undertow.setting.websockets.buffer-pool=El grupo de b\u00FAferes que va a utilizar para implementaciones websocket
undertow.setting.websockets.per-message-deflate=Habilita la extensi\u00F3n de compresi\u00F3n per-message de websocket, RTC-7692
undertow.setting.websockets.deflater-level=Configura el nivel de compresi\u00F3n del algoritmo DEFLATE
undertow.setting.crawler-session-management=Configura el manejo de sesiones especiales para Bots rastreadores
undertow.setting.crawler-session-management.add=Agrega el manejo de sesiones especiales para Bots rastreadores
undertow.setting.crawler-session-management.remove=Retira el manejo de sesiones especiales para Bots rastreadores
undertow.setting.crawler-session-management.user-agents=Expresi\u00F3n regular que sirve para hacer corresponder al agente de usuario de un rastreador 
undertow.setting.crawler-session-management.session-timeout=El tiempo de espera para sesiones pertenecientes a rastreadores
undertow.handler.simple-error-page.add=Agrega una p\u00E1gina de error simple
undertow.handler.simple-error-page.remove=Retira una p\u00E1gina de error simple
undertow.handler.simple-error-page.name=El nombre de la p\u00E1gina de error
undertow.handler.simple-error-page.code=C\u00F3digo de error
undertow.handler.file=Manejador de archivos
undertow.handler.file.add=Agrega manejador de archivos
undertow.handler.file.remove=Retira manejador de archivos
undertow.handler.file.name=Nombre del manejador de archivos
undertow.handler.file.path=Ruta del sistema de archivos desde donde el manejador de archivos entrega recursos.
undertow.handler.file.cache-buffer-size=El tama\u00F1o en bytes de los b\u00FAferes.
undertow.handler.file.cache-buffers=El n\u00FAmero de b\u00FAferes
undertow.handler.file.directory-listing=\u00BFHabilitar el listado de directorios?
undertow.handler.file.follow-symlink=\u00BFHabilitar los siguientes enlaces simb\u00F3licos?
undertow.handler.file.safe-symlink-paths=Rutas protegidas de ser objetivo de enlaces simb\u00F3licos
undertow.handler.file.case-sensitive=Manejo de un archivo sensible al uso de may\u00FAsculas
undertow.handler.reverse-proxy=Un manejador proxy inverso
undertow.handler.reverse-proxy.add=Agrega un manejador proxy inverso
undertow.handler.reverse-proxy.remove=Retira un manejador proxy inverso
undertow.handler.reverse-proxy.problem-server-retry=El tiempo de espera en segundos antes de intentar la reconexi\u00F3n a un servidor que est\u00E1 ca\u00EDdo. 
undertow.handler.reverse-proxy.sticky-session-lifetime=Tiempo de supervivencia en minutos de una sesi\u00F3n pegajosa 
undertow.handler.reverse-proxy.session-cookie-names=Una lista separada por comas de los nombres de cookie de sesi\u00F3n. Por lo general, ser\u00E1 JSESSIONID.
undertow.handler.reverse-proxy.max-request-time=El tiempo m\u00E1ximo que una solicitud de proxy puede estar activa, antes de que sea eliminada. 
undertow.handler.reverse-proxy.connections-per-thread=El n\u00FAmero de conexiones que se mantendr\u00E1n para los servidores de segundo plano, por hilos de  E/S.
undertow.handler.reverse-proxy.request-queue-size=El n\u00FAmero de solicitudes que pueden ponerse en espera,  si el grupo de conexiones est\u00E1 lleno antes de que sean rechazadas con un 503. 
undertow.handler.reverse-proxy.host=Un host al que el proxy inverso enviar\u00E1 solicitudes
undertow.handler.reverse-proxy.host.instance-id=El ID de instancia (conocido como ruta JVM) que ser\u00E1 utiizado para habilitar sesiones pegajosas
undertow.handler.reverse-proxy.host.outbound-socket-binding=Un enlaces de socket saliente para este host
undertow.handler.reverse-proxy.host.scheme=La clase de esquema utilizado
undertow.handler.reverse-proxy.host.path=La ruta opcional si el host est\u00E1 utilizando un recurso sin root.
undertow.handler.reverse-proxy.cached-connections-per-thread=El n\u00FAmero de conexiones que se mantendr\u00E1n vivas indefinidamente.
undertow.handler.reverse-proxy.connection-idle-timeout=La cantidad de tiempo que una conexi\u00F3n puede estar inactiva antes de que sea cerrada. Las conexiones no expirar\u00E1n una vez que el tama\u00F1o del grupo sea reducido al m\u00EDnimo configurado (ver cached-connections-per-thread)
undertow.handler.reverse-proxy.host.add=Agrega un host de manejador proxy inverso
undertow.handler.reverse-proxy.host.remove=Retira un host de manejador proxy inverso
undertow.handler.reverse-proxy.host.security-realm=El dominio de seguridad que proporciona la configuraci\u00F3n SSL para la conexi\u00F3n al host.
undertow.handler.reverse-proxy.host.ssl-context=Hace referencia al contexto SSL que va a ser utilizado por este manejador.
undertow.handler.reverse-proxy.host.security-realm.deprecated=Utiliza un atributo ssl-context para hacer referencia directamente a un contexto SSL configurado.
undertow.handler.reverse-proxy.host.enable-http2=Si es verdadero, el proxy intentar\u00E1 usar HTTP/2 para conectarse con el backend. Si no es comparible, recurrir\u00E1 a HTTP/1.1/
undertow.handler.reverse-proxy.max-retries=Las veces que puede reintentar una solicitud si esta falla. Observe que si una solicitud no es considerada idempotente,  se reintentar\u00E1 si el proxy est\u00E1 seguro que no fue enviada al servidor de segundo plano.
undertow.filter.basic-auth=La configuraci\u00F3n de autenticaci\u00F3n b\u00E1sica
undertow.filter.basic-auth.add=Agregar la autenticaci\u00F3n b\u00E1sica
undertow.filter.basic-auth.remove=Eliminar la autenticaci\u00F3n b\u00E1sica
undertow.filter.basic-auth.name=El nombre del filtro
undertow.filter.basic-auth.security-domain=Dominio de seguridad
undertow.filter.connection-limit=Manejador del limitador de peticiones concurrentes. Nombre de legafo depreciado para el recurso request-limit.
undertow.filter.connection-limit.add=Agregar limitador de peticiones
undertow.filter.connection-limit.remove=Retirar limitador
undertow.filter.connection-limit.name=Nombre del manejador
undertow.filter.connection-limit.max-concurrent-requests=El n\u00FAmero m\u00E1ximo de peticiones concurrentes
undertow.filter.connection-limit.queue-size=El n\u00FAmero de peticiones concurrentes antes de que comiencen a ser rechazadas 
undertow.filter.request-limit=El manejador limitador de peticiones concurrentes
undertow.filter.request-limit.add=Agregar limitador de peticiones
undertow.filter.request-limit.remove=Retirar limitador
undertow.filter.request-limit.name=Nombre del manejador
undertow.filter.request-limit.max-concurrent-requests=El n\u00FAmero m\u00E1ximo de peticiones concurrentes
undertow.filter.request-limit.queue-size=El n\u00FAmero de peticiones concurrentes antes de que comiencen a ser rechazadas 
undertow.filter.response-header=El filtro de encabezado de respuesta le permite agregar encabezados personalizados.
undertow.filter.response-header.add=Agrega  filtro
undertow.filter.response-header.remove=Retira filtro
undertow.filter.response-header.name=El nombre del filtro
undertow.filter.response-header.header-name=Nombre del encabezado
undertow.filter.response-header.header-value=Valor para encabezado
undertow.filter.gzip=Define el filtro gzip
undertow.filter.gzip.add=Agrega  filtro
undertow.filter.gzip.remove=Retira filtro
undertow.filter.gzip.name=El nombre del filtro
undertow.filter.error-page=P\u00E1ginas de errores
undertow.filter.error-page.add=Agrega una p\u00E1gina de errores
undertow.filter.error-page.remove=Retira una p\u00E1gina de errores
undertow.filter.error-page.name=El nombre de la p\u00E1gina de errores
undertow.filter.error-page.code=Ruta de la p\u00E1gina de errores
undertow.filter.error-page.path=Error de la ruta de p\u00E1ginas
undertow.filter.custom-filter=Personalizar filtro
undertow.filter.custom-filter.add=Agregar filtro personalizado
undertow.filter.custom-filter.remove=Retirar filtro personalizado
undertow.filter.custom-filter.class-name=Nombre de clase de HttpHandler
undertow.filter.custom-filter.module=Nombre de m\u00F3dulo desde donde se puede cargar la clase
undertow.filter.custom-filter.parameters=Par\u00E1metros de filtro
undertow.filter.expression-filter=Un filtro analizado en el lenguaje de expresiones Undertow 
undertow.filter.expression-filter.add=Agrega un filtro analizado en el lenguaje de expresiones Undertow 
undertow.filter.expression-filter.remove=Borrar filtro de expresiones
undertow.filter.expression-filter.expression=La expresi\u00F3n que define el filtro
undertow.filter.expression-filter.module=El m\u00F3dulo que carga las definiciones de filtro
undertow.filter.rewrite=Un filtro de reescritura (o de redirecci\u00F3n) 
undertow.filter.rewrite.add=Agregar un filtro de reescritura 
undertow.filter.rewrite.remove=Borrar un filtro de reescritura 
undertow.filter.rewrite.target=La expresi\u00F3n que define el destino. Si est\u00E1 redirigiendo a un destino constante encierre el valor en comillas simples.
undertow.filter.rewrite.redirect=Si es 'true', entonces no se reescribir\u00E1 sino que se redirigir\u00E1.
undertow.host.location=Contiene la configuraci\u00F3n del recurso de emplazamiento
undertow.host.location.add=Agregar nueva ubicaci\u00F3n
undertow.host.location.remove=Borrar esta ubicaci\u00F3n
undertow.host.location.name=Nombre del sitio, act\u00FAa como ruta de contexto
undertow.host.location.handler=El manejador predeterminado para esta ubicaci\u00F3n
undertow.host.location.filter-ref=Referencia al filtro
undertow.host.filter-ref=Referencia al filtro
undertow.filter-ref=Referencia al filtro
undertow.filter-ref.add=Agrega nueva referencia
undertow.filter-ref.remove=Borra referencia seleccionada
undertow.filter-ref.name=Referencia a qu\u00E9 filtro
undertow.filter-ref.predicate=Los predicados proporcionan una forma sencilla de tomar una decisi\u00F3n verdadera o falsa en un intercambio. Muchos manejadores deben ser aplicados de forma condicional y los predicados  proporcionan un m\u00E9todo general de especificar una condici\u00F3n.
undertow.filter-ref.priority=Define el orden del filtro, debe ser 1 o m\u00E1s, el n\u00FAmero superior le indica al servidor que debe ser incluido primero en la cadena del manejador con respecto a otros servidores en el mismo contexto.
undertow.application-security-domain=Una asignaci\u00F3n de dominio de seguridad referente a una aplicaci\u00F3n implementada.
undertow.application-security-domain.add=Agregar una nueva asignaci\u00F3n de dominio de seguridad referente a una aplicaci\u00F3n.
undertow.application-security-domain.remove=Borrar la asignaci\u00F3n de dominio de seguridad  referente a  una aplicaci\u00F3n.
undertow.application-security-domain.http-authentication-factory=El HTTP Authentication Factory que va a ser utilizado por las implementaciones referenteas al dominio de seguridad asignado.
undertow.application-security-domain.override-deployment-config=En caso de que la configuraci\u00F3n de autenticaci\u00F3n en la implemantaci\u00F3n sea anulada por la f\u00E1brica.
undertow.application-security-domain.enable-jacc=Habilitar la autorizaci\u00F3n con JACC
undertow.application-security-domain.referencing-deployments=Las implementaciones referentes a esta asignaci\u00F3n actual.
undertow.application-security-domain.setting=Configuraci\u00F3n
undertow.deployment=Informaci\u00F3n acerca de la gesti\u00F3n del contenedor web de esta implementaci\u00F3n
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author M Benitez
undertow.deployment.context-root=El contexto ra\u00EDz de la aplicaci\u00F3n web
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author M Benitez
undertow.deployment.virtual-host=El nombre del host virtual en el cual la aplicaci\u00F3n web reside
undertow.deployment.server=El nombre del servidor al que pertenece esta aplicaci\u00F3n
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author M Benitez
undertow.deployment.active-sessions=N\u00FAmero de sesiones activas
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author M Benitez
undertow.deployment.expired-sessions=N\u00FAmero de sesiones expiradas
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author M Benitez
undertow.deployment.rejected-sessions=N\u00FAmero de sesiones rechazadas
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author M Benitez
undertow.deployment.max-active-sessions=El n\u00FAmero m\u00E1ximo de sesiones concurrentes  que admite este gestor de sesiones.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author M Benitez
undertow.deployment.sessions-created=Total de sesiones creadas
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author M Benitez
undertow.deployment.duplicated-session-ids=N\u00FAmero de IDs de sesi\u00F3nduplicados generados por la fuente aleatoria (cualquier valor mayor a 0 causa problemas)
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author M Benitez
undertow.deployment.session-avg-alive-time=Tiempo promedio (en segundos) que las sesiones expiradas han permanecido vivas
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author M Benitez
undertow.deployment.session-max-alive-time=El mayor tiempo (en segundos) que una sesi\u00F3n expirada ha permanecido viva
undertow.deployment.servlet=Informaci\u00F3n acerca del estado y la configuraci\u00F3n de este servlet
undertow.deployment.servlet.servlet-name=Nombre del Servlet
undertow.deployment.servlet.servlet-class=Clase del Servlet
undertow.deployment.servlet.min-request-time=Tiempo m\u00EDnimo para el procesamiento de la solicitud
undertow.deployment.servlet.max-request-time=Tiempo m\u00E1ximo para el procesamiento de la solicitud
undertow.deployment.servlet.total-request-time=Tiempo total utilizado para el procesamiento de todas las peticiones
undertow.deployment.servlet.request-count=N\u00FAmero total de peticiones
undertow.deployment.servlet.mappings=Mapeos de Sevlet
undertow.deployment.websocket=Informaci\u00F3n acerca del estado y la configuraci\u00F3n de este websocket
undertow.deployment.websocket.endpoint-class=Clase de punto de acceso 
undertow.deployment.websocket.path=La ruta de implementaci\u00F3n del punto de acceso
undertow.deployment.invalidate-session=Invalida una determinada sesi\u00F3n
undertow.deployment.invalidate-session.session-id=El ID de sesi\u00F3n que se debe invalidar
undertow.filter.mod-cluster=Un gestor de carga frontal de mod-cluster 
undertow.handler.mod-cluster=Un gestor de carga frontal de mod-cluster 
undertow.handler.mod-cluster.add=Agrega un gestor de carga frontal de mod-proxy
undertow.handler.mod-cluster.remove=Retira un manejador proxy de mod-cluster
undertow.handler.mod-cluster.management-socket-binding=El enlace de sockets del puerto y de la direcci\u00F3n de administraci\u00F3n de mod_cluster. Cuando se usa mod_cluster, se deben definir dos oyentes HTTP, uno p\u00FAblico para gestionar las solicitudes, y uno vinculado a la red interna para gestionar los comandos del cl\u00FAster  mod. Este enlace de sockets deber\u00EDa corresponder al oyente interno y no deber\u00EDa estar disponible para el p\u00FAblico.
undertow.handler.mod-cluster.advertise-socket-binding=El puerto y grupo multidifusi\u00F3n que se utilizan para publicitar.
undertow.handler.mod-cluster.security-key=La llave de seguridad utiizada para el grupo mod-cluster. Todos los miembros deben utilizar la misma llave de seguridad.
undertow.handler.mod-cluster.advertise-protocol=El protocolo en uso.
undertow.handler.mod-cluster.advertise-path=La ruta en la que mod-cluster est\u00E1 registrado.
undertow.handler.mod-cluster.advertise-frequency=La frecuencia (en milisegundos) en la que mod-cluster se anuncia en la red
undertow.handler.mod-cluster.failover-strategy=Determina c\u00F3mo se elige un nodo de conmutaci\u00F3n por error en el caso de que el nodo con el que una sesi\u00F3n tiene afinidad no est\u00E9 disponible.
undertow.handler.mod-cluster.health-check-interval=La frecuencia de pings de control de salud a los nodos de backend
undertow.handler.mod-cluster.broken-node-timeout=La cantidad de tiempo que debe pasar antes de que el nodo afectado sea retirado de la tabla
undertow.handler.mod-cluster.max-request-time=La cantidad m\u00E1xima de tiempo que la petici\u00F3n a un nodo de backend puede tomar antes de ser aniquilado.
undertow.handler.mod-cluster.management-access-predicate=Un predicado que se aplica a las solicitudes de entrada para determinar si pueden ejecutar comandos de administraci\u00F3n mod_cluster. Proporciona seguridad adicional por encima de lo que se provee al  limitar la gesti\u00F3n de las solicitudes que se originan de  management-socket-binding.
undertow.handler.mod-cluster.session-cookie-names=Una lista separada por comas de los nombres de cookie de sesi\u00F3n. Por lo general, ser\u00E1 JSESSIONID.
undertow.handler.mod-cluster.connections-per-thread=El n\u00FAmero de conexiones que se mantendr\u00E1n para los servidores de segundo plano, por hilos de  E/S.
undertow.handler.mod-cluster.request-queue-size=El n\u00FAmero de solicitudes que pueden ponerse en espera,  si el grupo de conexiones est\u00E1 lleno antes de que sean rechazadas con un 503. 
undertow.handler.mod-cluster.cached-connections-per-thread=El n\u00FAmero de conexiones que se mantendr\u00E1n vivas indefinidamente.
undertow.handler.mod-cluster.connection-idle-timeout=La cantidad de tiempo que una conexi\u00F3n puede estar inactiva antes de que sea cerrada. Las conexiones no expirar\u00E1n una vez que el tama\u00F1o del grupo sea reducido al m\u00EDnimo configurado (ver cached-connections-per-thread)
undertow.handler.mod-cluster.worker=El Worker XNIO que es utiizado para enviar las notificaciones de anuncios
undertow.handler.mod-cluster.ssl-context=Hace referencia al contexto SSL que va a ser utilizado por este filtro.
undertow.handler.mod-cluster.security-realm=El dominio de seguridad que proporciona la configuraci\u00F3n SSL
undertow.handler.mod-cluster.security-realm.deprecated=Utiliza un atributo ssl-context para hacer referencia directamente a un contexto SSL configurado.
undertow.handler.mod-cluster.use-alias=Indica si ha tenido lugar una verificaci\u00F3n de alias
undertow.handler.mod-cluster.enable-http2=Si el equilibrador de carga debe intentar actualizar las conexiones de segundo plano para HTTP2.  Si HTTP2 no tiene soporte HTTP o HTTP2 ser\u00E1 utilizado como normal. 
undertow.handler.mod-cluster.max-ajp-packet-size=El tama\u00F1o m\u00E1ximo de los paquetes AJP. El aumento de este AJP permitir\u00E1 trabajar para solicitudes y  respuestas que tienen una gran cantidad de encabezados. Esta es una opci\u00F3n avanzada, y debe ser la misma entre los equilibradores de carga y servidores back-end.
undertow.handler.mod-cluster.http2-enable-push=Especifica si el env\u00EDo est\u00E1 habilitado para conexiones HTTP/2
undertow.handler.mod-cluster.http2-max-frame-size=El tama\u00F1o m\u00E1ximo del marco HTTP/2
undertow.handler.mod-cluster.http2-max-concurrent-streams=El n\u00FAmero m\u00E1ximo de flujos HTTP/2 que pueden estar activos al mismo tiempo en una conexi\u00F3n sencilla.
undertow.handler.mod-cluster.http2-max-header-list-size=El tama\u00F1o m\u00E1ximo de los encabezados de solicitudes que el servidor est\u00E1 preparado para aceptar.
undertow.handler.mod-cluster.http2-initial-window-size=El tama\u00F1o de la ventana de control de flujo que supervisa qu\u00E9 tan r\u00E1pido como el cliente env\u00EDa datos al servidor.
undertow.handler.mod-cluster.http2-header-table-size=El tama\u00F1o en bytes de la tabla de encabezados para la compresi\u00F3n HPACK.  Esta cantidad de memoria ser\u00E1 asignada por conexi\u00F3n para compresi\u00F3n. Los valores m\u00E1s grandes usan m\u00E1s memoria, pero pueden mejorar la compresi\u00F3n.
undertow.handler.mod-cluster.balancer=La representaci\u00F3n de runtime de un equilibrador mod_cluster
undertow.handler.mod-cluster.balancer.sticky-session-path=La ruta de la cookie de sesi\u00F3n pegajosa
undertow.handler.mod-cluster.balancer.sticky-session=Indica si las sesiones pegajosas est\u00E1n habilitadas
undertow.handler.mod-cluster.balancer.sticky-session-cookie=El nombre de la cookie de sesi\u00F3n
undertow.handler.mod-cluster.balancer.sticky-session-force=Si es 'true', entonces retornar\u00E1 un error si la petici\u00F3n no puede  ser dirigida a un nodo pegajoso, de lo contrario, ser\u00E1 dirigida a otro nodo.
undertow.handler.mod-cluster.balancer.sticky-session-remove=Retira la cookie de sesi\u00F3n si la solicitud no puede dirigirse al host correcto.
undertow.handler.mod-cluster.balancer.max-attempts=El n\u00FAmero de intentos para enviar la solicitud al servidor de segundo plano
undertow.handler.mod-cluster.balancer.wait-worker=El n\u00FAmero de segundos de espera para que un Worker est\u00E9 disponible
undertow.handler.mod-cluster.max-retries=Las veces que puede reintentar una solicitud si esta falla. Observe que si una solicitud no es considerada idempotente,  se reintentar\u00E1 si el proxy est\u00E1 seguro que no fue enviada al servidor de segundo plano.
undertow.handler.mod-cluster.balancer.node=La representaci\u00F3n de runtime de un nodo mod_cluster
undertow.handler.mod-cluster.balancer.node.context=La representaci\u00F3n de runtime de un contexto mod_cluster
undertow.handler.mod-cluster.balancer.node.context.requests=El n\u00FAmero de peticiones en este oyente.
undertow.handler.mod-cluster.balancer.node.context.status=Estado de este contexto
undertow.handler.mod-cluster.balancer.node.load=La carga actual de este nodo
undertow.handler.mod-cluster.balancer.node.elected=El conteo elegido
undertow.handler.mod-cluster.balancer.node.status=El estado actual de este nodo
undertow.handler.mod-cluster.balancer.node.disable=Inhabilita todos los contextos de este nodo
undertow.handler.mod-cluster.balancer.node.enable=Habilita todos los contextos de este nodo
undertow.handler.mod-cluster.balancer.node.stop=Detiene todos los contextos de este nodo
undertow.handler.mod-cluster.balancer.node.uri=La URI que el equilibrador de carga utiliza para conectarse al nodo
undertow.handler.mod-cluster.balancer.node.aliases=Los alias de nodos
undertow.handler.mod-cluster.balancer.node.context.disable=Inhabilita este contexto
undertow.handler.mod-cluster.balancer.node.context.enable=Habilita este contexto
undertow.handler.mod-cluster.balancer.node.context.stop=Detiene este contexto
undertow.handler.mod-cluster.balancer.node.load-balancing-group=El grupo de equilibrio de carga al que pertenece este nodo
undertow.handler.mod-cluster.balancer.node.cache-connections=El n\u00FAmero de conexiones que se mantendr\u00E1n vivas indefinidamente.
undertow.handler.mod-cluster.balancer.node.max-connections=El n\u00FAmero m\u00E1ximo de conexiones por hilo E/O 
undertow.handler.mod-cluster.balancer.node.open-connections=El n\u00FAmero actual de conexiones abiertas
undertow.handler.mod-cluster.balancer.node.ping=Los ping de nodos
undertow.handler.mod-cluster.balancer.node.read=El n\u00FAmero de bytes le\u00EDdos desde el nodo
undertow.handler.mod-cluster.balancer.node.timeout=La solicitud de tiempo de expiraci\u00F3n
undertow.handler.mod-cluster.balancer.node.written=El n\u00FAmero de bytes transferidos al nodo
undertow.handler.mod-cluster.balancer.node.ttl=El tiempo en que las conexiones se mantendr\u00E1n vivas  sin solicitudes antes de ser cerradas si el n\u00FAmero de conexiones es superior a cach\u00E9-connections
undertow.handler.mod-cluster.balancer.node.flush-packets=Indica si los datos recibidos deben ser vaciados inmediatamente
undertow.handler.mod-cluster.balancer.node.queue-new-requests=Si las petici\u00F3n es recibida y no hay un Worker disponible de inmediato, debe ponerse en cola
undertow.handler.mod-cluster.balancer.node.request-queue-size=El tama\u00F1o de la cola de petici\u00F3n
undertow.handler.mod-cluster.balancer.load-balancing-group=Un grupo de equilibrio de carga 
undertow.handler.mod-cluster.balancer.load-balancing-group.enable-nodes=Habilita todos los nodos en el grupo de equilibrio de carga 
undertow.handler.mod-cluster.balancer.load-balancing-group.disable-nodes=Inhabilita todos los nodos en el grupo de equilibrio de carga 
undertow.handler.mod-cluster.balancer.load-balancing-group.stop-nodes=Detiene todos los nodos en el grupo de equilibrio de carga 
undertow.http-invoker=Los servicios del invocador HTTP que permiten la invocaci\u00F3n de servicios basada en HTTP remota, como EJB y nomenclatura
undertow.http-invoker.add=Agrega el servicio del invocador HTTP al host
undertow.http-invoker.remove=Elimina el servicio del invocador HTTP
undertow.http-invoker.path=La ruta en la cual est\u00E1n instalados los servicios
undertow.http-invoker.http-authentication-factory=La f\u00E1brica de autenticaci\u00F3n HTTP que se usa para la autenticaci\u00F3n
undertow.http-invoker.security-realm=El campo del equipo de seguridad que se usa para la autenticaci\u00F3n\n
