undertow=Subsistema Undertow
undertow.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o de subsistema
undertow.remove=Opera\u00E7\u00E3o de supress\u00E3o de subsistema
undertow.configuration=nulo
undertow.default-virtual-host=O host virtual padr\u00E3o para utilizar para as implementa\u00E7\u00F5es 
undertow.default-servlet-container=O cont\u00EAiner de servlet padr\u00E3o para utilizar para implementa\u00E7\u00F5es 
undertow.default-server=O servidor padr\u00E3o utilizado para implementa\u00E7\u00F5es
undertow.instance-id=ID de inst\u00E2ncia de cluster
undertow.statistics-enabled=Configura se as estat\u00EDsticas est\u00E3o ativadas. As altera\u00E7\u00F5es entram em vigor imediatamente nas estat\u00EDsticas em n\u00EDvel de conector, mas as estat\u00EDsticas em n\u00EDvel de implanta\u00E7\u00E3o ser\u00E3o afetadas somente ap\u00F3s a reimplanta\u00E7\u00E3o da implanta\u00E7\u00E3o (ou recarregamento do cont\u00EAiner).
undertow.default-security-domain=O dom\u00EDnio de seguran\u00E7a padr\u00E3o utilizado por implementa\u00E7\u00F5es web
undertow.buffer-cache=O cache do buffer usado para colocar o conte\u00FAdo est\u00E1tico em cache. 
undertow.buffer-cache.add=Adiciona um cache do buffer
undertow.buffer-cache.remove=Remove um cache do buffer
undertow.buffer-cache.name=O nome de cache
undertow.buffer-cache.buffer-size=O tamanho de um buffer individual, em bytes.
undertow.buffer-cache.buffers-per-region=Os n\u00FAmeros de buffers de uma regi\u00E3o 
undertow.buffer-cache.max-regions=O n\u00FAmero m\u00E1ximo de regi\u00F5es 
undertow.server=Um servidor 
undertow.server.add=Adiciona um servidor 
undertow.server.remove=Remove um servidor 
undertow.server.name=O nome do servidor 
undertow.server.default-host=O host virtual padr\u00E3o de servidores
undertow.server.servlet-container=O cont\u00EAiner de servlet padr\u00E3o de servidores
undertow.server.http-listener=Um ouvinte HTTP
undertow.server.https-listener=Um ouvinte HTTPS
undertow.server.ajp-listener=Um ouvinte AJP 
undertow.server.host=O host de servidores
undertow.servlet-container=Um cont\u00EAiner de servlet
undertow.servlet-container.add=Adiciona um cont\u00EAiner de servlet
undertow.servlet-container.remove=Remove um cont\u00EAiner de servlet
undertow.servlet-container.name=O nome de cont\u00EAiner de servlet 
undertow.servlet-container.default-buffer-cache=O  cache do buffer para utilizar para os recursos est\u00E1ticos em cache 
undertow.servlet-container.stack-trace-on-error=Indica se uma p\u00E1gina de erro com stack trace deve ser gerada em caso de erros.  Os valores s\u00E3o all, none e local-only
undertow.servlet-container.setting=Configura\u00E7\u00F5es de cont\u00EAiner de servlet
undertow.servlet-container.persistent-sessions=Indica se o cont\u00EAiner de servlet deve persistir sess\u00F5es atrav\u00E9s de reimplanta\u00E7\u00F5es 
undertow.servlet-container.allow-non-standard-wrappers=Se definido para true,  ent\u00E3o wrappers de solicita\u00E7\u00E3o e resposta que n\u00E3o se estendem  \u00E0s classes wrapper padr\u00F5es podem ser utilizados. 
undertow.servlet-container.use-listener-encoding=Utilise uma codifica\u00E7\u00E3o definida no ouvinte
undertow.servlet-container.ignore-flush=Ignore  esvaziamentos no fluxo de sa\u00EDda de servlet. Na maioria dos casos,  s\u00F3 interferem no desempenho sem uma bom motivo. 
undertow.servlet-container.default-encoding=Codifica\u00E7\u00E3o padr\u00E3o para utilizar para todas implanta\u00E7\u00F5es de aplicativos 
undertow.servlet-container.eager-filter-initialization=Se definido para true,  undertow chama filtro init() no in\u00EDcio da implanta\u00E7\u00E3o ao inv\u00E9s de quando solicitado. 
undertow.servlet-container.default-session-timeout=O padr\u00E3o de limite de tempo da sess\u00E3o (em minutos) para todos aplicativos implantados no cont\u00EAiner.
undertow.servlet-container.use-global-request-controller=Se isto for true, Undertow ir\u00E1 registrar-se com o controlador de solicita\u00E7\u00F5es global. Isto tem um leve impacto no desempenho, mas permite desligamento autom\u00E1tico e um limite global no n\u00FAmero de solicita\u00E7\u00F5es ativas no servidor.
undertow.servlet-container.disable-caching-for-secured-pages=Se Undertow deve definir cabe\u00E7alhos para desativar caching para p\u00E1ginas seguras. Desativando isto pode causar problemas de seguran\u00E7a, pois p\u00E1ginas confidenciais podem ser armazenadas em cache por um intermedi\u00E1rio. 
undertow.servlet-container.mime-mapping=Config de mapeamento mime de servlet
undertow.servlet-container.welcome-file=Um arquivo welcome
undertow.servlet-container.directory-listing=Se listas de diret\u00F3rios devem ser ativadas para servlets padr\u00E3o. 
undertow.servlet-container.proactive-authentication=Se autentica\u00E7\u00E3o proativa deve ser utilizada. Se isso for true um usu\u00E1rio ser\u00E1 sempre autenticado se as credenciais s\u00E3o presentes. 
undertow.servlet-container.session-id-length=O comprimento da ID da sess\u00E3o gerada. IDs de sess\u00E3o mais longas s\u00E3o mais seguras.  Este n\u00FAmero refere-se ao n\u00FAmero de bytes aleat\u00F3rios que s\u00E3o utilizados para gerar a ID de sess\u00E3o, a ID que ser\u00E1 enviada ao cliente ser\u00E1 base64 codificada, portanto ser\u00E1 33% maior (por exemplo, o comprimento de id de sess\u00E3o de 30 ir\u00E1 resultar em um valor de cookie de comprimento de 40). 
undertow.servlet-container.max-sessions=O n\u00FAmero m\u00E1ximo de sess\u00F5es que podem ser ativas de uma vez. 
undertow.servlet-container.disable-file-watch-service=Se isto for true, ent\u00E3o o servi\u00E7o de monitoramento de arquivo n\u00E3o ser\u00E1 usado para monitorar altera\u00E7\u00F5es das  implanta\u00E7\u00F5es explodidas
undertow.servlet-container.disable-session-id-reuse=Se isso for verdadeiro, uma ID de sess\u00E3o desconhecida nunca ser\u00E1 reutilizada, e uma nova ID de sess\u00E3o ser\u00E1 gerada. Se isso for falso, ela ser\u00E1 reutilizada se e somente se estiver presente no gerenciador de sess\u00E3o de outra implanta\u00E7\u00E3o, para permitir que a mesma ID de sess\u00E3o seja compartilhada entre aplicativos no mesmo servidor.
undertow.mime-mapping=A configura\u00E7\u00E3o de mapeamento mime do cont\u00EAiner de servlet. 
undertow.mime-mapping.add=Adiciona um mapeamento mime
undertow.mime-mapping.remove=Remove um mapeamento mime
undertow.mime-mapping.value=O tipo de mime para este mapeamento
undertow.welcome-file=Um arquivo welcome
undertow.welcome-file.add=Adiciona um arquivo welcome
undertow.welcome-file.remove=Remove um arquivo welcome
undertow.error-page=P\u00E1ginas de erros de servidor
undertow.handler=Manipuladores Undertow
undertow.handler.add=Adicione o elemento de manipula\u00E7\u00E3o 
undertow.handler.remove=Remove o elemento de manipula\u00E7\u00E3o 
undertow.handler.name=O nome de manipulador
undertow.filter=Filtros de Undertow
undertow.filter.add=Adicione o elemento de filtro 
undertow.filter.remove=Remove um elemento de filtro
undertow.filter.name=O nome do filtro 
undertow.ajp-listener=Um ouvinte APJ
undertow.ajp-listener.add=Adiciona um ouvinte APJ 
undertow.ajp-listener.remove=Remove um ouvinte AJP 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.access-log=A configura\u00E7\u00E3o do log de acesso para esse servidor virtual.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.access-log.add=Adiciona acesso \u00E0 configura\u00E7\u00E3o de log para esse servidor virtual.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.access-log.remove=Remove o acesso da configura\u00E7\u00E3o de log deste servidor. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.access-log.pattern=O acesso padr\u00E3o de log.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.access-log.prefix=O prefixo para o nome do arquivo de log.
undertow.access-log.suffix=Sufixo para o nome de arquivo de log. 
undertow.access-log.directory=Diret\u00F3rio no qual salvar logs. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.access-log.rotate=Roteia o log de acesso diariamente.
undertow.access-log.worker=Nome do worker para utilizar para registar em log
undertow.access-log.use-server-log=Se o log deve ser gravado ao log do servidor, ao inv\u00E9s de um arquivo separado. 
undertow.access-log.relative-to=O diret\u00F3rio que \u00E9 relativo ao caminho 
undertow.access-log.extended=Se o registro em log utiliza o formato de arquivo estendido 
undertow.access-log.predicate=Predicado que determina se a requisi\u00E7\u00E3o deve ser registrada em log
undertow.single-sign-on=Uma configura\u00E7\u00E3o de mecanismo de autentica\u00E7\u00E3o SSO.
undertow.single-sign-on.add=Adiciona um mecanismo de autentica\u00E7\u00E3o SSO.
undertow.single-sign-on.remove=Remove o mecanismo de autentica\u00E7\u00E3o SSO.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.single-sign-on.domain=O domain da cookie que ser\u00E1 usado.
undertow.single-sign-on.path=Caminho de cookie. 
undertow.single-sign-on.http-only=Define o atributo de cookie httpOnly. 
undertow.single-sign-on.secure=Define o atributo de cookie seguro. 
undertow.single-sign-on.cookie-name=Nome do cookie
undertow.single-sign-on.key-store=Refer\u00EAncia ao reposit\u00F3rio de chaves contendo uma entrada de chave privada.
undertow.single-sign-on.key-alias=Alias da entrada de chave privada usada para autentica\u00E7\u00E3o e verifica\u00E7\u00E3o de conex\u00E3o de logout do canal de apoio.
undertow.single-sign-on.credential-reference=A refer\u00EAncia de credencial para descriptografar a entrada de chave privada.
undertow.single-sign-on.credential-reference.store=O nome do reposit\u00F3rio de credenciais contendo o alias da credencial.
undertow.single-sign-on.credential-reference.alias=O alias que denota credencial ou segredo armazenado no reposit\u00F3rio.
undertow.single-sign-on.credential-reference.type=O tipo de credencial que esta refer\u00EAncia est\u00E1 denotando.
undertow.single-sign-on.credential-reference.clear-text=O segredo especificado usando texto n\u00E3o criptografado. Verifique como o reposit\u00F3rio de credenciais fornece credenciais/segredos aos servi\u00E7os.
undertow.single-sign-on.client-ssl-context=Refer\u00EAncia ao contexto SSL usado para proteger a conex\u00E3o de logout do canal de apoio.
undertow.listener=ouvinte http
undertow.listener.add=Adiciona ouvinte
undertow.listener.remove=Nome de ouvinte
undertow.listener.name=O nome de ouvinte
undertow.listener.socket-binding=A associa\u00E7\u00E3o de soquete do ouvinte
undertow.listener.worker=Worker XNIO dos ouvintes
undertow.listener.buffer-pool=O pool de buffer dos ouvintes
undertow.listener.enabled=Se o ouvinte est\u00E1 ativado
undertow.listener.enabled.deprecated=Atributos habilitados est\u00E3o sendo preteridos,  pois eles causam problemas no cumprimento de consist\u00EAncia de configura\u00E7\u00E3o. 
undertow.listener.scheme=O esquema de ouvinte pode ser HTTP ou HTTPS. Por padr\u00E3o o esquema ser\u00E1 obtido da requisi\u00E7\u00E3o AJP recebida.
undertow.listener.certificate-forwarding=Se o encaminhamento de certificado deve ser ativado. Se isto for habilitado, ent\u00E3o o ouvinte obter\u00E1 o certificado do atributo SSL_CLIENT_CERT.  Isto deve ser habilitado somente se atr\u00E1s de um proxy e  se o proxy estiver configurado para sempre definir estes cabe\u00E7alhos. 
undertow.listener.ssl-context=Refer\u00EAncia ao SSLContext para ser utilizado por este ouvinte. 
undertow.listener.security-realm=O dom\u00EDnio de seguran\u00E7a de ouvintes
undertow.listener.security-realm.deprecated=Use o atributo ssl-context para referenciar um SSLContext configurado diretamente.
undertow.listener.max-post-size=O tamanho m\u00E1ximo de uma postagem que ser\u00E1 aceita, em bytes.
undertow.listener.buffer-pipelined-data=Se devemos armazenar em  buffer as solicita\u00E7\u00F5es em pipeline. 
undertow.listener.allow-encoded-slash=Se uma requisi\u00E7\u00E3o chegar  com codifica\u00E7\u00E3o/caracteres (ex.\: %2F),  eles ser\u00E3o decifrados. 
undertow.listener.decode-url=Se definido para true, ent\u00E3o o analisador ir\u00E1 decodificar a URL e par\u00E2metros de consulta usando uma codifica\u00E7\u00E3o de caractere selecionada (UTF-8 por padr\u00E3o). Se definido para false, eles n\u00E3o ser\u00E3o decodificados. Isto permitir\u00E1 mais tarde que um manipulador decodifique-os para qualquer conjunto de caracteres que desejar. 
undertow.listener.url-charset=URL charset
undertow.listener.max-header-size=O tamanho m\u00E1ximo de um cabe\u00E7alho de requisi\u00E7\u00E3o http, em bytes.
undertow.listener.max-headers=O n\u00FAmero m\u00E1ximo de cabe\u00E7alhos que ser\u00E3o analisados. Isto \u00E9 utilizado para proteger contra vulnerabilidades   de hash.
undertow.listener.max-cookies=O n\u00FAmero m\u00E1ximo de cookies que ser\u00E3o analisados. Isto \u00E9 utilizado para proteger contra vulnerabilidades de hash.
undertow.listener.max-parameters=O n\u00FAmero m\u00E1ximo de par\u00E2metros que ser\u00E3o analisados. Isto \u00E9 utilizado  para proteger contra vulnerabilidades de hash. Isto aplica-se a ambos par\u00E2metros de consulta e aos dados de POST, por\u00E9m n\u00E3o \u00E9 cumulativo (ex.\: voc\u00EA pode  possivelmente ter par\u00E2metros max * 2 par\u00E2metros no total).
undertow.listener.verify-client=O modo de autentica\u00E7\u00E3o de cliente SSL desejado para canais SSL
undertow.listener.verify-client.deprecated=Quando um SSLContext \u00E9 referenciado, ele deve ser configurado diretamente para o  modo de verifica\u00E7\u00E3o do cliente solicitado. 
undertow.listener.always-set-keep-alive=Se definido para true, ent\u00E3o uma conex\u00E3o\: o cabe\u00E7alho de conex\u00E3o keep-alive ser\u00E1 adicionado \u00E0s respostas, mesmo quando n\u00E3o for estritamente solicitado pela especifica\u00E7\u00E3o.
undertow.listener.redirect-socket=Se o ouvinte suporta pedidos non-SSL e um pedido \u00E9 recebido para o qual um  <security-constraint> correspondente requer um transporte SSL,  o Undertow ir\u00E1 automaticamente redirecionar o pedido para a porta de associa\u00E7\u00E3o de soquete especificada aqui. 
undertow.listener.proxy-address-forwarding=Ativa a manipula\u00E7\u00E3o de cabe\u00E7alho x-forwarded-host (e outros cabe\u00E7alhos x-forwarded-*) e usa essa informa\u00E7\u00E3o de cabe\u00E7alho para definir o endere\u00E7o remoto. Isso s\u00F3 deve ser usado atr\u00E1s de um proxy confi\u00E1vel que define esses cabe\u00E7alhos. Caso contr\u00E1rio, um usu\u00E1rio remoto pode falsificar seu endere\u00E7o IP.
undertow.listener.enabled-cipher-suites=Configura cifras SSL habilitadas
undertow.listener.enabled-cipher-suites.deprecated=Quando um SSLContext \u00E9 referenciado,  ele deve ser configurado com o conjunto de codifica\u00E7\u00E3o que ser\u00E1 suportado. 
undertow.listener.enabled-protocols=Configura protocolos SSL
undertow.listener.enabled-protocols.deprecated=Quando um SSLContext \u00E9 referenciado, ele deve ser configurado com os protocolos suportados. 
undertow.listener.max-buffered-request-size=Tamanho m\u00E1ximo de uma solicita\u00E7\u00E3o em buffer, em bytes. As requisi\u00E7\u00F5es n\u00E3o s\u00E3o normalmente em buffer, o caso mais comum \u00E9 quando desempenhando renegocia\u00E7\u00E3o SSL para uma solicita\u00E7\u00E3o  POST e os dados do post devem estar completamente em buffer para desempenhar a renegocia\u00E7\u00E3o. 
undertow.listener.record-request-start-time=Se isto for definido para true, ent\u00E3o o Undertow ir\u00E1 gravar a hora de in\u00EDcio da solicita\u00E7\u00E3o para permitir o resgistro em log da hora da solicita\u00E7\u00E3o. Isto tem um pequeno impacto de desempenho, por\u00E9m quantific\u00E1vel.  
undertow.listener.allow-equals-in-cookie-value=Se isto for definido para true, ent\u00E3o o Undertow  permitir\u00E1  caracteres de igual  sem caractere de escape em valores de cookies sem aspas. Valores de cookie sem aspas podem n\u00E3o conter caracteres de igual. Se presente, o valor termina  antes do sinal de igual. O restante do valor do cookie ser\u00E1 ignorado. 
undertow.listener.no-request-timeout=A dura\u00E7\u00E3o de tempo em milissegundos que a conex\u00E3o pode estar inativa antes que seja fechada pelo cont\u00EAiner. 
undertow.listener.request-parse-timeout=A dura\u00E7\u00E3o m\u00E1xima de tempo (em milissegundos) que pode ser utilizado na an\u00E1lise do pedido 
undertow.listener.rfc6265-cookie-validation=Caso os cookies precisarem ser validados para garantir a conformidade com RFC6265
undertow.listener.receive-buffer=O  tamanho do buffer de recebimento, em bytes.
undertow.listener.send-buffer=O tamanho do buffer de transmiss\u00E3o, em bytes.
undertow.listener.max-connections=O n\u00FAmero m\u00E1ximo de conex\u00F5es simult\u00E2neas. Somente valores maiores que 0 s\u00E3o permitidos. Para conex\u00F5es ilimitadas, simplesmente n\u00E3o defina este valor de atributo.
undertow.listener.tcp-backlog=Configure um servidor com o backlog espec\u00EDfico. 
undertow.listener.tcp-keep-alive=Configure um canal para enviar mensagens TCP keep-alive de uma maneira dependente de implementa\u00E7\u00E3o.
undertow.listener.read-timeout=Configure um limite de tempo de leitura para um soquete, em milissegundos. Se o per\u00EDodo de tempo decorrer sem uma leitura exitosa, a pr\u00F3xima leitura do soquete ir\u00E1 lan\u00E7ar uma {@link ReadTimeoutException}.
undertow.listener.write-timeout=Configure um limite de tempo de grava\u00E7\u00E3o para um soquete, em milissegundos.  Se o per\u00EDodo de tempo decorrer sem uma grava\u00E7\u00E3o exitosa, a pr\u00F3xima grava\u00E7\u00E3o do soquete ir\u00E1 lan\u00E7ar uma {@link WriteTimeoutException}.
undertow.listener.resolve-peer-address=Ativa pesquisa dns host
undertow.listener.enable-connector-statistics=Se as estat\u00EDsticas de conectores devem ser ativadas. Isto ir\u00E1 permitir acesso \u00E0s estat\u00EDsticas, com  um certo custo de desempenho.
undertow.listener.request-count=O n\u00FAmero de pedidos que este ouvinte serviu. 
undertow.listener.bytes-sent=O n\u00FAmero de bytes que foi enviado neste ouvinte
undertow.listener.bytes-received=O n\u00FAmero de bytes que foi recebido por este ouvinte
undertow.listener.error-count=O n\u00FAmero de 500 respostas que foram enviadas por este ouvinte
undertow.listener.processing-time=O tempo total de processamento de todos pedidos efetuados por este ouvinte
undertow.listener.max-processing-time=O tempo m\u00E1ximo de processamento consumido por um pedido neste ouvinte
undertow.listener.reset-statistics=Restaura todas as estat\u00EDsticas de conectores para zero
undertow.listener.enable-http2=Habilita suporte  HTTP2 para este ouvinte
undertow.listener.enable-spdy=Habilita suporte SPDY para este ouvinte. Isto foi preterido e n\u00E3o tem efeito, HTTP/2 deve ser utilizado como alternativa
undertow.listener.enable-spdy.deprecated=SPDY foi substitu\u00EDdo por HTTP/2
undertow.listener.disallowed-methods=Uma lista separada por v\u00EDrgulas de m\u00E9todos HTTP que n\u00E3o s\u00E3o permitidos
undertow.listener.ssl-session-cache-size=O n\u00FAmero m\u00E1ximo de sess\u00F5es SSL ativas 
undertow.listener.ssl-session-cache-size.deprecated=Agora isto pode ser configurado no contexto de seguran\u00E7a Elytron
undertow.listener.ssl-session-timeout=O limite de tempo para uma sess\u00E3o SSL, em milissegundos 
undertow.listener.ssl-session-timeout.deprecated=Agora isto pode ser configurado no contexto de seguran\u00E7a Elytron
undertow.listener.secure=Se definido para true, ent\u00E3o pedidos que originam de um ouvinte s\u00E3o marcados como seguros, mesmo que o pedido n\u00E3o estiver usando HTTPS.
undertow.listener.max-ajp-packet-size=O tamanho m\u00E1ximo suportado de um pacote AJP. Se isto for alterado deve ser aumentado no balanceador de carga e no servidor back-end. 
undertow.listener.http2-enable-push=Se a transmiss\u00E3o push do servidor \u00E9 ativada para esta conex\u00E3o 
undertow.listener.http2-max-frame-size=O tamanho  m\u00E1ximo de  frame HTTP/2 
undertow.listener.http2-max-concurrent-streams=O n\u00FAmero m\u00E1ximo de fluxos  HTTP/2 que podem estar ativos em qualquer momento em uma \u00FAnica conex\u00E3o
undertow.listener.http2-max-header-list-size=O tamanho m\u00E1ximo de cabe\u00E7alhos de requisi\u00E7\u00F5es que o servidor est\u00E1 preparado para aceitar 
undertow.listener.http2-initial-window-size=O tamanho da janela de controle de fluxo que monitora a rapidez que o cliente pode enviar dados ao servidor 
undertow.listener.http2-header-table-size=O tamanho da tabela do cabe\u00E7alho usada para compress\u00E3o HPACK, em bytes. Esta quantidade de mem\u00F3ria ser\u00E1 alocada por conex\u00E3o para a compress\u00E3o. Valores altos  usam mais mem\u00F3ria, por\u00E9m podem proporcionar melhor compress\u00E3o. 
undertow.listener.require-host-http11=Exige que todas as solicita\u00E7\u00F5es HTTP/1.1 tenham um cabe\u00E7alho "Host", de acordo com o RFC. SE a solicita\u00E7\u00E3o n\u00E3o incluir esse cabe\u00E7alho, ela ser\u00E1 rejeitada com um 403.
undertow.host=Um host Undertow 
undertow.host.add=Adiciona um novo host
undertow.host.remove=Remove um host
undertow.host.name=O nome de host
undertow.host.alias=Aliases para o host
undertow.host.default-web-module=M\u00F3dulo web por padr\u00E3o 
undertow.host.setting=Configura\u00E7\u00F5es
undertow.host.default-response-code=Caso definido, isto ser\u00E1 o c\u00F3digo de resposta retornado em caso o contexto solicitado n\u00E3o exista no servidor.
undertow.host.disable-console-redirect=Se definido para true, /console redirect n\u00E3o ser\u00E1 habilitado para este host, por padr\u00E3o \u00E9  false
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp=A configura\u00E7\u00E3o do recipiente JSP.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.add=Adiciona a configura\u00E7\u00E3o do recipiente JSP.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.remove=Remove a configura\u00E7\u00E3o do recipiente JSP.
undertow.setting.jsp.development=Ativa o modo de desenvolvimento que habilita o recarregamento de JSP imediatamente. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.disabled=Desativa o cont\u00EAiner JSP.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.keep-generated=Mant\u00E9m os Servlets gerados.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.trim-spaces=Corta alguns espa\u00E7os do Servlet gerado.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.tag-pooling=Ativa o pooling da tag.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.mapped-file=Mapeia a fonte JSP.
undertow.setting.jsp.check-interval=Verifica o intervalo de atualiza\u00E7\u00F5es do JSP usando um thread em segundo plano. Isso n\u00E3o tem nenhum efeito para a maioria das implanta\u00E7\u00F5es, nas quais as notifica\u00E7\u00F5es de altera\u00E7\u00E3o do JSP s\u00E3o processadas com a API de notifica\u00E7\u00E3o do sistema de arquivos. Isso s\u00F3 tem efeito se o servi\u00E7o de inspe\u00E7\u00E3o de arquivos estiver desativado.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.modification-test-interval=A quantia m\u00EDnima de tempo entre dois testes para atualiza\u00E7\u00F5es, em segundos.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.recompile-on-fail=Tenta novamente as compila\u00E7\u00F5es JSO com falha em cada solicita\u00E7\u00E3o.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.smap=Ativa o SMAP.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.dump-smap=Grava os dados SMAP a um arquivo.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.generate-strings-as-char-arrays=Gera as constantes da Sequ\u00EAncia como arrays char.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.error-on-use-bean-invalid-class-attribute=Ativa erros quando usando uma classe ruim no useBean.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.scratch-dir=Especifica um diret\u00F3rio de trabalho diferente.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.source-vm=O n\u00EDvel VM da fonte para compila\u00E7\u00E3o.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.target-vm=O n\u00EDvel VM do destino para compila\u00E7\u00E3o.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.java-encoding=Especifica a codifica\u00E7\u00E3o usada para fontes do Java.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author ldelima@redhat.com
undertow.setting.jsp.x-powered-by=Ativa a propaganda da m\u00E1quina JSP no x-powered-by.
undertow.setting.jsp.display-source-fragment=Quando ocorre um erro de tempo de execu\u00E7\u00E3o, ocorre uma tentativa de exibir o fragmento fonte  JSP correspondente.  
undertow.setting.jsp.optimize-scriptlets=Se os miniscripts JSP devem ser otimizados para remover concatena\u00E7\u00E3o de cadeia de caracteres
undertow.setting.session-cookie=Configura\u00E7\u00E3o de cookie de sess\u00E3o 
undertow.setting.session-cookie.add=Adiciona uma configura\u00E7\u00E3o de cookie de sess\u00E3o 
undertow.setting.session-cookie.remove=Remove uma configura\u00E7\u00E3o de cookie de sess\u00E3o 
undertow.setting.session-cookie.name=Nome do cookie
undertow.setting.session-cookie.http-only=\u00C9 um cookie http-only
undertow.setting.session-cookie.secure=\u00C9 um cookie seguro?
undertow.setting.session-cookie.domain=Dom\u00EDnio de cookie 
undertow.setting.session-cookie.comment=Coment\u00E1rio de cookie
undertow.setting.session-cookie.max-age=Idade m\u00E1xima do cookie 
undertow.setting.persistent-sessions=Sess\u00F5es persistentes de sess\u00F5es 
undertow.setting.persistent-sessions.enabled=Se definido para true, sess\u00F5es persistentes ser\u00E3o habilitadas
undertow.setting.persistent-sessions.add=Adiciona o recurso de sess\u00F5es  persistentes. 
undertow.setting.persistent-sessions.remove=Remove o recurso de sess\u00F5es persistentes 
undertow.setting.persistent-sessions.path=O caminho para o diret\u00F3rio de dados de sess\u00E3o persistente. Se isto for nulo, as sess\u00F5es ser\u00E3o armazenadas em mem\u00F3ria. 
undertow.setting.persistent-sessions.relative-to=O diret\u00F3rio que est\u00E1 relacionado ao caminho
undertow.handler.simple-error-page=Configura\u00E7\u00E3o de p\u00E1gina de erro simples
undertow.setting.websockets=Se websockets est\u00E3o habilitados para este cont\u00EAiner 
undertow.setting.websockets.add=Adiciona suporte para websockets 
undertow.setting.websockets.remove=Remove suporte para websockets
undertow.setting.websockets.dispatch-to-worker=Se retornos de chamadas devem ser expedidos para uma thread de trabalho. Se for definido para falso, ent\u00E3o ir\u00E3o ser executados na thread de E/O,  que \u00E9 mais r\u00E1pida,  por\u00E9m,  deve-se tomar cuidado para n\u00E3o desempenhar opera\u00E7\u00F5es de bloqueio. 
undertow.setting.websockets.worker=O worker para se utilizar nas implementa\u00E7\u00F5es de websocket
undertow.setting.websockets.buffer-pool=O pool de buffer para se utilizar nas implementa\u00E7\u00F5es de websocket
undertow.setting.websockets.per-message-deflate=Habilita a extens\u00E3o de compress\u00E3o por mensagem de websocket, RFC-7692
undertow.setting.websockets.deflater-level=Configura o n\u00EDvel de compress\u00E3o do algor\u00EDtimo DEFLATE 
undertow.setting.crawler-session-management=Configura o gerenciamento de sess\u00F5es especiais para rastreador web
undertow.setting.crawler-session-management.add=Adiciona o gerenciamento de sess\u00F5es especiais para rastreador web
undertow.setting.crawler-session-management.remove=Remove o gerenciamento de sess\u00F5es especiais para rastreador web
undertow.setting.crawler-session-management.user-agents=Express\u00E3o comum  que \u00E9 utilizada para corresponder o agente usu\u00E1rio de um rastreador 
undertow.setting.crawler-session-management.session-timeout=O limite de tempo de sess\u00E3o para sess\u00F5es que pertencem aos rastreadores
undertow.handler.simple-error-page.add=Adiciona p\u00E1gina de erro simples
undertow.handler.simple-error-page.remove=Remove p\u00E1gina de erro simples
undertow.handler.simple-error-page.name=Nome da p\u00E1gina de erro
undertow.handler.simple-error-page.code=C\u00F3digo de erro
undertow.handler.file=Manipulador de arquivos
undertow.handler.file.add=Adiciona manipulador de arquivos 
undertow.handler.file.remove=Remove manipulador de arquivos
undertow.handler.file.name=Nome do manipulador de arquivo 
undertow.handler.file.path=Caminho do  filesystem a partir do qual o manipulador de arquivos servir\u00E1 os recursos
undertow.handler.file.cache-buffer-size=Tamanho do buffer, em bytes.
undertow.handler.file.cache-buffers=N\u00FAmero de buffers
undertow.handler.file.directory-listing=Ativar a lista de diret\u00F3rios?
undertow.handler.file.follow-symlink=Ativar os seguintes links simb\u00F3licos
undertow.handler.file.safe-symlink-paths=Caminhos que s\u00E3o seguros para serem destinos  de links simb\u00F3licos 
undertow.handler.file.case-sensitive=Utilize manipuladores de arquivo que consideram mai\u00FAsculas e min\u00FAsculas
undertow.handler.reverse-proxy=Um gerenciador  proxy reverso
undertow.handler.reverse-proxy.add=Adiciona um gerenciador proxy reverso 
undertow.handler.reverse-proxy.remove=Remove um gerenciador proxy reverso 
undertow.handler.reverse-proxy.problem-server-retry=Tempo em segundos para aguardar antes de tentar reconectar ao servidor que est\u00E1 inoperante
undertow.handler.reverse-proxy.sticky-session-lifetime=Tempo, em  minutos, que dados de sticky session ir\u00E3o sobreviver. 
undertow.handler.reverse-proxy.session-cookie-names=Lista de nomes de cookies separada por v\u00EDrgulas. Normalmente isso ser\u00E1 somente JSESSIONID. 
undertow.handler.reverse-proxy.max-request-time=O tempo m\u00E1ximo que um pedido de proxy pode permanecer ativo antes de ser terminado. 
undertow.handler.reverse-proxy.connections-per-thread=O n\u00FAmero de conex\u00F5es que ser\u00E3o mantidas em servidores de backend, a cada  10 thread. 
undertow.handler.reverse-proxy.request-queue-size=O n\u00FAmero de pedidos que podem estar em fila se o pool de conex\u00E3o estiver cheio antes que pedidos sejam rejeitados com um erro 503
undertow.handler.reverse-proxy.host=Um host que o proxy reverso ir\u00E1 encaminhar pedidos 
undertow.handler.reverse-proxy.host.instance-id=O ID de inst\u00E2ncia (tamb\u00E9m conhecido por JVM route) que ser\u00E1 utilizado para habilitar as  sticky sessions
undertow.handler.reverse-proxy.host.outbound-socket-binding=A associa\u00E7\u00E3o de soquete de sa\u00EDda para este host
undertow.handler.reverse-proxy.host.scheme=Que tipo de esquema \u00E9 utilizado
undertow.handler.reverse-proxy.host.path=Caminho opcional se o host est\u00E1 utilizando recurso n\u00E3o-root 
undertow.handler.reverse-proxy.cached-connections-per-thread=O n\u00FAmero de conex\u00F5es que ser\u00E3o mantidas ativas indefinidamente
undertow.handler.reverse-proxy.connection-idle-timeout=A quantidade de tempo que uma conex\u00E3o pode permanecer inativa antes que ela seja fechada. As conex\u00F5es n\u00E3o expirar\u00E3o uma vez que o tamanho do pool estiver no m\u00EDnimo configurado (conforme configurado por cached-connections-per-thread)
undertow.handler.reverse-proxy.host.add=Adiciona um gerenciador host de proxy reverso
undertow.handler.reverse-proxy.host.remove=Remove um gerenciador host de proxy reverso 
undertow.handler.reverse-proxy.host.security-realm=O dom\u00EDnio de seguran\u00E7a que fornece a configura\u00E7\u00E3o SSL para a conex\u00E3o ao host
undertow.handler.reverse-proxy.host.ssl-context=Referencia ao SSLContext para ser utilizado por este gerenciador. 
undertow.handler.reverse-proxy.host.security-realm.deprecated=Utiliza o atributo ssl-context para referenciar um SSL Context configurado diretamente. 
undertow.handler.reverse-proxy.host.enable-http2=Se isto for verdadeiro, o proxy tentar\u00E1 usar HTTP/2 para se conectar ao back-end. Se n\u00E3o for suportado, ele retornar\u00E1 a HTTP/1.1/
undertow.handler.reverse-proxy.max-retries=Quantas vezes se pode tentar novamente uma solicita\u00E7\u00E3o que falhou. Note que se uma solicita\u00E7\u00E3o n\u00E3o \u00E9 considerada idempotent ent\u00E3o ela ser\u00E1 tentada novamente somente se o proxy tem certeza que n\u00E3o foi enviada para o servidor backend.
undertow.filter.basic-auth=Configura\u00E7\u00E3o auth de base
undertow.filter.basic-auth.add=Adiciona auth de base 
undertow.filter.basic-auth.remove=Remove auth de base 
undertow.filter.basic-auth.name=Nome do filtro 
undertow.filter.basic-auth.security-domain=Dom\u00EDnio de seguran\u00E7a 
undertow.filter.connection-limit=Gerenciador de delimitador de pedidos simult\u00E2neos. Nome herdado preterido do recurso request-limit. 
undertow.filter.connection-limit.add=Adiciona um delimitador de pedidos 
undertow.filter.connection-limit.remove=remove delimitador 
undertow.filter.connection-limit.name=nome do gerenciador
undertow.filter.connection-limit.max-concurrent-requests=N\u00FAmero m\u00E1ximo de pedidos simult\u00E2neos
undertow.filter.connection-limit.queue-size=N\u00FAmero de pedidos em fila antes de come\u00E7ar a rejeit\u00E1-los
undertow.filter.request-limit=Gerenciador de delimitador de pedidos simult\u00E2neos
undertow.filter.request-limit.add=Adiciona delimitador de pedidos
undertow.filter.request-limit.remove=remove delimitador 
undertow.filter.request-limit.name=nome do gerenciador 
undertow.filter.request-limit.max-concurrent-requests=N\u00FAmero m\u00E1ximo de pedidos simult\u00E2neos
undertow.filter.request-limit.queue-size=N\u00FAmero de pedidos em fila antes de come\u00E7ar a serem rejeitados
undertow.filter.response-header=O filtro de cabe\u00E7alho de respostas permite que voc\u00EA adicione cabe\u00E7alhos personalizados
undertow.filter.response-header.add=Adiciona filtro
undertow.filter.response-header.remove=Remove filtro
undertow.filter.response-header.name=Nome do filtro
undertow.filter.response-header.header-name=Nome de cabe\u00E7alho
undertow.filter.response-header.header-value=Valor para cabe\u00E7alho
undertow.filter.gzip=Define filtro gzip 
undertow.filter.gzip.add=Adiciona filtro
undertow.filter.gzip.remove=Remove filtro
undertow.filter.gzip.name=Nome do filtro
undertow.filter.error-page=As p\u00E1ginas de erros
undertow.filter.error-page.add=Adiciona uma p\u00E1gina de erro
undertow.filter.error-page.remove=Remove uma p\u00E1gina de erro
undertow.filter.error-page.name=Nome de p\u00E1gina de erro
undertow.filter.error-page.code=C\u00F3digo de p\u00E1gina de erro
undertow.filter.error-page.path=Caminho de p\u00E1gina de erro
undertow.filter.custom-filter=Filtro personalizado
undertow.filter.custom-filter.add=Adiciona filtro personalizado 
undertow.filter.custom-filter.remove=Remove filtro personalizado
undertow.filter.custom-filter.class-name=Nome de classe  de HttpHandler
undertow.filter.custom-filter.module=Nome de m\u00F3dulo a partir do qual pode-se carregar a classe
undertow.filter.custom-filter.parameters=Par\u00E2metros de filtro
undertow.filter.expression-filter=Um filtro analisado para a linguagem de express\u00E3o de undertow
undertow.filter.expression-filter.add=Adicionar um filtro analisado para a linguagem de express\u00E3o de undertow
undertow.filter.expression-filter.remove=Remove o filtro de express\u00E3o   
undertow.filter.expression-filter.expression=A express\u00E3o que define o filtro 
undertow.filter.expression-filter.module=M\u00F3dulo para usar para carregar as defini\u00E7\u00F5es de filtros 
undertow.filter.rewrite=Um filtro de re-grava\u00E7\u00E3o (ou de redire\u00E7\u00E3o)
undertow.filter.rewrite.add=Adiciona um filtro de re-grava\u00E7\u00E3o 
undertow.filter.rewrite.remove=Remove um filtro de re-grava\u00E7\u00E3o
undertow.filter.rewrite.target=A express\u00E3o que define o destino. Se voc\u00EA est\u00E1 redirecionando para um destino constante coloque ap\u00F3strofos em volta do valor 
undertow.filter.rewrite.redirect=Se for verdadeiro, ent\u00E3o um redirecionamento ser\u00E1 executado ao inv\u00E9s de uma regrava\u00E7\u00E3o 
undertow.host.location=Cont\u00E9m a configura\u00E7\u00E3o do recurso de localiza\u00E7\u00E3o 
undertow.host.location.add=Adicionar nova localiza\u00E7\u00E3o 
undertow.host.location.remove=Remover esta localiza\u00E7\u00E3o 
undertow.host.location.name=Nome da localiza\u00E7\u00E3o, age como caminho de contexto 
undertow.host.location.handler=Manipulador padr\u00E3o para esta localiza\u00E7\u00E3o 
undertow.host.location.filter-ref=Referencia ao filtro 
undertow.host.filter-ref=Referencia ao filtro
undertow.filter-ref=Referencia ao filtro 
undertow.filter-ref.add=Adicionar nova refer\u00EAncia 
undertow.filter-ref.remove=remove refer\u00EAncia selecionada
undertow.filter-ref.name=Referencia  a que filtro 
undertow.filter-ref.predicate=Os predicados fornecem uma maneira simples de tomar uma decis\u00E3o true/false baseando -se em uma troca. Muitos manipuladores t\u00EAm uma exig\u00EAncia de que sejam aplicados condicionalmente, e os predicados fornecem um modo geral de especificar uma condi\u00E7\u00E3o. 
undertow.filter-ref.priority=Define a ordem do filtro, deve ser definida para 1 ou mais, um n\u00FAmero mais elevado  instrui  o servidor para ser inclu\u00EDdo antes na cadeia de manipula\u00E7\u00E3o do que outros sob o mesmo contexto. 
undertow.application-security-domain=Uma mapea\u00E7\u00E3o de um dom\u00EDnio de seguran\u00E7a referencia em um aplicativo implantado   
undertow.application-security-domain.add=Adiciona um novo mapeamento  de dom\u00EDnio de seguran\u00E7a referenciado por um aplicativo. 
undertow.application-security-domain.remove=Remove o mapeamento de dom\u00EDnio de seguran\u00E7a referenciado por um aplicativo.
undertow.application-security-domain.http-authentication-factory=A f\u00E1brica de autentica\u00E7\u00E3o HTTP  para ser utilizada pelas implanta\u00E7\u00F5es que referenciam o dom\u00EDnio de seguran\u00E7a mapeado. 
undertow.application-security-domain.override-deployment-config=A configura\u00E7\u00E3o de autentica\u00E7\u00E3o na implanta\u00E7\u00E3o deve ser substitu\u00EDda pela f\u00E1brica?
undertow.application-security-domain.enable-jacc=Ativar autoriza\u00E7\u00E3o usando JACC
undertow.application-security-domain.referencing-deployments=As implanta\u00E7\u00F5es atualmente referenciando este mapeamento. 
undertow.application-security-domain.setting=Configura\u00E7\u00F5es
undertow.deployment=Informa\u00E7\u00F5es sobre a manipula\u00E7\u00E3o de cont\u00EAiner da web desta implanta\u00E7\u00E3o
undertow.deployment.context-root=O root do contexto do aplicativo da web
undertow.deployment.virtual-host=O nome do host virtual pelo qual o aplicativo da web \u00E9 servido.
undertow.deployment.server=O nome do servidor que este aplicativo pertente a 
undertow.deployment.active-sessions=N\u00FAmero de sess\u00F5es ativas.
undertow.deployment.expired-sessions=N\u00FAmero de sess\u00F5es expiradas.
undertow.deployment.rejected-sessions=N\u00FAmero de sess\u00F5es rejeitadas
undertow.deployment.max-active-sessions=N\u00FAmero m\u00E1ximo permitido de sess\u00F5es simult\u00E2neas que este gerenciador de  sess\u00E3o suporta. 
undertow.deployment.sessions-created=O n\u00FAmero total de sess\u00F5es criadas.
undertow.deployment.duplicated-session-ids=O n\u00FAmero de IDs de sess\u00E3o duplicadas gerado pela fonte aleat\u00F3ria (qualquer valor superior a 0 significa problemas)
undertow.deployment.session-avg-alive-time=O tempo m\u00E9dio (em segundos) que sess\u00F5es expiradas permaneceram ativas
undertow.deployment.session-max-alive-time=O per\u00EDodo mais longo (em segundos) que uma sess\u00E3o expirada permaneceu ativa
undertow.deployment.servlet=Informa\u00E7\u00F5es sobre o status e a configura\u00E7\u00E3o deste servlet
undertow.deployment.servlet.servlet-name=Nome do servlet
undertow.deployment.servlet.servlet-class=Classe do servlet
undertow.deployment.servlet.min-request-time=Tempo m\u00EDnimo para processar pedido
undertow.deployment.servlet.max-request-time=Tempo m\u00E1ximo para processar pedido
undertow.deployment.servlet.total-request-time=Tempo total  utilizado processando todos os pedidos
undertow.deployment.servlet.request-count=N\u00FAmero de todos os pedidos 
undertow.deployment.servlet.mappings=Mapeamento de servlet
undertow.deployment.websocket=Informa\u00E7\u00F5es sobre o status e a configura\u00E7\u00E3o deste WebSocket
undertow.deployment.websocket.endpoint-class=Classe de ponto de extremidade
undertow.deployment.websocket.path=O caminho de implanta\u00E7\u00E3o do ponto de extremidade 
undertow.deployment.invalidate-session=Invalida uma determinada sess\u00E3o
undertow.deployment.invalidate-session.session-id=A ID de sess\u00E3o a invalidar
undertow.filter.mod-cluster=Um balanceador de carga frontal de mod-cluster
undertow.handler.mod-cluster=Um balanceador de carga frontal de mod-cluster
undertow.handler.mod-cluster.add=Adiciona um balanceador de carga mod-proxy frontal
undertow.handler.mod-cluster.remove=Remove um manipulador de proxys de  mod-cluster
undertow.handler.mod-cluster.management-socket-binding=A associa\u00E7\u00E3o de socket da porta e do endere\u00E7o de gerenciamento do mod_cluster. Ao usar o mod_cluster, devem ser definidos dois ouvintes de HTTP, um p\u00FAblico para lidar com solicita\u00E7\u00F5es e um associado \u00E0 rede interna para lidar com comandos do mod_cluster. Essa associa\u00E7\u00E3o de socket deve corresponder ao ouvinte interno e deve estar publicamente acess\u00EDvel.
undertow.handler.mod-cluster.advertise-socket-binding=O grupo multicast e a porta usados para anunciar.
undertow.handler.mod-cluster.security-key=A chave de seguran\u00E7a que \u00E9 utilizada para o grupo mod-cluster. Todos os membros devem usar a mesma chave de seguran\u00E7a. 
undertow.handler.mod-cluster.advertise-protocol=O protocolo que est\u00E1 sendo utilizado. 
undertow.handler.mod-cluster.advertise-path=O caminho sob o qual mod-cluster est\u00E1 registrado. 
undertow.handler.mod-cluster.advertise-frequency=A frequ\u00EAncia que o mod-cluster anuncia-se na rede (em milissegundos)
undertow.handler.mod-cluster.failover-strategy=Determina como um n\u00F3 de failover \u00E9 escolhido no caso de o n\u00F3 com o qual uma sess\u00E3o tem afinidade n\u00E3o estar dispon\u00EDvel.
undertow.handler.mod-cluster.health-check-interval=A frequ\u00EAncia de pings verifica\u00E7\u00E3o de funcionamento para os n\u00F3s de backend 
undertow.handler.mod-cluster.broken-node-timeout=A quantidade de tempo que deve ser percorrida antes que um n\u00F3 interrompido seja removido da tabela
undertow.handler.mod-cluster.max-request-time=A quantidade m\u00E1xima de tempo que uma solicita\u00E7\u00E3o ao n\u00F3 de backend  pode utilizar antes de ser terminada. 
undertow.handler.mod-cluster.management-access-predicate=Um predicado que \u00E9 aplicado aos pedidos recebidos para determinar se eles podem desempenhar gerenciamento de comandos mod-cluster. Fornece seguran\u00E7a adicional al\u00E9m da que \u00E9 fornecida pela limita\u00E7\u00E3o do gerenciamento de solicita\u00E7\u00F5es que originaram a partir do management-socket-binding
undertow.handler.mod-cluster.session-cookie-names=Lista separada por v\u00EDrgula de nomes de cookies de sess\u00F5es. Normalmente ser\u00E1 JSESSIONID. 
undertow.handler.mod-cluster.connections-per-thread=O n\u00FAmero de conex\u00F5es que ser\u00E3o mantidas em servidores backend, a cada 10 threads.  
undertow.handler.mod-cluster.request-queue-size=O n\u00FAmero de pedidos que podem estar em fila se o pool de conex\u00E3o estiver cheio antes que pedidos sejam rejeitados com um erro 503
undertow.handler.mod-cluster.cached-connections-per-thread=O n\u00FAmero de conex\u00F5es que ser\u00E3o mantidas ativas indefinidamente
undertow.handler.mod-cluster.connection-idle-timeout=A quantidade de tempo que uma conex\u00E3o pode permanecer inativa antes que ela seja fechada. As conex\u00F5es n\u00E3o expirar\u00E3o uma vez que o tamanho do pool estiver no m\u00EDnimo configurado (conforme configurado por cached-connections-per-thread)
undertow.handler.mod-cluster.worker=O worker XNIO que \u00E9 utilizado para enviar as notifica\u00E7\u00F5es de an\u00FAncios
undertow.handler.mod-cluster.ssl-context=Refer\u00EAncia ao contexto SSL para ser utilizado por este filtro. 
undertow.handler.mod-cluster.security-realm=O dom\u00EDnio de seguran\u00E7a que fornece a configura\u00E7\u00E3o SSL 
undertow.handler.mod-cluster.security-realm.deprecated=Utilize o atributo ssl-context para referenciar diretamente um contexto SSL configurado
undertow.handler.mod-cluster.use-alias=Se ocorre uma verifica\u00E7\u00E3o de alias
undertow.handler.mod-cluster.enable-http2=Se o balanceador de carga deve tentar atualizar conex\u00F5es backend para HTTP2. Se HTTP2 n\u00E3o \u00E9 suportada, ser\u00E1 utilizada HTTP ou HTTPS como de pr\u00E1tica. 
undertow.handler.mod-cluster.max-ajp-packet-size=O tamanho m\u00E1ximo de pacotes AJP . O aumento permitir\u00E1 AJP a trabalhar por requisi\u00E7\u00E3o/respostas que possuem uma grande quantidade de cabe\u00E7alhos. Isto \u00E9 uma op\u00E7\u00E3o avan\u00E7ada e deve ser igual entre os balanceadores e os servidores backend. 
undertow.handler.mod-cluster.http2-enable-push=Se a transmiss\u00E3o de tipo push deve ser habilitada para conex\u00F5es HTTP/2
undertow.handler.mod-cluster.http2-max-frame-size=O tamanho m\u00E1ximo de estrutura HTTP/2
undertow.handler.mod-cluster.http2-max-concurrent-streams=O n\u00FAmero m\u00E1ximo de fluxos  HTTP/2 que podem estar ativos em qualquer momento em uma \u00FAnica conex\u00E3o
undertow.handler.mod-cluster.http2-max-header-list-size=O tamanho m\u00E1ximo de cabe\u00E7alhos de requisi\u00E7\u00F5es que o servidor est\u00E1 preparado para aceitar 
undertow.handler.mod-cluster.http2-initial-window-size=O tamanho da janela de controle de fluxo que monitora a rapidez que o cliente pode enviar dados ao servidor 
undertow.handler.mod-cluster.http2-header-table-size=O tamanho da tabela do cabe\u00E7alho usada para compress\u00E3o HPACK, em bytes. Esta quantidade de mem\u00F3ria ser\u00E1 alocada por conex\u00E3o para a compress\u00E3o. Valores altos  usam mais mem\u00F3ria, por\u00E9m podem proporcionar melhor compress\u00E3o. 
undertow.handler.mod-cluster.balancer=A representa\u00E7\u00E3o de runtime de um balanceador de cargas de mod_cluster
undertow.handler.mod-cluster.balancer.sticky-session-path=O caminho do cookie da sticky session
undertow.handler.mod-cluster.balancer.sticky-session=Se as sticky essions s\u00E3o abilitadas
undertow.handler.mod-cluster.balancer.sticky-session-cookie=O nome de cookie de sess\u00E3o 
undertow.handler.mod-cluster.balancer.sticky-session-force=Se for definido para true, ent\u00E3o um erro ser\u00E1 retornado se a requisi\u00E7\u00E3o n\u00E3o pode ser roteado para o sticky node, caso contr\u00E1rio ele ser\u00E1 roteado para outro n\u00F3. 
undertow.handler.mod-cluster.balancer.sticky-session-remove=Remove os cookie de sess\u00E3o se a requisi\u00E7\u00E3o n\u00E3o pode ser roteada para o host correto. 
undertow.handler.mod-cluster.balancer.max-attempts=O n\u00FAmero de tentativas para enviar a requisi\u00E7\u00E3o para um servidor backend
undertow.handler.mod-cluster.balancer.wait-worker=O n\u00FAmero de segundos para aguardar por um worker dispon\u00EDvel 
undertow.handler.mod-cluster.max-retries=Quantas vezes se pode tentar novamente uma solicita\u00E7\u00E3o que falhou. Note que se uma solicita\u00E7\u00E3o n\u00E3o \u00E9 considerada idempotent ent\u00E3o ela ser\u00E1 tentada novamente somente se o proxy tem certeza que n\u00E3o foi enviada para o servidor backend.
undertow.handler.mod-cluster.balancer.node=A representa\u00E7\u00E3o de runtime de um n\u00F3 de mod_cluster 
undertow.handler.mod-cluster.balancer.node.context=A representa\u00E7\u00E3o de runtime de um contexto de mod_cluster
undertow.handler.mod-cluster.balancer.node.context.requests=O n\u00FAmero de requisi\u00E7\u00F5es neste contexto
undertow.handler.mod-cluster.balancer.node.context.status=O status  deste contexto 
undertow.handler.mod-cluster.balancer.node.load=A carga atual deste n\u00F3
undertow.handler.mod-cluster.balancer.node.elected=O n\u00FAmero selecionado 
undertow.handler.mod-cluster.balancer.node.status=O status atual deste n\u00F3 
undertow.handler.mod-cluster.balancer.node.disable=Desativar todos contextos neste n\u00F3 
undertow.handler.mod-cluster.balancer.node.enable=Habilita todos contextos neste n\u00F3 
undertow.handler.mod-cluster.balancer.node.stop=Interromper todos contexto neste n\u00F3 
undertow.handler.mod-cluster.balancer.node.uri=A URI que o balanceador de carga utiliza para conextar ao n\u00F3
undertow.handler.mod-cluster.balancer.node.aliases=Os aliases de n\u00F3s
undertow.handler.mod-cluster.balancer.node.context.disable=Desativa este contexto 
undertow.handler.mod-cluster.balancer.node.context.enable=Ativa este contexto 
undertow.handler.mod-cluster.balancer.node.context.stop=Interrompe este  contexto 
undertow.handler.mod-cluster.balancer.node.load-balancing-group=O grupo de balanceador de carga que este n\u00F3 pertence
undertow.handler.mod-cluster.balancer.node.cache-connections=O n\u00FAmero de conex\u00F5es que ser\u00E3o mantidas ativas indefinidamente
undertow.handler.mod-cluster.balancer.node.max-connections=O n\u00FAmero m\u00E1ximo de conex\u00F5es por 10 thread 
undertow.handler.mod-cluster.balancer.node.open-connections=O n\u00FAmero atual de conex\u00F5es abertas
undertow.handler.mod-cluster.balancer.node.ping=O ping de n\u00F3s 
undertow.handler.mod-cluster.balancer.node.read=O n\u00FAmero de bytes lidos a partir de um n\u00F3 
undertow.handler.mod-cluster.balancer.node.timeout=Tempo limite de requisi\u00E7\u00E3o 
undertow.handler.mod-cluster.balancer.node.written=O n\u00FAmero de bytes transferidos ao n\u00F3 
undertow.handler.mod-cluster.balancer.node.ttl=O tempo que as conex\u00F5es permanecer\u00E3o ativas sem requisi\u00E7\u00F5es antes de serem fechadas, se o n\u00FAmero de conex\u00F5es for maior que cache-connections
undertow.handler.mod-cluster.balancer.node.flush-packets=Se dados recebidos devem ser imediatamente descarregados
undertow.handler.mod-cluster.balancer.node.queue-new-requests=Se uma requisi\u00E7\u00E3o \u00E9 recebida e n\u00E3o h\u00E1 worker dispon\u00EDvel imediatamente se deve ser colocada em fila
undertow.handler.mod-cluster.balancer.node.request-queue-size=O tamanho da fila de pedidos
undertow.handler.mod-cluster.balancer.load-balancing-group=Um grupo de balanceamento de carga
undertow.handler.mod-cluster.balancer.load-balancing-group.enable-nodes=Habilita todos os n\u00F3s no grupo de balanceamento de carga
undertow.handler.mod-cluster.balancer.load-balancing-group.disable-nodes=Desativa todos os n\u00F3s no grupo de balanceamento de carga
undertow.handler.mod-cluster.balancer.load-balancing-group.stop-nodes=Interrompe todos os n\u00F3s no grupo de balanceamento de carga
undertow.http-invoker=Os servi\u00E7os de invocador HTTP que permitem invoca\u00E7\u00E3o remota com base em HTTP de servi\u00E7os como EJB e nomenclatura
undertow.http-invoker.add=Adiciona o servi\u00E7o de invocador HTTP ao host
undertow.http-invoker.remove=Remove o servi\u00E7o de invocador HTTP
undertow.http-invoker.path=O caminho em que os servi\u00E7os est\u00E3o instalados
undertow.http-invoker.http-authentication-factory=A f\u00E1brica de autentica\u00E7\u00E3o HTTP a ser usada para autentica\u00E7\u00E3o
undertow.http-invoker.security-realm=O realm de seguran\u00E7a herdado a ser usado para autentica\u00E7\u00E3o
