undertow=Undertow \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0
undertow.add=\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u8FFD\u52A0\u3059\u308B\u64CD\u4F5C
undertow.remove=\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u524A\u9664\u3059\u308B\u64CD\u4F5C
undertow.configuration=null
undertow.default-virtual-host=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u4F7F\u7528\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u4EEE\u60F3\u30DB\u30B9\u30C8
undertow.default-servlet-container=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u4F7F\u7528\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u30B3\u30F3\u30C6\u30CA\u30FC
undertow.default-server=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u4F7F\u7528\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30B5\u30FC\u30D0\u30FC
undertow.instance-id=\u30AF\u30E9\u30B9\u30BF\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9 ID
undertow.statistics-enabled=\u7D71\u8A08\u304C\u6709\u52B9\u306B\u306A\u3063\u3066\u3044\u308B\u5834\u5408\u306B\u8A2D\u5B9A\u3002\u30B3\u30CD\u30AF\u30BF\u30FC\u30EC\u30D9\u30EB\u306E\u7D71\u8A08\u306F\u5909\u66F4\u304C\u3059\u3050\u306B\u9069\u7528\u3055\u308C\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30EC\u30D9\u30EB\u306E\u7D71\u8A08\u306F\u3001\u518D\u30C7\u30D7\u30ED\u30A4\u5F8C (\u307E\u305F\u306F\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u30EA\u30ED\u30FC\u30C9\u5F8C) \u306B\u306E\u307F\u9069\u7528\u3055\u308C\u307E\u3059\u3002
undertow.default-security-domain=Web \u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3
undertow.buffer-cache=\u9759\u7684\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u30AD\u30E3\u30C3\u30B7\u30E5\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30D0\u30C3\u30D5\u30A1\u30FC\u30AD\u30E3\u30C3\u30B7\u30E5
undertow.buffer-cache.add=\u30D0\u30C3\u30D5\u30A1\u30FC\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u8FFD\u52A0
undertow.buffer-cache.remove=\u30D0\u30C3\u30D5\u30A1\u30FC\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u524A\u9664
undertow.buffer-cache.name=\u30AD\u30E3\u30C3\u30B7\u30E5\u540D
undertow.buffer-cache.buffer-size=\u5404\u30D0\u30C3\u30D5\u30A1\u30FC\u306E\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8\u5358\u4F4D)
undertow.buffer-cache.buffers-per-region=\u30EA\u30FC\u30B8\u30E7\u30F3\u306E\u30D0\u30C3\u30D5\u30A1\u30FC\u6570
undertow.buffer-cache.max-regions=\u30EA\u30FC\u30B8\u30E7\u30F3\u306E\u6700\u5927\u6570
undertow.server=\u30B5\u30FC\u30D0\u30FC
undertow.server.add=\u30B5\u30FC\u30D0\u30FC\u3092\u8FFD\u52A0
undertow.server.remove=\u30B5\u30FC\u30D0\u30FC\u3092\u524A\u9664
undertow.server.name=\u30B5\u30FC\u30D0\u30FC\u540D
undertow.server.default-host=\u30B5\u30FC\u30D0\u30FC\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u4EEE\u60F3\u30DB\u30B9\u30C8
undertow.server.servlet-container=\u30B5\u30FC\u30D0\u30FC\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u30B3\u30F3\u30C6\u30CA\u30FC
undertow.server.http-listener=HTTP \u30EA\u30B9\u30CA\u30FC
undertow.server.https-listener=HTTPS \u30EA\u30B9\u30CA\u30FC
undertow.server.ajp-listener=AJP \u30EA\u30B9\u30CA\u30FC
undertow.server.host=\u30B5\u30FC\u30D0\u30FC\u30DB\u30B9\u30C8
undertow.servlet-container=\u30B5\u30D6\u30EC\u30C3\u30C8\u30B3\u30F3\u30C6\u30CA\u30FC
undertow.servlet-container.add=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u30B3\u30F3\u30C6\u30CA\u30FC\u3092\u8FFD\u52A0
undertow.servlet-container.remove=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u30B3\u30F3\u30C6\u30CA\u30FC\u3092\u524A\u9664
undertow.servlet-container.name=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u30B3\u30F3\u30C6\u30CA\u30FC\u540D
undertow.servlet-container.default-buffer-cache=\u9759\u7684\u30EA\u30BD\u30FC\u30B9\u3092\u30AD\u30E3\u30C3\u30B7\u30E5\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30D0\u30C3\u30D5\u30A1\u30FC\u30AD\u30E3\u30C3\u30B7\u30E5
undertow.servlet-container.stack-trace-on-error=\u30A8\u30E9\u30FC\u767A\u751F\u6642\u306B\u30B9\u30BF\u30C3\u30AF\u30C8\u30EC\u30FC\u30B9\u304C\u542B\u307E\u308C\u308B\u30A8\u30E9\u30FC\u30DA\u30FC\u30B8\u3092\u751F\u6210\u3059\u308B\u304B\u3069\u3046\u304B\u3002\u5024\u306F all\u3001none\u3001\u304A\u3088\u3073 local-only \u3067\u3059\u3002
undertow.servlet-container.setting=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u30B3\u30F3\u30C6\u30CA\u30FC\u8A2D\u5B9A
undertow.servlet-container.persistent-sessions=\u518D\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u5168\u4F53\u3067\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u30B3\u30F3\u30C6\u30CA\u30FC\u304C\u30BB\u30C3\u30B7\u30E7\u30F3\u3092\u6C38\u7D9A\u5316\u3059\u308B\u304B\u3069\u3046\u304B
undertow.servlet-container.allow-non-standard-wrappers=true \u306E\u5834\u5408\u3001\u6A19\u6E96\u306E\u30E9\u30C3\u30D1\u30FC\u30AF\u30E9\u30B9\u3092\u62E1\u5F35\u3057\u306A\u3044\u30EA\u30AF\u30A8\u30B9\u30C8\u304A\u3088\u3073\u5FDC\u7B54\u30E9\u30C3\u30D1\u30FC\u3092\u4F7F\u7528\u3067\u304D\u307E\u3059
undertow.servlet-container.use-listener-encoding=\u30EA\u30B9\u30CA\u30FC\u3067\u5B9A\u7FA9\u3055\u308C\u305F\u30A8\u30F3\u30B3\u30FC\u30C7\u30A3\u30F3\u30B0\u3092\u4F7F\u7528
undertow.servlet-container.ignore-flush=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u51FA\u529B\u30B9\u30C8\u30EA\u30FC\u30E0\u3067\u30D5\u30E9\u30C3\u30B7\u30E5\u3092\u7121\u8996\u3057\u307E\u3059\u3002\u307B\u3068\u3093\u3069\u306E\u5834\u5408\u3067\u7406\u7531\u3082\u306A\u304F\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u304C\u60AA\u304F\u306A\u308A\u307E\u3059\u3002
undertow.servlet-container.default-encoding=\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u305F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3059\u3079\u3066\u306B\u4F7F\u7528\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30A8\u30F3\u30B3\u30FC\u30C7\u30A3\u30F3\u30B0
undertow.servlet-container.eager-filter-initialization=true \u306E\u5834\u5408\u3001\u6700\u521D\u306E\u8981\u6C42\u3055\u308C\u305F\u3068\u304D\u3067\u306F\u306A\u304F\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u958B\u59CB\u6642\u306B undertow \u304C filter init() \u3092\u547C\u3073\u51FA\u3057\u307E\u3059\u3002
undertow.servlet-container.default-session-timeout=\u30B3\u30F3\u30C6\u30CA\u30FC\u306B\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u305F\u3059\u3079\u3066\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u30BB\u30C3\u30B7\u30E7\u30F3\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u5206\u5358\u4F4D)\u3002
undertow.servlet-container.use-global-request-controller=true \u306E\u5834\u5408\u3001 Undertow \u306F\u30B0\u30ED\u30FC\u30D0\u30EB\u30EA\u30AF\u30A8\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3068\u3057\u3066\u767B\u9332\u3055\u308C\u307E\u3059\u3002\u3053\u308C\u306B\u3088\u308A\u3001\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306F\u82E5\u5E72\u5F71\u97FF\u3092\u53D7\u3051\u307E\u3059\u304C\u3001\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u304A\u3088\u3073\u30B5\u30FC\u30D0\u30FC\u3067\u30A2\u30AF\u30C6\u30A3\u30D6\u306A\u30EA\u30AF\u30A8\u30B9\u30C8\u6570\u306E\u30B0\u30ED\u30FC\u30D0\u30EB\u5236\u9650\u304C\u53EF\u80FD\u306B\u306A\u308A\u307E\u3059\u3002
undertow.servlet-container.disable-caching-for-secured-pages=Undertow \u304C\u30D8\u30C3\u30C0\u30FC\u3092\u8A2D\u5B9A\u3057\u3001\u30BB\u30AD\u30E5\u30A2\u5316\u3055\u308C\u305F\u30DA\u30FC\u30B8\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u7121\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B\u3002\u7121\u52B9\u306B\u3059\u308B\u3068\u3001\u6A5F\u5BC6\u6027\u306E\u9AD8\u3044\u30DA\u30FC\u30B8\u304C\u4EF2\u4ECB\u5F79\u306B\u3088\u3063\u3066\u30AD\u30E3\u30C3\u30B7\u30E5\u3055\u308C\u308B\u53EF\u80FD\u6027\u304C\u3042\u308B\u305F\u3081\u3001\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u306E\u554F\u984C\u306E\u539F\u56E0\u3068\u306A\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
undertow.servlet-container.mime-mapping=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8 mime \u30DE\u30C3\u30D4\u30F3\u30B0\u8A2D\u5B9A
undertow.servlet-container.welcome-file=Welcome \u30D5\u30A1\u30A4\u30EB
undertow.servlet-container.directory-listing=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u306B\u5BFE\u3057\u3066\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u30EA\u30B9\u30C8\u3092\u6709\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B\u3002
undertow.servlet-container.proactive-authentication=\u30D7\u30ED\u30A2\u30AF\u30C6\u30A3\u30D6\u306A\u8A8D\u8A3C\u3092\u4F7F\u7528\u3059\u308B\u304B\u3069\u3046\u304B\u3002true \u306E\u5834\u5408\u3001\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u304C\u5B58\u5728\u3059\u308B\u3068\u5E38\u306B\u30E6\u30FC\u30B6\u30FC\u304C\u8A8D\u8A3C\u3055\u308C\u307E\u3059\u3002
undertow.servlet-container.session-id-length=\u751F\u6210\u3055\u308C\u305F\u30BB\u30C3\u30B7\u30E7\u30F3 ID \u306E\u9577\u3055\u3002\u30BB\u30C3\u30B7\u30E7\u30F3 ID \u304C\u9577\u3044\u307B\u3069\u30BB\u30AD\u30E5\u30A2\u306B\u306A\u308A\u307E\u3059\u3002\u3053\u306E\u6570\u5B57\u306F\u3001\u30BB\u30C3\u30B7\u30E7\u30F3 ID \u306E\u751F\u6210\u306B\u4F7F\u7528\u3055\u308C\u305F\u30E9\u30F3\u30C0\u30E0\u6027\u306E\u30D0\u30A4\u30C8\u6570\u3092\u53C2\u7167\u3057\u307E\u3059\u3002\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u9001\u4FE1\u3055\u308C\u305F\u5B9F\u969B\u306E ID \u306F base64 \u30A8\u30F3\u30B3\u30FC\u30C9\u5316\u3055\u308C\u3001\u304A\u3088\u305D 33% \u5927\u304D\u3044\u3082\u306E\u306B\u306A\u308A\u307E\u3059 (\u4F8B\: ID \u306E\u9577\u3055\u304C 30\u306E\u5834\u5408\u3001\u30AF\u30C3\u30AD\u30FC\u5024\u306E\u9577\u3055\u306F 40 \u306B\u306A\u308A\u307E\u3059)\u3002
undertow.servlet-container.max-sessions=\u4E00\u5EA6\u306B\u30A2\u30AF\u30C6\u30A3\u30D6\u306B\u3067\u304D\u308B\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6700\u5927\u6570
undertow.servlet-container.disable-file-watch-service=true \u306E\u5834\u5408\u3001\u30D5\u30A1\u30A4\u30EB\u76E3\u8996\u30B5\u30FC\u30D3\u30B9\u306F\u5C55\u958B\u3055\u308C\u305F\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u5909\u66F4\u3092\u76E3\u8996\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u307E\u305B\u3093\u3002
undertow.servlet-container.disable-session-id-reuse=\u3053\u308C\u304C true \u306E\u5834\u5408\u3001\u672A\u77E5\u306E\u30BB\u30C3\u30B7\u30E7\u30F3 ID \u306F\u518D\u4F7F\u7528\u3055\u308C\u305A\u3001\u65B0\u3057\u3044\u30BB\u30C3\u30B7\u30E7\u30F3 ID \u304C\u751F\u6210\u3055\u308C\u307E\u3059\u3002\u3053\u308C\u304C false \u306E\u5834\u5408\u3001\u5225\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306B\u5B58\u5728\u3059\u308B\u5834\u5408\u306E\u307F\u518D\u4F7F\u7528\u3055\u308C\u3001\u540C\u3058\u30B5\u30FC\u30D0\u30FC\u4E0A\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u9593\u3067\u540C\u3058\u30BB\u30C3\u30B7\u30E7\u30F3 ID \u306E\u5171\u6709\u3092\u53EF\u80FD\u306B\u3057\u307E\u3059\u3002
undertow.mime-mapping=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u30B3\u30F3\u30C6\u30CA\u30FC mime \u30DE\u30C3\u30D4\u30F3\u30B0\u8A2D\u5B9A
undertow.mime-mapping.add=mime \u30DE\u30C3\u30D4\u30F3\u30B0\u3092\u8FFD\u52A0
undertow.mime-mapping.remove=mime \u30DE\u30C3\u30D4\u30F3\u30B0\u3092\u524A\u9664
undertow.mime-mapping.value=\u3053\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u306E mime \u30BF\u30A4\u30D7
undertow.welcome-file=Welcome \u30D5\u30A1\u30A4\u30EB
undertow.welcome-file.add=Welcome \u30D5\u30A1\u30A4\u30EB\u3092\u8FFD\u52A0
undertow.welcome-file.remove=Welcome \u30D5\u30A1\u30A4\u30EB\u3092\u524A\u9664
undertow.error-page=\u30B5\u30FC\u30D0\u30FC\u30A8\u30E9\u30FC\u30DA\u30FC\u30B8
undertow.handler=Undertow \u30CF\u30F3\u30C9\u30E9\u30FC
undertow.handler.add=\u30CF\u30F3\u30C9\u30E9\u30FC\u8981\u7D20\u3092\u8FFD\u52A0
undertow.handler.remove=\u30CF\u30F3\u30C9\u30E9\u30FC\u8981\u7D20\u3092\u524A\u9664
undertow.handler.name=\u30CF\u30F3\u30C9\u30E9\u30FC\u540D
undertow.filter=Undertow \u30D5\u30A3\u30EB\u30BF\u30FC
undertow.filter.add=\u30D5\u30A3\u30EB\u30BF\u30FC\u8981\u7D20\u3092\u8FFD\u52A0
undertow.filter.remove=\u30D5\u30A3\u30EB\u30BF\u30FC\u8981\u7D20\u3092\u524A\u9664
undertow.filter.name=\u30D5\u30A3\u30EB\u30BF\u30FC\u540D
undertow.ajp-listener=AJP \u30EA\u30B9\u30CA\u30FC
undertow.ajp-listener.add=AJP \u30EA\u30B9\u30CA\u30FC\u3092\u8FFD\u52A0
undertow.ajp-listener.remove=AJP \u30EA\u30B9\u30CA\u30FC\u3092\u524A\u9664
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.access-log=\u3053\u306E\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u306B\u5BFE\u3059\u308B\u30A2\u30AF\u30BB\u30B9\u30ED\u30B0\u306E\u8A2D\u5B9A
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.access-log.add=\u3053\u306E\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u306B\u5BFE\u3059\u308B\u30A2\u30AF\u30BB\u30B9\u30ED\u30B0\u306E\u8A2D\u5B9A\u3092\u8FFD\u52A0
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.access-log.remove=\u3053\u306E\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u30A2\u30AF\u30BB\u30B9\u30ED\u30B0\u8A2D\u5B9A\u3092\u524A\u9664
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.access-log.pattern=\u30A2\u30AF\u30BB\u30B9\u30ED\u30B0\u306E\u30D1\u30BF\u30FC\u30F3
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.access-log.prefix=\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u540D\u306E\u63A5\u982D\u8F9E
undertow.access-log.suffix=\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u540D\u306E\u63A5\u5C3E\u8F9E\u3002
undertow.access-log.directory=\u30ED\u30B0\u3092\u4FDD\u5B58\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.access-log.rotate=\u30A2\u30AF\u30BB\u30B9\u30ED\u30B0\u3092\u6BCE\u65E5\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3
undertow.access-log.worker=\u30ED\u30AE\u30F3\u30B0\u306B\u4F7F\u7528\u3059\u308B\u30EF\u30FC\u30AB\u30FC\u306E\u540D\u524D
undertow.access-log.use-server-log=\u500B\u5225\u306E\u30D5\u30A1\u30A4\u30EB\u3067\u306F\u306A\u304F\u30B5\u30FC\u30D0\u30FC\u30ED\u30B0\u306B\u30ED\u30B0\u304C\u66F8\u304D\u8FBC\u307E\u308C\u308B\u304B\u3069\u3046\u304B\u3002
undertow.access-log.relative-to=\u3053\u306E\u76F8\u5BFE\u30D1\u30B9\u306E\u8D77\u70B9\u3068\u306A\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC
undertow.access-log.extended=\u30ED\u30B0\u304C\u62E1\u5F35\u3055\u308C\u305F\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u5F62\u5F0F\u3092\u4F7F\u7528\u3059\u308B\u304B\u3069\u3046\u304B
undertow.access-log.predicate=\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u30ED\u30B0\u306B\u8A18\u9332\u3055\u308C\u308B\u3079\u304D\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3059\u308B\u8FF0\u8A9E
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.single-sign-on=SSO \u8A8D\u8A3C\u30E1\u30AB\u30CB\u30BA\u30E0\u306E\u8A2D\u5B9A\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.single-sign-on.add=SSO \u8A8D\u8A3C\u30E1\u30AB\u30CB\u30BA\u30E0\u3092\u8FFD\u52A0\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.single-sign-on.remove=SSO \u8A8D\u8A3C\u30E1\u30AB\u30CB\u30BA\u30E0\u3092\u524A\u9664\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.single-sign-on.domain=\u5229\u7528\u4E88\u5B9A\u306E\u30AF\u30C3\u30AD\u30FC\u30C9\u30E1\u30A4\u30F3
undertow.single-sign-on.path=\u30AF\u30C3\u30AD\u30FC\u30D1\u30B9\u3002
undertow.single-sign-on.http-only=Cookie httpOnly \u5C5E\u6027\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
undertow.single-sign-on.secure=Cookie secure \u5C5E\u6027\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
undertow.single-sign-on.cookie-name=\u30AF\u30C3\u30AD\u30FC\u306E\u540D\u524D
undertow.single-sign-on.key-store=\u30D7\u30E9\u30A4\u30D9\u30FC\u30C8\u30AD\u30FC\u30A8\u30F3\u30C8\u30EA\u30FC\u304C\u542B\u307E\u308C\u308B\u30AD\u30FC\u30B9\u30C8\u30A2\u3078\u306E\u53C2\u7167\u3002
undertow.single-sign-on.key-alias=\u30D0\u30C3\u30AF\u30C1\u30E3\u30CD\u30EB\u30ED\u30B0\u30A2\u30A6\u30C8\u63A5\u7D9A\u306E\u7F72\u540D\u304A\u3088\u3073\u691C\u8A3C\u306B\u4F7F\u7528\u3055\u308C\u308B\u30D7\u30E9\u30A4\u30D9\u30FC\u30C8\u30AD\u30FC\u30A8\u30F3\u30C8\u30EA\u30FC\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
undertow.single-sign-on.credential-reference=\u30D7\u30E9\u30A4\u30D9\u30FC\u30C8\u30AD\u30FC\u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u5FA9\u53F7\u5316\u3059\u308B\u305F\u3081\u306E\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u53C2\u7167\u3002
undertow.single-sign-on.credential-reference.store=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3078\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u4FDD\u6301\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u540D\u524D\u3002
undertow.single-sign-on.credential-reference.alias=\u4FDD\u5B58\u3055\u308C\u305F\u79D8\u5BC6\u307E\u305F\u306F\u30B9\u30C8\u30A2\u306E\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u610F\u5473\u3059\u308B\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
undertow.single-sign-on.credential-reference.type=\u3053\u306E\u53C2\u7167\u304C\u610F\u5473\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30BF\u30A4\u30D7\u3002
undertow.single-sign-on.credential-reference.clear-text=\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u6307\u5B9A\u3055\u308C\u305F\u79D8\u5BC6\u3002\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304C\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB/ \u79D8\u5BC6\u3092\u30B5\u30FC\u30D3\u30B9\u306B\u63D0\u4F9B\u3059\u308B\u65B9\u6CD5\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u3066\u304F\u3060\u3055\u3044\u3002
undertow.single-sign-on.client-ssl-context=\u30D0\u30C3\u30AF\u30C1\u30E3\u30CD\u30EB\u30ED\u30B0\u30A2\u30A6\u30C8\u63A5\u7D9A\u306E\u30BB\u30AD\u30E5\u30A2\u5316\u306B\u4F7F\u7528\u3055\u308C\u308B SSL \u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3078\u306E\u53C2\u7167\u3002
undertow.listener=http \u30EA\u30B9\u30CA\u30FC
undertow.listener.add=\u30EA\u30B9\u30CA\u30FC\u306E\u8FFD\u52A0
undertow.listener.remove=\u30EA\u30B9\u30CA\u30FC\u540D
undertow.listener.name=\u30EA\u30B9\u30CA\u30FC\u540D
undertow.listener.socket-binding=\u30EA\u30B9\u30CA\u30FC\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0
undertow.listener.worker=\u30EA\u30B9\u30CA\u30FC XNIO \u30EF\u30FC\u30AB\u30FC
undertow.listener.buffer-pool=\u30EA\u30B9\u30CA\u30FC\u30D0\u30C3\u30D5\u30A1\u30FC\u30D7\u30FC\u30EB
undertow.listener.enabled=\u30EA\u30B9\u30CA\u30FC\u304C\u6709\u52B9\u306B\u306A\u3063\u3066\u3044\u308B\u304B\u3069\u3046\u304B
undertow.listener.enabled.deprecated=\u6709\u52B9\u306B\u3055\u308C\u305F\u5C5E\u6027\u304C\u8A2D\u5B9A\u306E\u4E00\u8CAB\u6027\u306E\u5B9F\u65BD\u3067\u554F\u984C\u3092\u8D77\u3053\u3057\u3066\u3044\u308B\u305F\u3081\u3001\u3053\u308C\u3089\u306F\u5EC3\u6B62\u3055\u308C\u3066\u3044\u307E\u3059\u3002
undertow.listener.scheme=\u30EA\u30B9\u30CA\u30FC\u30B9\u30AD\u30FC\u30E0 (HTTP \u307E\u305F\u306F HTTPS)\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u306F\u3001\u30B9\u30AD\u30FC\u30E0\u306F\u53D7\u4FE1 AJP \u30EA\u30AF\u30A8\u30B9\u30C8\u304B\u3089\u53D6\u5F97\u3055\u308C\u307E\u3059\u3002
undertow.listener.certificate-forwarding=\u8A3C\u660E\u66F8\u306E\u8EE2\u9001\u304C\u6709\u52B9\u3067\u3042\u308B\u3079\u304D\u304B\u3069\u3046\u304B\u3002\u6709\u52B9\u306B\u3059\u308B\u3068\u3001\u30EA\u30B9\u30CA\u30FC\u306B\u3088\u3063\u3066\u8A3C\u660E\u66F8\u304C SSL_CLIENT_CERT \u5C5E\u6027\u304B\u3089\u53D6\u5F97\u3055\u308C\u307E\u3059\u3002\u3053\u308C\u306F\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u80CC\u5F8C\u3067\u306E\u307F\u6709\u52B9\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u3001\u5E38\u306B\u3053\u308C\u3089\u306E\u30D8\u30C3\u30C0\u30FC\u3092\u8A2D\u5B9A\u3059\u308B\u3088\u3046\u30D7\u30ED\u30AD\u30B7\u30FC\u304C\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002
undertow.listener.ssl-context=\u3053\u306E\u30EA\u30B9\u30CA\u30FC\u306B\u3088\u308A\u4F7F\u7528\u3055\u308C\u308B SSLContext \u3092\u53C2\u7167\u3057\u307E\u3059\u3002
undertow.listener.security-realm=\u30EA\u30B9\u30CA\u30FC\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0
undertow.listener.security-realm.deprecated=\u8A2D\u5B9A\u3055\u308C\u305F SSLContext \u3092\u76F4\u63A5\u53C2\u7167\u3059\u308B ssl-context \u5C5E\u6027\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
undertow.listener.max-post-size=\u8A31\u53EF\u3055\u308C\u308B\u30DD\u30B9\u30C8\u306E\u6700\u5927\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8\u5358\u4F4D)\u3002
undertow.listener.buffer-pipelined-data=\u30D1\u30A4\u30D7\u30E9\u30A4\u30F3\u5316\u3055\u308C\u305F\u30EA\u30B9\u30A8\u30B9\u30C8\u3092\u30D0\u30C3\u30D5\u30A1\u30FC\u3059\u3079\u304D\u304B\u3069\u3046\u304B
undertow.listener.allow-encoded-slash=\u30A8\u30F3\u30B3\u30FC\u30C9/\u6587\u5B57 (\u4F8B\: %2F) \u3067\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u53D7\u3051\u53D6\u3063\u305F\u5834\u5408\u3001\u30C7\u30B3\u30FC\u30C9\u3059\u308B\u304B\u3069\u3046\u304B\u3002
undertow.listener.decode-url=true \u306E\u5834\u5408\u3001\u9078\u629E\u3055\u308C\u305F\u6587\u5B57\u30A8\u30F3\u30B3\u30FC\u30C7\u30A3\u30F3\u30B0 (\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u306F UFT-8) \u3092\u4F7F\u7528\u3057\u3066\u30D1\u30FC\u30B5\u30FC\u304C URL \u304A\u3088\u3073\u30AF\u30A8\u30EA\u30FC\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3092\u30C7\u30B3\u30FC\u30C9\u3057\u307E\u3059\u3002false \u306E\u5834\u5408\u306F\u30C7\u30B3\u30FC\u30C9\u3055\u308C\u307E\u305B\u3093\u3002\u3053\u308C\u306B\u3088\u308A\u3001\u5F8C\u306E\u30CF\u30F3\u30C9\u30E9\u30FC\u306F\u5E0C\u671B\u306E\u6587\u5B57\u30BB\u30C3\u30C8\u3067\u30C7\u30B3\u30FC\u30C9\u3067\u304D\u307E\u3059\u3002
undertow.listener.url-charset=URL \u6587\u5B57\u30BB\u30C3\u30C8
undertow.listener.max-header-size=http \u30EA\u30AF\u30A8\u30B9\u30C8\u30D8\u30C3\u30C0\u30FC\u306E\u6700\u5927\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8\u5358\u4F4D)\u3002
undertow.listener.max-headers=\u89E3\u6790\u3055\u308C\u308B\u30D8\u30C3\u30C0\u30FC\u306E\u6700\u5927\u6570\u3002\u30CF\u30C3\u30B7\u30E5\u306E\u8106\u5F31\u6027\u3092\u4FDD\u8B77\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
undertow.listener.max-cookies=\u89E3\u6790\u3055\u308C\u308B\u30AF\u30C3\u30AD\u30FC\u306E\u6700\u5927\u6570\u3002\u30CF\u30C3\u30B7\u30E5\u306E\u8106\u5F31\u6027\u3092\u4FDD\u8B77\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
undertow.listener.max-parameters=\u89E3\u6790\u3055\u308C\u308B\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u6700\u5927\u6570\u3002\u30CF\u30C3\u30B7\u30E5\u306E\u8106\u5F31\u6027\u3092\u4FDD\u8B77\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002\u3053\u308C\u306F\u30AF\u30A8\u30EA\u30FC\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3068 POST \u30C7\u30FC\u30BF\u306E\u4E21\u65B9\u306B\u9069\u7528\u3055\u308C\u307E\u3059\u304C\u3001\u7D2F\u8A08\u3067\u306F\u3042\u308A\u307E\u305B\u3093 (\u305F\u3068\u3048\u3070\u3001\u6700\u5927\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u6570\u306E 2 \u500D\u306E\u6570\u3092\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u5408\u8A08\u3068\u3057\u3066\u4F7F\u7528\u3067\u304D\u307E\u3059)\u3002
undertow.listener.verify-client=SSL \u30C1\u30E3\u30CD\u30EB\u306E\u5E0C\u671B\u306E SSL \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u8A8D\u8A3C\u30E2\u30FC\u30C9
undertow.listener.verify-client.deprecated=SSLContext \u304C\u53C2\u7167\u3055\u308C\u308B\u5834\u6240\u3067\u306F\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u691C\u8A3C\u306E\u5FC5\u8981\u306A\u30E2\u30FC\u30C9\u306B\u5BFE\u3057\u3066\u76F4\u63A5\u8A2D\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
undertow.listener.always-set-keep-alive=true \u306E\u5834\u5408\u3001\u4ED5\u69D8\u304C\u53B3\u5BC6\u306B\u5FC5\u8981\u3068\u3057\u306A\u304F\u3066\u3082 Connection\: keep-alive \u30D8\u30C3\u30C0\u30FC\u304C\u5FDC\u7B54\u306B\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
undertow.listener.redirect-socket=\u30EA\u30B9\u30CA\u30FC\u304C\u975E SSL \u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u3001SSL \u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u3092\u5FC5\u8981\u3068\u3059\u308B\u4E00\u81F4\u3059\u308B <security-constraint> \u306B\u5BFE\u3057\u3066\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u53D7\u3051\u53D6\u3063\u305F\u5834\u5408\u3001Undertow \u306F\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u3053\u3053\u306B\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30DD\u30FC\u30C8\u3078\u81EA\u52D5\u7684\u306B\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u3057\u307E\u3059\u3002
undertow.listener.proxy-address-forwarding=x-forwarded-host \u30D8\u30C3\u30C0\u30FC (\u304A\u3088\u3073\u305D\u306E\u4ED6\u306E x-forwarded-* \u30D8\u30C3\u30C0\u30FC) \u306E\u51E6\u7406\u3092\u6709\u52B9\u306B\u3057\u3001\u3053\u306E\u30D8\u30C3\u30C0\u30FC\u60C5\u5831\u3092\u4F7F\u7528\u3057\u3066\u30EA\u30E2\u30FC\u30C8\u30A2\u30C9\u30EC\u30B9\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u3053\u308C\u3089\u306E\u30D8\u30C3\u30C0\u30FC\u3092\u8A2D\u5B9A\u3059\u308B\u4FE1\u983C\u3055\u308C\u305F\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u80CC\u5F8C\u3067\u306E\u307F\u4F7F\u7528\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u305D\u3046\u3067\u306A\u3044\u3068\u3001\u30EA\u30E2\u30FC\u30C8\u30E6\u30FC\u30B6\u30FC\u306B\u3088\u308B IP \u30A2\u30C9\u30EC\u30B9\u306E\u507D\u88C5\u304C\u53EF\u80FD\u306B\u306A\u308A\u307E\u3059\u3002
undertow.listener.enabled-cipher-suites=\u6709\u52B9\u306B\u306A\u3063\u3066\u3044\u308B SSL \u6697\u53F7\u3092\u8A2D\u5B9A
undertow.listener.enabled-cipher-suites.deprecated=SSLContext \u304C\u53C2\u7167\u3055\u308C\u308B\u5834\u6240\u3067\u306F\u3001\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308B\u6697\u53F7\u30B9\u30A4\u30FC\u30C8\u3067\u8A2D\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
undertow.listener.enabled-protocols=SSL \u30D7\u30ED\u30C8\u30B3\u30EB\u3092\u8A2D\u5B9A
undertow.listener.enabled-protocols.deprecated=SSLContext \u304C\u53C2\u7167\u3055\u308C\u308B\u5834\u6240\u3067\u306F\u3001\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308B\u30D7\u30ED\u30C8\u30B3\u30EB\u3067\u8A2D\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
undertow.listener.max-buffered-request-size=\u30D0\u30C3\u30D5\u30A1\u30FC\u3055\u308C\u305F\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6700\u5927\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8\u5358\u4F4D)\u3002\u30EA\u30AF\u30A8\u30B9\u30C8\u306F\u901A\u5E38\u30D0\u30C3\u30D5\u30A1\u30FC\u3055\u308C\u307E\u305B\u3093\u3002\u6700\u3082\u4E00\u822C\u7684\u306A\u4F8B\u306F\u3001POST \u30EA\u30AF\u30A8\u30B9\u30C8\u306B SSL \u518D\u30CD\u30B4\u30B7\u30A8\u30FC\u30B7\u30E7\u30F3\u3092\u884C\u3046\u3068\u304D\u3067\u3001\u518D\u30CD\u30B4\u30B7\u30A8\u30FC\u30B7\u30E7\u30F3\u306E\u5B9F\u884C\u306B\u306F POST \u30C7\u30FC\u30BF\u3092\u5B8C\u5168\u306B\u30D0\u30C3\u30D5\u30A1\u30FC\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
undertow.listener.record-request-start-time=true \u306E\u5834\u5408\u3001Undertow \u306F\u30EA\u30AF\u30A8\u30B9\u30C8\u958B\u59CB\u6642\u9593\u3092\u8A18\u9332\u3057\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u6642\u9593\u304C\u30ED\u30B0\u306B\u8A18\u9332\u3055\u308C\u308B\u3088\u3046\u306B\u3057\u307E\u3059\u3002\u3053\u308C\u306B\u3088\u308A\u3001\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306F\u5C0F\u3055\u3044\u306A\u304C\u3089\u3042\u308B\u7A0B\u5EA6\u306E\u5F71\u97FF\u3092\u53D7\u3051\u307E\u3059\u3002
undertow.listener.allow-equals-in-cookie-value=true \u306E\u5834\u5408\u3001Undertow \u306E\u5F15\u7528\u7B26\u3067\u56F2\u307E\u308C\u3066\u3044\u306A\u3044\u30AF\u30C3\u30AD\u30FC\u5024\u3067\u30A8\u30B9\u30B1\u30FC\u30D7\u51E6\u7406\u3055\u308C\u3066\u3044\u306A\u3044\u7B49\u53F7\u3092\u8A31\u53EF\u3057\u307E\u3059\u3002\u5F15\u7528\u7B26\u3067\u56F2\u307E\u308C\u3066\u3044\u306A\u3044\u30AF\u30C3\u30AD\u30FC\u5024\u306B\u306F\u7B49\u53F7\u304C\u542B\u307E\u308C\u3066\u3044\u306A\u3044\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002\u7B49\u53F7\u304C\u3042\u308B\u5834\u5408\u306F\u7B49\u53F7\u306E\u524D\u3067\u5024\u304C\u7D42\u4E86\u3057\u307E\u3059\u3002\u30AF\u30C3\u30AD\u30FC\u5024\u306E\u6B8B\u308A\u306E\u90E8\u5206\u306F\u7834\u68C4\u3055\u308C\u307E\u3059\u3002
undertow.listener.no-request-timeout=\u30B3\u30F3\u30C6\u30CA\u30FC\u306B\u3088\u3063\u3066\u63A5\u7D9A\u304C\u9589\u3058\u3089\u308C\u308B\u524D\u306B\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u3067\u3044\u3089\u308C\u308B\u671F\u9593 (\u30DF\u30EA\u79D2\u5358\u4F4D)\u3002
undertow.listener.request-parse-timeout=\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u89E3\u6790\u306B\u8CBB\u3084\u3059\u3053\u3068\u304C\u3067\u304D\u308B\u6700\u5927\u6642\u9593 (\u30DF\u30EA\u79D2\u5358\u4F4D)
undertow.listener.rfc6265-cookie-validation=\u30AF\u30C3\u30AD\u30FC\u304C\u78BA\u5B9F\u306B RFC6265 \u306B\u6E96\u62E0\u3059\u308B\u3088\u3046\u3001\u30AF\u30C3\u30AD\u30FC\u3092\u691C\u8A3C\u3059\u308B\u304B\u3069\u3046\u304B\u3002
undertow.listener.receive-buffer=\u53D7\u4FE1\u30D0\u30C3\u30D5\u30A1\u30FC\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8\u5358\u4F4D)\u3002
undertow.listener.send-buffer=\u9001\u4FE1\u30D0\u30C3\u30D5\u30A1\u30FC\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8\u5358\u4F4D)\u3002
undertow.listener.max-connections=\u540C\u6642\u63A5\u7D9A\u306E\u6700\u5927\u6570\u30020 \u3088\u308A\u3082\u5927\u304D\u3044\u5024\u306E\u307F\u304C\u8A31\u53EF\u3055\u308C\u307E\u3059\u3002\u7121\u5236\u9650\u306E\u63A5\u7D9A\u306E\u5834\u5408\u306F\u3001\u3053\u306E\u5C5E\u6027\u5024\u306E\u5B9A\u7FA9\u3092\u89E3\u9664\u3057\u307E\u3059\u3002
undertow.listener.tcp-backlog=\u6307\u5B9A\u306E\u30D0\u30C3\u30AF\u30ED\u30B0\u3067\u30B5\u30FC\u30D0\u30FC\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
undertow.listener.tcp-keep-alive=\u5B9F\u88C5\u306B\u4F9D\u5B58\u3057\u305F\u72B6\u614B\u3067 TCP \u30AD\u30FC\u30D7\u30A2\u30E9\u30A4\u30D6\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u9001\u4FE1\u3059\u308B\u30C1\u30E3\u30CD\u30EB\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
undertow.listener.read-timeout=\u30BD\u30B1\u30C3\u30C8\u306E\u8AAD\u307F\u53D6\u308A\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3092\u30DF\u30EA\u79D2\u5358\u4F4D\u3067\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u8AAD\u307F\u53D6\u308A\u306B\u6210\u529F\u3057\u306A\u3044\u307E\u307E\u6307\u5B9A\u306E\u6642\u9593\u304C\u7D4C\u904E\u3057\u305F\u5834\u5408\u3001\u30BD\u30B1\u30C3\u30C8\u306E\u6B21\u306E\u8AAD\u307F\u53D6\u308A\u306B\u3088\u3063\u3066  {@link ReadTimeoutException} \u304C\u767A\u751F\u3057\u307E\u3059\u3002
undertow.listener.write-timeout=\u30BD\u30B1\u30C3\u30C8\u306E\u66F8\u304D\u8FBC\u307F\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3092\u30DF\u30EA\u79D2\u5358\u4F4D\u3067\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u66F8\u304D\u8FBC\u307F\u306B\u6210\u529F\u3057\u306A\u3044\u307E\u307E\u6307\u5B9A\u306E\u6642\u9593\u304C\u7D4C\u904E\u3057\u305F\u5834\u5408\u3001\u30BD\u30B1\u30C3\u30C8\u306E\u6B21\u306E\u66F8\u304D\u8FBC\u307F\u306B\u3088\u3063\u3066  {@link WriteTimeoutException} \u304C\u767A\u751F\u3057\u307E\u3059\u3002
undertow.listener.resolve-peer-address=\u30DB\u30B9\u30C8 DNS \u30EB\u30C3\u30AF\u30A2\u30C3\u30D7\u3092\u6709\u52B9\u306B\u3057\u307E\u3059
undertow.listener.enable-connector-statistics=\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u7D71\u8A08\u3092\u6709\u52B9\u306B\u3059\u3079\u304D\u304B\u3069\u3046\u304B\u3002\u3053\u308C\u306B\u3088\u308A\u7D71\u8A08\u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u307E\u3059\u304C\u3001\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u304C\u4E00\u90E8\u5F71\u97FF\u3092\u53D7\u3051\u307E\u3059\u3002
undertow.listener.request-count=\u3053\u306E\u30EA\u30B9\u30CA\u30FC\u304C\u5BFE\u5FDC\u3057\u305F\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6570
undertow.listener.bytes-sent=\u3053\u306E\u30EA\u30B9\u30CA\u30FC\u3067\u9001\u4FE1\u3055\u308C\u305F\u30D0\u30A4\u30C8\u6570
undertow.listener.bytes-received=\u3053\u306E\u30EA\u30B9\u30CA\u30FC\u306B\u3088\u3063\u3066\u53D7\u4FE1\u3055\u308C\u305F\u30D0\u30A4\u30C8\u6570
undertow.listener.error-count=\u3053\u306E\u30EA\u30B9\u30CA\u30FC\u306B\u3088\u3063\u3066\u9001\u4FE1\u3055\u308C\u305F\u30B3\u30FC\u30C9 500 \u306E\u5FDC\u7B54\u306E\u6570
undertow.listener.processing-time=\u3053\u306E\u30EA\u30B9\u30CA\u30FC\u306B\u3088\u3063\u3066\u51E6\u7406\u3055\u308C\u305F\u3059\u3079\u3066\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u5408\u8A08\u51E6\u7406\u6642\u9593
undertow.listener.max-processing-time=\u3053\u306E\u30EA\u30B9\u30CA\u30FC\u3067\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u51E6\u7406\u306B\u304B\u304B\u3063\u305F\u6700\u5927\u6642\u9593
undertow.listener.reset-statistics=\u30B3\u30CD\u30AF\u30BF\u30FC\u7D71\u8A08\u3092\u3059\u3079\u3066\u30BC\u30ED\u306B\u30EA\u30BB\u30C3\u30C8\u3057\u307E\u3059
undertow.listener.enable-http2=\u3053\u306E\u30EA\u30B9\u30CA\u30FC\u306E HTTP2 \u30B5\u30DD\u30FC\u30C8\u3092\u6709\u52B9\u306B\u3057\u307E\u3059
undertow.listener.enable-spdy=\u3053\u306E\u30EA\u30B9\u30CA\u30FC\u306E SPDY \u30B5\u30DD\u30FC\u30C8\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002\u3053\u308C\u306F\u5EC3\u6B62\u3055\u308C\u3001\u52B9\u679C\u7684\u3067\u306F\u308A\u307E\u305B\u3093\u3002\u4EE3\u308F\u308A\u306B HTTP/2 \u3092\u4F7F\u7528\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
undertow.listener.enable-spdy.deprecated=SPDY \u306F HTTP/2 \u306B\u3088\u3063\u3066\u7F6E\u304D\u63DB\u3048\u3089\u308C\u307E\u3057\u305F\u3002
undertow.listener.disallowed-methods=\u8A31\u53EF\u3055\u308C\u306A\u3044 HTTP \u30E1\u30BD\u30C3\u30C9\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8
undertow.listener.ssl-session-cache-size=\u30A2\u30AF\u30C6\u30A3\u30D6\u306A SSL \u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6700\u5927\u6570
undertow.listener.ssl-session-cache-size.deprecated=Elytron \u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3067\u3053\u308C\u3092\u8A2D\u5B9A\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3057\u305F
undertow.listener.ssl-session-timeout=SSL \u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u79D2\u5358\u4F4D)
undertow.listener.ssl-session-timeout.deprecated=Elytron \u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3067\u3053\u308C\u3092\u8A2D\u5B9A\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3057\u305F
undertow.listener.secure=true \u306E\u5834\u5408\u3001HTTPS \u3092\u4F7F\u7528\u3057\u306A\u304F\u3066\u3082\u3053\u306E\u30EA\u30B9\u30CA\u30FC\u304B\u3089\u9001\u4FE1\u3055\u308C\u308B\u30EA\u30AF\u30A8\u30B9\u30C8\u306F\u30BB\u30AD\u30E5\u30A2\u3067\u3042\u308B\u3068\u30DE\u30FC\u30AF\u4ED8\u3051\u3055\u308C\u307E\u3059\u3002
undertow.listener.max-ajp-packet-size=AJP \u30D1\u30B1\u30C3\u30C8\u306E\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308B\u6700\u5927\u30B5\u30A4\u30BA\u3002\u3053\u308C\u304C\u5909\u66F4\u3055\u308C\u305F\u5834\u5408\u3001\u30ED\u30FC\u30C9\u30D0\u30E9\u30F3\u30B5\u30FC\u304A\u3088\u3073\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9\u30B5\u30FC\u30D0\u30FC\u306E\u5024\u3092\u5927\u304D\u304F\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
undertow.listener.http2-enable-push=\u3053\u306E\u63A5\u7D9A\u3067\u30B5\u30FC\u30D0\u30FC\u30D7\u30C3\u30B7\u30E5\u304C\u6709\u52B9\u3067\u3042\u308B\u304B\u3069\u3046\u304B
undertow.listener.http2-max-frame-size=\u6700\u5927 HTTP/2 \u30D5\u30EC\u30FC\u30E0\u30B5\u30A4\u30BA
undertow.listener.http2-max-concurrent-streams=\u5358\u4E00\u306E\u63A5\u7D9A\u3067\u30A2\u30AF\u30C6\u30A3\u30D6\u306A\u72B6\u614B\u3067\u3044\u3089\u308C\u308B HTTP/2 \u30B9\u30C8\u30EA\u30FC\u30E0\u306E\u6700\u5927\u6570
undertow.listener.http2-max-header-list-size=\u30B5\u30FC\u30D0\u30FC\u304C\u8A31\u53EF\u3059\u308B\u6E96\u5099\u304C\u3067\u304D\u3066\u3044\u308B\u30EA\u30AF\u30A8\u30B9\u30C8\u30D8\u30C3\u30C0\u30FC\u306E\u6700\u5927\u30B5\u30A4\u30BA
undertow.listener.http2-initial-window-size=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u30C7\u30FC\u30BF\u3092\u30B5\u30FC\u30D0\u30FC\u306B\u9001\u4FE1\u3059\u308B\u901F\u5EA6\u3092\u5236\u5FA1\u3059\u308B\u30D5\u30ED\u30FC\u5236\u5FA1\u30A6\u30A4\u30F3\u30C9\u30A6\u30B5\u30A4\u30BA
undertow.listener.http2-header-table-size=HPACK \u5727\u7E2E\u3067\u4F7F\u7528\u3055\u308C\u308B\u30D8\u30C3\u30C0\u30FC\u30C6\u30FC\u30D6\u30EB\u306E\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8\u5358\u4F4D)\u3002\u3053\u306E\u30E1\u30E2\u30EA\u30FC\u91CF\u304C\u63A5\u7D9A\u3054\u3068\u306B\u5727\u7E2E\u7528\u306B\u5272\u308A\u5F53\u3066\u3089\u308C\u307E\u3059\u3002\u3088\u308A\u5927\u304D\u306A\u5024\u306F\u3088\u308A\u591A\u304F\u306E\u30E1\u30E2\u30EA\u30FC\u3092\u4F7F\u7528\u3057\u307E\u3059\u304C\u3001\u5727\u7E2E\u304C\u5411\u4E0A\u3055\u308C\u307E\u3059\u3002
undertow.listener.require-host-http11=RFC \u306B\u5F93\u3044\u3001\u3059\u3079\u3066\u306E HTTP/1.1 \u30EA\u30AF\u30A8\u30B9\u30C8\u306B 'Host' \u30D8\u30C3\u30C0\u30FC\u304C\u5FC5\u8981\u306B\u306A\u308A\u307E\u3059\u3002\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u3053\u306E\u30D8\u30C3\u30C0\u30FC\u304C\u542B\u307E\u308C\u306A\u3044\u3068\u3001403 \u30A8\u30E9\u30FC\u306B\u3088\u308A\u62D2\u5426\u3055\u308C\u307E\u3059\u3002
undertow.host=Undertow \u30DB\u30B9\u30C8
undertow.host.add=\u65B0\u3057\u3044\u30DB\u30B9\u30C8\u3092\u8FFD\u52A0
undertow.host.remove=\u30DB\u30B9\u30C8\u3092\u524A\u9664
undertow.host.name=\u30DB\u30B9\u30C8\u540D
undertow.host.alias=\u30DB\u30B9\u30C8\u306E\u30A8\u30A4\u30EA\u30A2\u30B9
undertow.host.default-web-module=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E Web \u30E2\u30B8\u30E5\u30FC\u30EB
undertow.host.setting=\u8A2D\u5B9A
undertow.host.default-response-code=\u8A2D\u5B9A\u3055\u308C\u308B\u3068\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u305F\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u304C\u30B5\u30FC\u30D0\u30FC\u306B\u5B58\u5728\u3057\u306A\u3044\u5834\u5408\u306B\u9001\u308A\u8FD4\u3055\u308C\u308B\u5FDC\u7B54\u30B3\u30FC\u30C9\u306B\u306A\u308A\u307E\u3059\u3002
undertow.host.disable-console-redirect=true \u306B\u8A2D\u5B9A\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u3053\u306E\u30DB\u30B9\u30C8\u306E\u30B3\u30F3\u30BD\u30FC\u30EB\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u304C\u6709\u52B9\u5316\u3055\u308C\u307E\u305B\u3093\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F false \u3067\u3059\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp=JSP \u30B3\u30F3\u30C6\u30CA\u30FC\u8A2D\u5B9A
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.add=JSP \u30B3\u30F3\u30C6\u30CA\u30FC\u8A2D\u5B9A\u3092\u8FFD\u52A0
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.remove=JSP \u30B3\u30F3\u30C6\u30CA\u30FC\u8A2D\u5B9A\u3092\u524A\u9664
undertow.setting.jsp.development=\u7D20\u65E9\u3044 JSP \u306E\u30EA\u30ED\u30FC\u30C9\u3092\u6709\u52B9\u306B\u3059\u308B\u958B\u767A\u30E2\u30FC\u30C9\u3092\u6709\u52B9\u5316\u3057\u307E\u3059
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.disabled=JSP \u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u7121\u52B9\u5316
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.keep-generated=\u751F\u6210\u3057\u305F\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u3092\u4FDD\u6301
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.trim-spaces=\u751F\u6210\u3057\u305F\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u304B\u3089\u5BB9\u91CF\u306E\u4E00\u90E8\u3092\u6E1B\u3089\u3057\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.tag-pooling=\u30BF\u30B0\u30D7\u30FC\u30EA\u30F3\u30B0\u306E\u6709\u52B9\u5316
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.mapped-file=JSP \u30BD\u30FC\u30B9\u3078\u306E\u30DE\u30C3\u30D4\u30F3\u30B0
undertow.setting.jsp.check-interval=\u30D0\u30C3\u30AF\u30B0\u30E9\u30A6\u30F3\u30C9\u30B9\u30EC\u30C3\u30C9\u3092\u4F7F\u7528\u3057\u3066 JSP \u66F4\u65B0\u306E\u9593\u9694\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u307E\u3059\u3002\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u901A\u77E5 API \u3092\u4F7F\u7528\u3057\u3066 JSP \u5909\u66F4\u901A\u77E5\u304C\u51E6\u7406\u3055\u308C\u308B\u307B\u3068\u3093\u3069\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3067\u306F\u52B9\u679C\u306F\u3042\u308A\u307E\u305B\u3093\u3002\u30D5\u30A1\u30A4\u30EB\u76E3\u8996\u30B5\u30FC\u30D3\u30B9\u304C\u7121\u52B9\u306B\u306A\u3063\u3066\u3044\u308B\u5834\u5408\u306E\u307F\u6709\u52B9\u3067\u3059\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.modification-test-interval=2 \u3064\u306E\u66F4\u65B0\u30C6\u30B9\u30C8\u306E\u9593\u306B\u304B\u304B\u308B\u6700\u77ED\u306E\u9593\u9694 (\u79D2)
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.recompile-on-fail=\u5404\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u5BFE\u3057\u5931\u6557\u3057\u305F JSP \u30B3\u30F3\u30D1\u30A4\u30EB\u3092\u518D\u8A66\u884C
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.smap=SMAP \u306E\u6709\u52B9\u5316
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.dump-smap=SMAP \u30C7\u30FC\u30BF\u3092\u30D5\u30A1\u30A4\u30EB\u306B\u66F8\u304D\u8FBC\u307F
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.generate-strings-as-char-arrays=\u6587\u5B57\u5217\u5B9A\u6570\u3092 char \u914D\u5217\u3068\u3057\u3066\u751F\u6210
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.error-on-use-bean-invalid-class-attribute=useBean \u3067\u4E0D\u6B63\u306A\u30AF\u30E9\u30B9\u3092\u4F7F\u3063\u305F\u5834\u5408\u306E\u30A8\u30E9\u30FC\u3092\u6709\u52B9\u5316
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.scratch-dir=\u5225\u306E\u4F5C\u696D\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u6307\u5B9A
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.source-vm=\u30B3\u30F3\u30D1\u30A4\u30EB\u5143\u306E VM \u30EC\u30D9\u30EB
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.target-vm=\u30B3\u30F3\u30D1\u30A4\u30EB\u5148\u306E VM \u30EC\u30D9\u30EB
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.java-encoding=Java \u30BD\u30FC\u30B9\u306B\u4F7F\u3046\u30A8\u30F3\u30B3\u30FC\u30C7\u30A3\u30F3\u30B0\u3092\u6307\u5B9A
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.setting.jsp.x-powered-by=x-powered-by \u3067 JSP \u30A8\u30F3\u30B8\u30F3\u306E\u30A2\u30C9\u30D0\u30BF\u30A4\u30BA\u3092\u6709\u52B9\u5316
undertow.setting.jsp.display-source-fragment=\u30E9\u30F3\u30BF\u30A4\u30E0\u30A8\u30E9\u30FC\u306E\u767A\u751F\u6642\u306B JSP \u30BD\u30FC\u30B9\u306E\u4E00\u90E8\u306E\u8868\u793A\u3092\u8A66\u884C
undertow.setting.jsp.optimize-scriptlets=JSP \u30B9\u30AF\u30EA\u30D7\u30C8\u30EC\u30C3\u30C8\u304C\u6587\u5B57\u5217\u9023\u7D50\u3092\u524A\u9664\u3059\u308B\u305F\u3081\u306B\u6700\u9069\u5316\u3055\u308C\u308B\u3079\u304D\u304B\u3069\u3046\u304B
undertow.setting.session-cookie=\u30BB\u30C3\u30B7\u30E7\u30F3\u30AF\u30C3\u30AD\u30FC\u8A2D\u5B9A
undertow.setting.session-cookie.add=\u30BB\u30C3\u30B7\u30E7\u30F3\u30AF\u30C3\u30AD\u30FC\u8A2D\u5B9A\u306E\u8FFD\u52A0
undertow.setting.session-cookie.remove=\u30BB\u30C3\u30B7\u30E7\u30F3\u30AF\u30C3\u30AD\u30FC\u8A2D\u5B9A\u306E\u524A\u9664
undertow.setting.session-cookie.name=\u30AF\u30C3\u30AD\u30FC\u306E\u540D\u524D
undertow.setting.session-cookie.http-only=\u30AF\u30C3\u30AD\u30FC\u306F http \u5C02\u7528\u3067\u3059\u304B
undertow.setting.session-cookie.secure=\u30AF\u30C3\u30AD\u30FC\u306F\u30BB\u30AD\u30E5\u30A2\u3067\u3059\u304B
undertow.setting.session-cookie.domain=\u30AF\u30C3\u30AD\u30FC\u30C9\u30E1\u30A4\u30F3
undertow.setting.session-cookie.comment=\u30AF\u30C3\u30AD\u30FC\u30B3\u30E1\u30F3\u30C8
undertow.setting.session-cookie.max-age=\u30AF\u30C3\u30AD\u30FC\u306E\u6700\u9577\u671F\u9593
undertow.setting.persistent-sessions=\u30BB\u30C3\u30B7\u30E7\u30F3\u6C38\u7D9A\u5316\u30BB\u30C3\u30B7\u30E7\u30F3
undertow.setting.persistent-sessions.enabled=true \u306E\u5834\u5408\u306F\u6C38\u7D9A\u5316\u30BB\u30C3\u30B7\u30E7\u30F3\u304C\u6709\u52B9\u5316\u3055\u308C\u307E\u3059
undertow.setting.persistent-sessions.add=\u6C38\u7D9A\u5316\u30BB\u30C3\u30B7\u30E7\u30F3\u30EA\u30BD\u30FC\u30B9\u3092\u8FFD\u52A0
undertow.setting.persistent-sessions.remove=\u6C38\u7D9A\u5316\u30BB\u30C3\u30B7\u30E7\u30F3\u30EA\u30BD\u30FC\u30B9\u3092\u524A\u9664
undertow.setting.persistent-sessions.path=\u6C38\u7D9A\u5316\u30BB\u30C3\u30B7\u30E7\u30F3\u30C7\u30FC\u30BF\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3078\u306E\u30D1\u30B9\u3002null \u306E\u5834\u5408\u3001\u30BB\u30C3\u30B7\u30E7\u30F3\u306F\u30E1\u30E2\u30EA\u30FC\u306B\u4FDD\u5B58\u3055\u308C\u307E\u3059\u3002
undertow.setting.persistent-sessions.relative-to=\u3053\u306E\u76F8\u5BFE\u30D1\u30B9\u306E\u8D77\u70B9\u3068\u306A\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC
undertow.handler.simple-error-page=\u7C21\u5358\u306A\u30A8\u30E9\u30FC\u30DA\u30FC\u30B8\u8A2D\u5B9A
undertow.setting.websockets=\u3053\u306E\u30B3\u30F3\u30C6\u30CA\u30FC\u3067 websocket \u304C\u6709\u52B9\u3067\u3042\u308B\u304B\u3069\u3046\u304B
undertow.setting.websockets.add=websocket \u30B5\u30DD\u30FC\u30C8\u3092\u8FFD\u52A0
undertow.setting.websockets.remove=websocket \u30B5\u30DD\u30FC\u30C8\u3092\u524A\u9664
undertow.setting.websockets.dispatch-to-worker=\u30B3\u30FC\u30EB\u30D0\u30C3\u30AF\u304C\u30EF\u30FC\u30AB\u30FC\u30B9\u30EC\u30C3\u30C9\u3078\u30C7\u30A3\u30B9\u30D1\u30C3\u30C1\u3055\u308C\u308B\u3079\u304D\u304B\u3069\u3046\u304B\u3002false \u306E\u5834\u5408\u306F\u3088\u308A\u901F\u3044 IO \u30B9\u30EC\u30C3\u30C9\u3067\u5B9F\u884C\u3055\u308C\u307E\u3059\u304C\u3001\u30D6\u30ED\u30C3\u30AD\u30F3\u30B0\u64CD\u4F5C\u304C\u884C\u308F\u308C\u306A\u3044\u3088\u3046\u306B\u6C17\u3092\u4ED8\u3051\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
undertow.setting.websockets.worker=websocket \u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u4F7F\u7528\u3059\u308B\u30EF\u30FC\u30AB\u30FC
undertow.setting.websockets.buffer-pool=websocket \u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u4F7F\u7528\u3059\u308B\u30D0\u30C3\u30D5\u30A1\u30FC\u30D7\u30FC\u30EB
undertow.setting.websockets.per-message-deflate=websocket \u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3054\u3068\u306E\u5727\u7E2E\u62E1\u5F35\u6A5F\u80FD  (RFC-7692) \u3092\u6709\u52B9\u5316
undertow.setting.websockets.deflater-level=DEFLATE \u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u306E\u5727\u7E2E\u30EC\u30D9\u30EB\u3092\u8A2D\u5B9A
undertow.setting.crawler-session-management=\u30AF\u30ED\u30FC\u30E9\u30FC\u30DC\u30C3\u30C8\u306E\u7279\u5225\u306A\u30BB\u30C3\u30B7\u30E7\u30F3\u51E6\u7406\u3092\u8A2D\u5B9A
undertow.setting.crawler-session-management.add=\u30AF\u30ED\u30FC\u30E9\u30FC\u30DC\u30C3\u30C8\u306E\u7279\u5225\u306A\u30BB\u30C3\u30B7\u30E7\u30F3\u51E6\u7406\u3092\u8FFD\u52A0
undertow.setting.crawler-session-management.remove=\u30AF\u30ED\u30FC\u30E9\u30FC\u30DC\u30C3\u30C8\u306E\u7279\u5225\u306A\u30BB\u30C3\u30B7\u30E7\u30F3\u51E6\u7406\u3092\u524A\u9664
undertow.setting.crawler-session-management.user-agents=\u30AF\u30ED\u30FC\u30E9\u30FC\u306E\u30E6\u30FC\u30B6\u30FC\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u3068\u4E00\u81F4\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u6B63\u898F\u8868\u73FE
undertow.setting.crawler-session-management.session-timeout=\u30AF\u30ED\u30FC\u30E9\u30FC\u306B\u3088\u3063\u3066\u6240\u6709\u3055\u308C\u308B\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
undertow.handler.simple-error-page.add=\u7C21\u5358\u306A\u30A8\u30E9\u30FC\u30DA\u30FC\u30B8\u3092\u8FFD\u52A0
undertow.handler.simple-error-page.remove=\u7C21\u5358\u306A\u30A8\u30E9\u30FC\u30DA\u30FC\u30B8\u3092\u524A\u9664
undertow.handler.simple-error-page.name=\u30A8\u30E9\u30FC\u30DA\u30FC\u30B8\u306E\u540D\u524D
undertow.handler.simple-error-page.code=\u30A8\u30E9\u30FC\u30B3\u30FC\u30C9
undertow.handler.file=\u30D5\u30A1\u30A4\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC
undertow.handler.file.add=\u30D5\u30A1\u30A4\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u8FFD\u52A0
undertow.handler.file.remove=\u30D5\u30A1\u30A4\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u524A\u9664
undertow.handler.file.name=\u30D5\u30A1\u30A4\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u540D\u524D
undertow.handler.file.path=\u30D5\u30A1\u30A4\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u304C\u30EA\u30BD\u30FC\u30B9\u306B\u5BFE\u5FDC\u3059\u308B\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u4E0A\u306E\u30D1\u30B9
undertow.handler.file.cache-buffer-size=\u30D0\u30C3\u30D5\u30A1\u30FC\u306E\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8\u5358\u4F4D)
undertow.handler.file.cache-buffers=\u30D0\u30C3\u30D5\u30A1\u30FC\u306E\u6570
undertow.handler.file.directory-listing=\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u306E\u30EA\u30B9\u30C8\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u304B?
undertow.handler.file.follow-symlink=\u6B21\u306E\u30B7\u30F3\u30DC\u30EA\u30C3\u30AF\u30EA\u30F3\u30AF\u3092\u6709\u52B9\u5316
undertow.handler.file.safe-symlink-paths=\u30B7\u30F3\u30DC\u30EA\u30C3\u30AF\u30EA\u30F3\u30AF\u306E\u30BF\u30FC\u30B2\u30C3\u30C8\u3068\u3057\u3066\u5B89\u5168\u306A\u30D1\u30B9
undertow.handler.file.case-sensitive=\u5927\u6587\u5B57\u3068\u5C0F\u6587\u5B57\u3092\u533A\u5225\u3059\u308B\u30D5\u30A1\u30A4\u30EB\u51E6\u7406\u3092\u4F7F\u7528
undertow.handler.reverse-proxy=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u30CF\u30F3\u30C9\u30E9\u30FC
undertow.handler.reverse-proxy.add=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u8FFD\u52A0
undertow.handler.reverse-proxy.remove=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u524A\u9664
undertow.handler.reverse-proxy.problem-server-retry=\u30C0\u30A6\u30F3\u3057\u305F\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u518D\u63A5\u7D9A\u3092\u8A66\u307F\u308B\u524D\u306B\u5F85\u6A5F\u3059\u308B\u6642\u9593 (\u79D2\u5358\u4F4D)\u3002
undertow.handler.reverse-proxy.sticky-session-lifetime=\u30B9\u30C6\u30A3\u30C3\u30AD\u30FC\u30BB\u30C3\u30B7\u30E7\u30F3\u30C7\u30FC\u30BF\u304C\u5B58\u7D9A\u3059\u308B\u6642\u9593 (\u79D2\u5358\u4F4D)\u3002
undertow.handler.reverse-proxy.session-cookie-names=\u30BB\u30C3\u30B7\u30E7\u30F3\u30AF\u30C3\u30AD\u30FC\u540D\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3002\u901A\u5E38 JSESSIONID \u306B\u306A\u308A\u307E\u3059\u3002
undertow.handler.reverse-proxy.max-request-time=\u30D7\u30ED\u30AD\u30B7\u30FC\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u30A2\u30AF\u30C6\u30A3\u30D6\u306A\u72B6\u614B\u3067\u3044\u3089\u308C\u308B\u6700\u5927\u6642\u9593\u3002\u3053\u306E\u6642\u9593\u3092\u904E\u304E\u308B\u3068 kill \u3055\u308C\u307E\u3059\u3002
undertow.handler.reverse-proxy.connections-per-thread=\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9\u30B5\u30FC\u30D0\u30FC\u3067\u7DAD\u6301\u3055\u308C\u308B IO \u30B9\u30EC\u30C3\u30C9\u3054\u3068\u306E\u63A5\u7D9A\u6570\u3002
undertow.handler.reverse-proxy.request-queue-size=503 \u30B3\u30FC\u30C9\u3067\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u62D2\u5426\u3055\u308C\u308B\u524D\u306B\u3001\u63A5\u7D9A\u30D7\u30FC\u30EB\u304C\u6E80\u676F\u3067\u3042\u308B\u5834\u5408\u306B\u30AD\u30E5\u30FC\u306B\u7F6E\u304F\u3053\u3068\u304C\u3067\u304D\u308B\u30EA\u30AF\u30A8\u30B9\u30C8\u6570\u3002
undertow.handler.reverse-proxy.host=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u304C\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u8EE2\u9001\u3059\u308B\u30DB\u30B9\u30C8
undertow.handler.reverse-proxy.host.instance-id=\u30B9\u30C6\u30A3\u30C3\u30AD\u30FC\u30BB\u30C3\u30B7\u30E7\u30F3\u3092\u6709\u52B9\u306B\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9 ID (JVM \u30EB\u30FC\u30C8)\u3002
undertow.handler.reverse-proxy.host.outbound-socket-binding=\u3053\u306E\u30DB\u30B9\u30C8\u306E\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0
undertow.handler.reverse-proxy.host.scheme=\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30AD\u30FC\u30E0\u306E\u7A2E\u985E
undertow.handler.reverse-proxy.host.path=\u30DB\u30B9\u30C8\u304C\u30EB\u30FC\u30C8\u3067\u306A\u3044\u30EA\u30BD\u30FC\u30B9\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30D1\u30B9
undertow.handler.reverse-proxy.cached-connections-per-thread=\u7121\u5236\u9650\u306B\u7DAD\u6301\u3055\u308C\u308B\u63A5\u7D9A\u306E\u6570
undertow.handler.reverse-proxy.connection-idle-timeout=\u9589\u3058\u3089\u308C\u308B\u524D\u306B\u63A5\u7D9A\u304C\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u3067\u3044\u3089\u308C\u308B\u6642\u9593\u3002\u30D7\u30FC\u30EB\u30B5\u30A4\u30BA\u304C\u8A2D\u5B9A\u3055\u308C\u305F\u6700\u5C0F\u5024 (cached-connections-per-thread \u306B\u3088\u3063\u3066\u8A2D\u5B9A) \u307E\u3067\u4E0B\u304C\u308B\u3068\u63A5\u7D9A\u306F\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3057\u307E\u305B\u3093\u3002
undertow.handler.reverse-proxy.host.add=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u30CF\u30F3\u30C9\u30E9\u30FC\u30DB\u30B9\u30C8\u3092\u8FFD\u52A0
undertow.handler.reverse-proxy.host.remove=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u30CF\u30F3\u30C9\u30E9\u30FC\u30DB\u30B9\u30C8\u3092\u524A\u9664
undertow.handler.reverse-proxy.host.security-realm=\u30DB\u30B9\u30C8\u3078\u306E\u63A5\u7D9A\u306E SSL \u8A2D\u5B9A\u3092\u63D0\u4F9B\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u3002
undertow.handler.reverse-proxy.host.ssl-context=\u3053\u306E\u30CF\u30F3\u30C9\u30E9\u30FC\u3067\u4F7F\u7528\u3059\u308B SSLContext \u306E\u53C2\u7167\u3002
undertow.handler.reverse-proxy.host.security-realm.deprecated=\u8A2D\u5B9A\u3055\u308C\u305F SSLContext \u3092\u76F4\u63A5\u53C2\u7167\u3059\u308B ssl-context \u5C5E\u6027\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
undertow.handler.reverse-proxy.host.enable-http2=true \u306E\u5834\u5408\u3001\u30D7\u30ED\u30AD\u30B7\u30FC\u306F HTTP/2 \u3092\u4F7F\u7528\u3057\u3066\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9\u3078\u306E\u63A5\u7D9A\u3092\u8A66\u884C\u3057\u307E\u3059\u3002\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001HTTP/1.1/ \u306B\u30D5\u30A9\u30FC\u30EB\u30D0\u30C3\u30AF\u3057\u307E\u3059\u3002
undertow.handler.reverse-proxy.max-retries=\u5931\u6557\u3059\u308B\u5834\u5408\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u518D\u8A66\u884C\u56DE\u6570\u3002\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u3079\u304D\u7B49\u3068\u307F\u306A\u3055\u308C\u306A\u3044\u5834\u5408\u306F\u3001\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9\u30B5\u30FC\u30D0\u30FC\u306B\u9001\u4FE1\u3055\u308C\u306A\u3044\u3068\u30D7\u30ED\u30AD\u30B7\u304C\u78BA\u4FE1\u3067\u304D\u308B\u5834\u5408\u306B\u306E\u307F\u3001\u518D\u8A66\u884C\u3055\u308C\u307E\u3059\u3002
undertow.filter.basic-auth=Basic \u8A8D\u8A3C\u8A2D\u5B9A
undertow.filter.basic-auth.add=Basic \u8A8D\u8A3C\u306E\u8FFD\u52A0
undertow.filter.basic-auth.remove=Basic \u8A8D\u8A3C\u306E\u524A\u9664
undertow.filter.basic-auth.name=\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u540D\u524D
undertow.filter.basic-auth.security-domain=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3
undertow.filter.connection-limit=\u540C\u6642\u30EA\u30AF\u30A8\u30B9\u30C8\u30EA\u30DF\u30C3\u30BF\u30FC\u30CF\u30F3\u30C9\u30E9\u30FC\u3002request-limit \u30EA\u30BD\u30FC\u30B9\u306E\u5EC3\u6B62\u3055\u308C\u305F\u30EC\u30AC\u30B7\u30FC\u540D\u3002
undertow.filter.connection-limit.add=\u30EA\u30AF\u30A8\u30B9\u30C8\u30EA\u30DF\u30C3\u30BF\u30FC\u306E\u8FFD\u52A0
undertow.filter.connection-limit.remove=\u30EA\u30DF\u30C3\u30BF\u30FC\u3092\u524A\u9664
undertow.filter.connection-limit.name=\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u540D\u524D
undertow.filter.connection-limit.max-concurrent-requests=\u540C\u6642\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6700\u5927\u6570
undertow.filter.connection-limit.queue-size=\u30AD\u30E5\u30FC\u306E\u62D2\u5426\u3092\u958B\u59CB\u3059\u308B\u524D\u306B\u30AD\u30E5\u30FC\u306B\u7F6E\u304F\u30EA\u30AF\u30A8\u30B9\u30C8\u6570
undertow.filter.request-limit=\u540C\u6642\u30EA\u30AF\u30A8\u30B9\u30C8\u30EA\u30DF\u30C3\u30BF\u30FC\u30CF\u30F3\u30C9\u30E9\u30FC
undertow.filter.request-limit.add=\u30EA\u30AF\u30A8\u30B9\u30C8\u30EA\u30DF\u30C3\u30BF\u30FC\u306E\u8FFD\u52A0
undertow.filter.request-limit.remove=\u30EA\u30DF\u30C3\u30BF\u30FC\u306E\u524A\u9664
undertow.filter.request-limit.name=\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u540D\u524D
undertow.filter.request-limit.max-concurrent-requests=\u540C\u6642\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6700\u5927\u6570
undertow.filter.request-limit.queue-size=\u30AD\u30E5\u30FC\u306E\u62D2\u5426\u3092\u958B\u59CB\u3059\u308B\u524D\u306B\u30AD\u30E5\u30FC\u306B\u7F6E\u304F\u30EA\u30AF\u30A8\u30B9\u30C8\u6570
undertow.filter.response-header=\u5FDC\u7B54\u30D8\u30C3\u30C0\u30FC\u30D5\u30A3\u30EB\u30BF\u30FC\u3092\u4F7F\u7528\u3059\u308B\u3068\u30AB\u30B9\u30BF\u30E0\u30D8\u30C3\u30C0\u30FC\u3092\u8FFD\u52A0\u3067\u304D\u307E\u3059\u3002
undertow.filter.response-header.add=\u30D5\u30A3\u30EB\u30BF\u30FC\u3092\u8FFD\u52A0
undertow.filter.response-header.remove=\u30D5\u30A3\u30EB\u30BF\u30FC\u3092\u524A\u9664
undertow.filter.response-header.name=\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u540D\u524D
undertow.filter.response-header.header-name=\u30D8\u30C3\u30C0\u30FC\u540D
undertow.filter.response-header.header-value=\u30D8\u30C3\u30C0\u30FC\u306E\u5024
undertow.filter.gzip=gzip \u30D5\u30A3\u30EB\u30BF\u30FC\u3092\u5B9A\u7FA9
undertow.filter.gzip.add=\u30D5\u30A3\u30EB\u30BF\u30FC\u3092\u8FFD\u52A0
undertow.filter.gzip.remove=\u30D5\u30A3\u30EB\u30BF\u30FC\u3092\u524A\u9664
undertow.filter.gzip.name=\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u540D\u524D
undertow.filter.error-page=\u30A8\u30E9\u30FC\u30DA\u30FC\u30B8
undertow.filter.error-page.add=\u30A8\u30E9\u30FC\u30DA\u30FC\u30B8\u3092\u8FFD\u52A0
undertow.filter.error-page.remove=\u30A8\u30E9\u30FC\u30DA\u30FC\u30B8\u3092\u524A\u9664
undertow.filter.error-page.name=\u30A8\u30E9\u30FC\u30DA\u30FC\u30B8\u306E\u540D\u524D
undertow.filter.error-page.code=\u30A8\u30E9\u30FC\u30DA\u30FC\u30B8\u30B3\u30FC\u30C9
undertow.filter.error-page.path=\u30A8\u30E9\u30FC\u30DA\u30FC\u30B8\u306E\u30D1\u30B9
undertow.filter.custom-filter=\u30AB\u30B9\u30BF\u30E0\u30D5\u30A3\u30EB\u30BF\u30FC
undertow.filter.custom-filter.add=\u30AB\u30B9\u30BF\u30E0\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u8FFD\u52A0
undertow.filter.custom-filter.remove=\u30AB\u30B9\u30BF\u30E0\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u524A\u9664
undertow.filter.custom-filter.class-name=HttpHandler \u306E\u30AF\u30E9\u30B9\u540D
undertow.filter.custom-filter.module=\u30AF\u30E9\u30B9\u3092\u30ED\u30FC\u30C9\u3067\u304D\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u540D
undertow.filter.custom-filter.parameters=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3092\u30D5\u30A3\u30EB\u30BF\u30FC
undertow.filter.expression-filter=Undertow \u5F0F\u8A00\u8A9E\u304B\u3089\u89E3\u6790\u3055\u308C\u305F\u30D5\u30A3\u30EB\u30BF\u30FC
undertow.filter.expression-filter.add=Undertow \u5F0F\u8A00\u8A9E\u304B\u3089\u89E3\u6790\u3055\u308C\u305F\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u8FFD\u52A0
undertow.filter.expression-filter.remove=\u5F0F\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u524A\u9664
undertow.filter.expression-filter.expression=\u30D5\u30A3\u30EB\u30BF\u30FC\u3092\u5B9A\u7FA9\u3059\u308B\u5F0F
undertow.filter.expression-filter.module=\u30D5\u30A3\u30EB\u30BF\u30FC\u5B9A\u7FA9\u3092\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3059\u308B\u30E2\u30B8\u30E5\u30FC\u30EB
undertow.filter.rewrite=\u518D\u66F8\u304D\u8FBC\u307F (\u307E\u305F\u306F\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8) \u30D5\u30A3\u30EB\u30BF\u30FC
undertow.filter.rewrite.add=\u518D\u66F8\u304D\u8FBC\u307F\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u8FFD\u52A0
undertow.filter.rewrite.remove=\u518D\u66F8\u304D\u8FBC\u307F\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u524A\u9664
undertow.filter.rewrite.target=\u30BF\u30FC\u30B2\u30C3\u30C8\u3092\u5B9A\u7FA9\u3059\u308B\u5F0F\u3002\u5B9A\u6570\u30BF\u30FC\u30B2\u30C3\u30C8\u3078\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u3059\u308B\u5834\u5408\u306F\u5024\u3092\u5358\u4E00\u5F15\u7528\u7B26\u3067\u56F2\u307F\u307E\u3059
undertow.filter.rewrite.redirect=true \u306E\u5834\u5408\u3001\u518D\u66F8\u304D\u8FBC\u307F\u306E\u4EE3\u308F\u308A\u306B\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u304C\u884C\u308F\u308C\u307E\u3059
undertow.host.location=\u5834\u6240\u30EA\u30BD\u30FC\u30B9\u306E\u8A2D\u5B9A\u3092\u4FDD\u6301
undertow.host.location.add=\u65B0\u3057\u3044\u5834\u6240\u306E\u8FFD\u52A0
undertow.host.location.remove=\u3053\u306E\u5834\u6240\u306E\u524A\u9664
undertow.host.location.name=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30D1\u30B9\u3068\u3057\u3066\u52D5\u4F5C\u3059\u308B\u5834\u6240\u540D
undertow.host.location.handler=\u3053\u306E\u5834\u6240\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u30CF\u30F3\u30C9\u30E9\u30FC
undertow.host.location.filter-ref=\u30D5\u30A3\u30EB\u30BF\u30FC\u3078\u306E\u53C2\u7167
undertow.host.filter-ref=\u30D5\u30A3\u30EB\u30BF\u30FC\u3078\u306E\u53C2\u7167
undertow.filter-ref=\u30D5\u30A3\u30EB\u30BF\u30FC\u3078\u306E\u53C2\u7167
undertow.filter-ref.add=\u65B0\u3057\u3044\u53C2\u7167\u306E\u8FFD\u52A0
undertow.filter-ref.remove=\u9078\u629E\u3057\u305F\u53C2\u7167\u306E\u524A\u9664
undertow.filter-ref.name=\u53C2\u7167\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC
undertow.filter-ref.predicate=\u8FF0\u8A9E\u306F\u4EA4\u63DB\u3092\u57FA\u306B true \u3068 false \u306E\u6C7A\u5B9A\u3092\u884C\u3046\u7C21\u5358\u306A\u65B9\u6CD5\u3092\u63D0\u4F9B\u3057\u307E\u3059\u3002\u591A\u304F\u306E\u30CF\u30F3\u30C9\u30E9\u30FC\u306B\u306F\u6761\u4EF6\u7684\u306B\u9069\u7528\u3059\u308B\u8981\u4EF6\u304C\u3042\u308A\u3001\u8FF0\u8A9E\u306F\u6761\u4EF6\u3092\u6307\u5B9A\u3059\u308B\u4E00\u822C\u7684\u306A\u65B9\u6CD5\u3092\u63D0\u4F9B\u3057\u307E\u3059\u3002
undertow.filter-ref.priority=\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u9806\u756A\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u30021 \u4EE5\u4E0A\u3092\u8A2D\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u6570\u5B57\u304C\u5927\u304D\u3044\u307B\u3069\u540C\u3058\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306E\u4ED6\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3088\u308A\u3082\u5148\u306B\u30CF\u30F3\u30C9\u30E9\u30FC\u30C1\u30A7\u30FC\u30F3\u306B\u542B\u307E\u308C\u308B\u3088\u3046\u3001\u30B5\u30FC\u30D0\u30FC\u304C\u6307\u793A\u3055\u308C\u307E\u3059\u3002
undertow.application-security-domain=\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u305F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u53C2\u7167\u304B\u3089\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u3002
undertow.application-security-domain.add=\u65B0\u3057\u3044\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u53C2\u7167\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u30DE\u30C3\u30D4\u30F3\u30B0\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
undertow.application-security-domain.remove=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u53C2\u7167\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u30DE\u30C3\u30D4\u30F3\u30B0\u3092\u524A\u9664\u3057\u307E\u3059\u3002
undertow.application-security-domain.http-authentication-factory=\u30DE\u30C3\u30D7\u3055\u308C\u305F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u3092\u53C2\u7167\u3059\u308B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3067\u4F7F\u7528\u3055\u308C\u308B HTTP \u8A8D\u8A3C\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3002
undertow.application-security-domain.override-deployment-config=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u8A8D\u8A3C\u8A2D\u5B9A\u3092\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306B\u3088\u308A\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u3059\u308B\u5834\u5408\u3002
undertow.application-security-domain.enable-jacc=JACC \u3092\u4F7F\u7528\u3057\u305F\u627F\u8A8D\u306E\u6709\u52B9\u5316
undertow.application-security-domain.referencing-deployments=\u3053\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u3092\u73FE\u5728\u53C2\u7167\u3057\u3066\u3044\u308B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3002
undertow.application-security-domain.setting=\u8A2D\u5B9A
undertow.deployment=\u3053\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E web \u30B3\u30F3\u30C6\u30CA\u30FC\u51E6\u7406\u306B\u95A2\u3059\u308B\u60C5\u5831
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.deployment.context-root=Web \u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30EB\u30FC\u30C8
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.deployment.virtual-host=Web \u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u30B5\u30FC\u30D3\u30B9\u3092\u63D0\u4F9B\u3059\u308B\u4EEE\u60F3\u30DB\u30B9\u30C8\u540D
undertow.deployment.server=\u3053\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u5C5E\u3059\u308B\u30B5\u30FC\u30D0\u30FC\u306E\u540D\u524D
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.deployment.active-sessions=\u30A2\u30AF\u30C6\u30A3\u30D6\u306A\u30BB\u30C3\u30B7\u30E7\u30F3\u6570
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.deployment.expired-sessions=\u6709\u52B9\u671F\u9650\u304C\u5207\u308C\u305F\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6570
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.deployment.rejected-sessions=\u62D2\u5426\u3055\u308C\u305F\u30BB\u30C3\u30B7\u30E7\u30F3\u6570
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.deployment.max-active-sessions=\u3053\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u30DE\u30CD\u30B8\u30E3\u30FC\u304C\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u3001\u540C\u6642\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6700\u5927\u6570
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.deployment.sessions-created=\u4F5C\u6210\u3057\u305F\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u7DCF\u6570
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.deployment.duplicated-session-ids=\u4EFB\u610F\u30BD\u30FC\u30B9\u306B\u3088\u308A\u751F\u6210\u3055\u308C\u305F\u91CD\u8907\u30BB\u30C3\u30B7\u30E7\u30F3 ID \u6570 (0 \u3088\u308A\u3082\u6570\u5024\u304C\u5927\u304D\u3044\u5834\u5408\u306F\u554F\u984C\u3042\u308A)
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.deployment.session-avg-alive-time=\u671F\u9650\u5207\u308C\u30BB\u30C3\u30B7\u30E7\u30F3\u304C\u751F\u5B58\u3059\u308B\u5E73\u5747\u6642\u9593 (\u79D2)
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Yamamoto Mie
undertow.deployment.session-max-alive-time=\u671F\u9650\u5207\u308C\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u304C\u751F\u5B58\u3059\u308B\u6700\u9577\u6642\u9593 (\u79D2)
undertow.deployment.servlet=\u3053\u306E\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u306E\u72B6\u614B\u304A\u3088\u3073\u8A2D\u5B9A\u306B\u95A2\u3059\u308B\u60C5\u5831
undertow.deployment.servlet.servlet-name=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u306E\u540D\u524D
undertow.deployment.servlet.servlet-class=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u306E\u30AF\u30E9\u30B9
undertow.deployment.servlet.min-request-time=\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u51E6\u7406\u3059\u308B\u6700\u5C0F\u9650\u306E\u6642\u9593
undertow.deployment.servlet.max-request-time=\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u51E6\u7406\u3059\u308B\u6700\u5927\u9650\u306E\u6642\u9593
undertow.deployment.servlet.total-request-time=\u3059\u3079\u3066\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u51E6\u7406\u306B\u8CBB\u3084\u3055\u308C\u305F\u6642\u9593\u306E\u5408\u8A08
undertow.deployment.servlet.request-count=\u3059\u3079\u3066\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6570
undertow.deployment.servlet.mappings=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u30DE\u30C3\u30D4\u30F3\u30B0
undertow.deployment.websocket=\u3053\u306E web \u30BD\u30B1\u30C3\u30C8\u306E\u72B6\u614B\u304A\u3088\u3073\u8A2D\u5B9A\u306B\u95A2\u3059\u308B\u60C5\u5831
undertow.deployment.websocket.endpoint-class=\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u30AF\u30E9\u30B9
undertow.deployment.websocket.path=\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306E\u30C7\u30D7\u30ED\u30A4\u5148\u3092\u793A\u3059\u30D1\u30B9
undertow.deployment.invalidate-session=\u6307\u5B9A\u30BB\u30C3\u30B7\u30E7\u30F3\u3092\u7121\u52B9\u306B\u3057\u307E\u3059
undertow.deployment.invalidate-session.session-id=\u7121\u52B9\u306B\u3059\u308B\u30BB\u30C3\u30B7\u30E7\u30F3 ID
undertow.filter.mod-cluster=mod-cluster \u30D5\u30ED\u30F3\u30C8\u30A8\u30F3\u30C9\u30ED\u30FC\u30C9\u30D0\u30E9\u30F3\u30B5\u30FC
undertow.handler.mod-cluster=mod-cluster \u30D5\u30ED\u30F3\u30C8\u30A8\u30F3\u30C9\u30ED\u30FC\u30C9\u30D0\u30E9\u30F3\u30B5\u30FC
undertow.handler.mod-cluster.add=\u30D5\u30ED\u30F3\u30C8\u30A8\u30F3\u30C9 mod-proxy \u30ED\u30FC\u30C9\u30D0\u30E9\u30F3\u30B5\u30FC\u3092\u8FFD\u52A0
undertow.handler.mod-cluster.remove=mod cluster \u30D7\u30ED\u30AD\u30B7\u30FC\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u524A\u9664
undertow.handler.mod-cluster.management-socket-binding=mod_cluster \u7BA1\u7406\u30A2\u30C9\u30EC\u30B9\u304A\u3088\u3073\u30DD\u30FC\u30C8\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3002mod_cluster \u3092\u4F7F\u7528\u3059\u308B\u969B\u306F\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u51E6\u7406\u3059\u308B\u30D1\u30D6\u30EA\u30C3\u30AF\u30EA\u30B9\u30CA\u30FC\u3092 1 \u3064\u3001\u5185\u90E8\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u306B\u30D0\u30A4\u30F3\u30C9\u3055\u308C mod cluster \u30B3\u30DE\u30F3\u30C9\u3092\u51E6\u7406\u3059\u308B \u30EA\u30B9\u30CA\u30FC\u3092 1 \u3064\u3001\u5408\u8A08 2 \u3064\u306E HTTP \u30EA\u30B9\u30CA\u30FC\u3092\u5B9A\u7FA9\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306F\u5185\u90E8\u30EA\u30B9\u30CA\u30FC\u3068\u5BFE\u5FDC\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u3001\u516C\u7684\u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u3044\u3088\u3046\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
undertow.handler.mod-cluster.advertise-socket-binding=\u30A2\u30C9\u30D0\u30BF\u30A4\u30BA\u306B\u4F7F\u7528\u3055\u308C\u308B\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u304A\u3088\u3073\u30DD\u30FC\u30C8
undertow.handler.mod-cluster.security-key=mod-cluster \u30B0\u30EB\u30FC\u30D7\u306B\u4F7F\u7528\u3055\u308C\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30AD\u30FC\u3002\u3059\u3079\u3066\u306E\u30E1\u30F3\u30D0\u30FC\u304C\u540C\u3058\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30AD\u30FC\u3092\u4F7F\u7528\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
undertow.handler.mod-cluster.advertise-protocol=\u4F7F\u7528\u4E2D\u306E\u30D7\u30ED\u30C8\u30B3\u30EB\u3002
undertow.handler.mod-cluster.advertise-path=mod-cluster \u306E\u767B\u9332\u5148\u306E\u30D1\u30B9\u3002
undertow.handler.mod-cluster.advertise-frequency=mod-cluster \u304C\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u4E0A\u3067\u81EA\u8EAB\u3092\u30A2\u30C9\u30D0\u30BF\u30A4\u30BA\u3059\u308B\u983B\u5EA6 (\u30DF\u30EA\u79D2\u5358\u4F4D)
undertow.handler.mod-cluster.failover-strategy=\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u30A2\u30D5\u30A3\u30CB\u30C6\u30A3\u30FC\u304C\u3042\u308B\u30CE\u30FC\u30C9\u304C\u5229\u7528\u53EF\u80FD\u3067\u306A\u3044\u5834\u5408\u306B\u3001\u30D5\u30A7\u30A4\u30EB\u30AA\u30FC\u30D0\u30FC\u30CE\u30FC\u30C9\u3092\u9078\u629E\u3059\u308B\u65B9\u6CD5\u3092\u5224\u65AD\u3057\u307E\u3059
undertow.handler.mod-cluster.health-check-interval=\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9\u30CE\u30FC\u30C9\u3078\u306E\u30D8\u30EB\u30B9\u30C1\u30A7\u30C3\u30AF ping \u306E\u983B\u5EA6
undertow.handler.mod-cluster.broken-node-timeout=\u7834\u640D\u3057\u305F\u30CE\u30FC\u30C9\u304C\u30C6\u30FC\u30D6\u30EB\u304B\u3089\u524A\u9664\u3055\u308C\u308B\u524D\u306B\u7D4C\u904E\u3057\u306A\u3051\u308C\u3070\u306A\u3089\u306A\u3044\u6642\u9593
undertow.handler.mod-cluster.max-request-time=\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9\u30CE\u30FC\u30C9\u3078\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u304C kill \u3055\u308C\u308B\u524D\u306B\u8CBB\u3084\u3059\u3053\u3068\u304C\u3067\u304D\u308B\u6700\u5927\u6642\u9593
undertow.handler.mod-cluster.management-access-predicate=mod cluster \u7BA1\u7406\u30B3\u30DE\u30F3\u30C9\u3092\u5B9F\u884C\u3067\u304D\u308B\u304B\u3069\u3046\u304B\u3092\u5224\u65AD\u3059\u308B\u305F\u3081\u306B\u53D7\u4FE1\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u9069\u7528\u3055\u308C\u308B\u8FF0\u8A9E\u3002management-socket-binding \u304B\u3089\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u7BA1\u7406\u3092\u5236\u9650\u3059\u308B\u3053\u3068\u3067\u5B9F\u73FE\u3055\u308C\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u306B\u52A0\u3048\u3001\u3055\u3089\u306A\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u3092\u63D0\u4F9B\u3057\u307E\u3059\u3002
undertow.handler.mod-cluster.session-cookie-names=\u30BB\u30C3\u30B7\u30E7\u30F3\u30AF\u30C3\u30AD\u30FC\u540D\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3002\u901A\u5E38\u306F JSESSIONID \u306B\u306A\u308A\u307E\u3059\u3002
undertow.handler.mod-cluster.connections-per-thread=\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9\u30B5\u30FC\u30D0\u30FC\u3067\u7DAD\u6301\u3055\u308C\u308B IO \u30B9\u30EC\u30C3\u30C9\u3054\u3068\u306E\u63A5\u7D9A\u6570\u3002
undertow.handler.mod-cluster.request-queue-size=503 \u30B3\u30FC\u30C9\u3067\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u62D2\u5426\u3055\u308C\u308B\u524D\u306B\u3001\u63A5\u7D9A\u30D7\u30FC\u30EB\u304C\u6E80\u676F\u3067\u3042\u308B\u5834\u5408\u306B\u30AD\u30E5\u30FC\u306B\u7F6E\u304F\u3053\u3068\u304C\u3067\u304D\u308B\u30EA\u30AF\u30A8\u30B9\u30C8\u6570\u3002
undertow.handler.mod-cluster.cached-connections-per-thread=\u7121\u5236\u9650\u306B\u7DAD\u6301\u3055\u308C\u308B\u63A5\u7D9A\u306E\u6570
undertow.handler.mod-cluster.connection-idle-timeout=\u9589\u3058\u3089\u308C\u308B\u524D\u306B\u63A5\u7D9A\u304C\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u3067\u3044\u3089\u308C\u308B\u6642\u9593\u3002\u30D7\u30FC\u30EB\u30B5\u30A4\u30BA\u304C\u8A2D\u5B9A\u3055\u308C\u305F\u6700\u5C0F\u5024 (cached-connections-per-thread \u306B\u3088\u3063\u3066\u8A2D\u5B9A) \u307E\u3067\u4E0B\u304C\u308B\u3068\u63A5\u7D9A\u306F\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3057\u307E\u305B\u3093\u3002
undertow.handler.mod-cluster.worker=\u30A2\u30C9\u30D0\u30BF\u30A4\u30BA\u306E\u901A\u77E5\u3092\u9001\u4FE1\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B XNIO \u30EF\u30FC\u30AB\u30FC
undertow.handler.mod-cluster.ssl-context=\u3053\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306B\u3088\u308A\u4F7F\u7528\u3055\u308C\u308B SSLContext \u3092\u53C2\u7167\u3057\u307E\u3059\u3002
undertow.handler.mod-cluster.security-realm=SSL \u8A2D\u5B9A\u3092\u63D0\u4F9B\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0
undertow.handler.mod-cluster.security-realm.deprecated=\u8A2D\u5B9A\u3055\u308C\u305F SSLContext \u3092\u76F4\u63A5\u53C2\u7167\u3059\u308B ssl-context \u5C5E\u6027\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
undertow.handler.mod-cluster.use-alias=\u30A8\u30A4\u30EA\u30A2\u30B9\u30C1\u30A7\u30C3\u30AF\u304C\u5B9F\u884C\u3055\u308C\u308B\u304B\u3069\u3046\u304B
undertow.handler.mod-cluster.enable-http2=\u30ED\u30FC\u30C9\u30D0\u30E9\u30F3\u30B5\u30FC\u304C\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9\u63A5\u7D9A\u306E HTTP2 \u3078\u306E\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u3092\u8A66\u884C\u3059\u3079\u304D\u3067\u3042\u308B\u304B\u3002HTTP2 \u304C\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u306A\u3044\u5834\u5408\u306F\u901A\u5E38\u3069\u304A\u308A HTTP \u307E\u305F\u306F HTTPS \u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
undertow.handler.mod-cluster.max-ajp-packet-size=AJP \u30D1\u30B1\u30C3\u30C8\u306E\u6700\u5927\u30B5\u30A4\u30BA\u3002\u3053\u306E\u5024\u3092\u5927\u304D\u304F\u3059\u308B\u3068\u3001AJP \u306F\u30D8\u30C3\u30C0\u30FC\u306E\u91CF\u304C\u591A\u3044\u30EA\u30AF\u30A8\u30B9\u30C8\u304A\u3088\u3073\u5FDC\u7B54\u306B\u5BFE\u5FDC\u3067\u304D\u307E\u3059\u3002\u3053\u308C\u306F\u4E0A\u7D1A\u30AA\u30D7\u30B7\u30E7\u30F3\u3067\u3001\u30ED\u30FC\u30C9\u30D0\u30E9\u30F3\u30B5\u30FC\u3068\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9\u30B5\u30FC\u30D0\u30FC\u3067\u540C\u3058\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
undertow.handler.mod-cluster.http2-enable-push=HTTP/2 \u63A5\u7D9A\u306B\u5BFE\u3057\u3066\u30D7\u30C3\u30B7\u30E5\u3092\u6709\u52B9\u306B\u3059\u308B\u3079\u304D\u304B\u3069\u3046\u304B
undertow.handler.mod-cluster.http2-max-frame-size=\u6700\u5927 HTTP/2 \u30D5\u30EC\u30FC\u30E0\u30B5\u30A4\u30BA
undertow.handler.mod-cluster.http2-max-concurrent-streams=\u5358\u4E00\u306E\u63A5\u7D9A\u3067\u30A2\u30AF\u30C6\u30A3\u30D6\u306A\u72B6\u614B\u3067\u3044\u3089\u308C\u308B HTTP/2 \u30B9\u30C8\u30EA\u30FC\u30E0\u306E\u6700\u5927\u6570
undertow.handler.mod-cluster.http2-max-header-list-size=\u30B5\u30FC\u30D0\u30FC\u304C\u8A31\u53EF\u3059\u308B\u6E96\u5099\u304C\u3067\u304D\u3066\u3044\u308B\u30EA\u30AF\u30A8\u30B9\u30C8\u30D8\u30C3\u30C0\u30FC\u306E\u6700\u5927\u30B5\u30A4\u30BA
undertow.handler.mod-cluster.http2-initial-window-size=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u30C7\u30FC\u30BF\u3092\u30B5\u30FC\u30D0\u30FC\u306B\u9001\u4FE1\u3059\u308B\u901F\u5EA6\u3092\u5236\u5FA1\u3059\u308B\u30D5\u30ED\u30FC\u5236\u5FA1\u30A6\u30A4\u30F3\u30C9\u30A6\u30B5\u30A4\u30BA
undertow.handler.mod-cluster.http2-header-table-size=HPACK \u5727\u7E2E\u3067\u4F7F\u7528\u3055\u308C\u308B\u30D8\u30C3\u30C0\u30FC\u30C6\u30FC\u30D6\u30EB\u306E\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8\u5358\u4F4D)\u3002\u3053\u306E\u30E1\u30E2\u30EA\u30FC\u91CF\u304C\u63A5\u7D9A\u3054\u3068\u306B\u5727\u7E2E\u7528\u306B\u5272\u308A\u5F53\u3066\u3089\u308C\u307E\u3059\u3002\u3088\u308A\u5927\u304D\u306A\u5024\u306F\u3088\u308A\u591A\u304F\u306E\u30E1\u30E2\u30EA\u30FC\u3092\u4F7F\u7528\u3057\u307E\u3059\u304C\u3001\u5727\u7E2E\u304C\u5411\u4E0A\u3055\u308C\u307E\u3059\u3002
undertow.handler.mod-cluster.balancer=mod_cluster \u30D0\u30E9\u30F3\u30B5\u30FC\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u8868\u73FE
undertow.handler.mod-cluster.balancer.sticky-session-path=\u30B9\u30C6\u30A3\u30C3\u30AD\u30FC\u30BB\u30C3\u30B7\u30E7\u30F3\u30AF\u30C3\u30AD\u30FC\u306E\u30D1\u30B9
undertow.handler.mod-cluster.balancer.sticky-session=\u30B9\u30C6\u30A3\u30C3\u30AD\u30FC\u30BB\u30C3\u30B7\u30E7\u30F3\u304C\u6709\u52B9\u3067\u3042\u308B\u304B\u3069\u3046\u304B
undertow.handler.mod-cluster.balancer.sticky-session-cookie=\u30BB\u30C3\u30B7\u30E7\u30F3\u30AF\u30C3\u30AD\u30FC\u540D
undertow.handler.mod-cluster.balancer.sticky-session-force=true \u306E\u5834\u5408\u306F\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u30B9\u30C6\u30A3\u30C3\u30AD\u30FC\u30CE\u30FC\u30C9\u3078\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u3067\u304D\u306A\u3044\u3068\u30A8\u30E9\u30FC\u304C\u8FD4\u3055\u308C\u307E\u3059\u3002\u305D\u306E\u4ED6\u306E\u5834\u5408\u306F\u5225\u306E\u30CE\u30FC\u30C9\u306B\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u3055\u308C\u307E\u3059\u3002
undertow.handler.mod-cluster.balancer.sticky-session-remove=\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u6B63\u3057\u3044\u30DB\u30B9\u30C8\u3078\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u3067\u304D\u306A\u3044\u5834\u5408\u306F\u30BB\u30C3\u30B7\u30E7\u30F3\u30AF\u30C3\u30AD\u30FC\u3092\u524A\u9664\u3057\u307E\u3059
undertow.handler.mod-cluster.balancer.max-attempts=\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9\u30B5\u30FC\u30D0\u30FC\u3078\u9001\u4FE1\u3059\u308B\u8A66\u884C\u56DE\u6570
undertow.handler.mod-cluster.balancer.wait-worker=\u5229\u7528\u53EF\u80FD\u306A\u30B5\u30FC\u30D0\u30FC\u3092\u5F85\u3064\u79D2\u6570
undertow.handler.mod-cluster.max-retries=\u5931\u6557\u3059\u308B\u5834\u5408\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u518D\u8A66\u884C\u56DE\u6570\u3002\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u3079\u304D\u7B49\u3068\u307F\u306A\u3055\u308C\u306A\u3044\u5834\u5408\u306F\u3001\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9\u30B5\u30FC\u30D0\u30FC\u306B\u9001\u4FE1\u3055\u308C\u306A\u3044\u3068\u30D7\u30ED\u30AD\u30B7\u304C\u78BA\u4FE1\u3067\u304D\u308B\u5834\u5408\u306B\u306E\u307F\u3001\u518D\u8A66\u884C\u3055\u308C\u307E\u3059\u3002
undertow.handler.mod-cluster.balancer.node=mod_cluster \u30CE\u30FC\u30C9\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u8868\u73FE
undertow.handler.mod-cluster.balancer.node.context=mod_cluster \u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u8868\u73FE
undertow.handler.mod-cluster.balancer.node.context.requests=\u3053\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306B\u5BFE\u3059\u308B\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6570
undertow.handler.mod-cluster.balancer.node.context.status=\u3053\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306E\u72B6\u614B
undertow.handler.mod-cluster.balancer.node.load=\u3053\u306E\u30CE\u30FC\u30C9\u306E\u73FE\u5728\u306E\u8CA0\u8377
undertow.handler.mod-cluster.balancer.node.elected=\u9078\u629E\u3055\u308C\u305F\u56DE\u6570
undertow.handler.mod-cluster.balancer.node.status=\u3053\u306E\u30CE\u30FC\u30C9\u306E\u73FE\u5728\u306E\u72B6\u614B
undertow.handler.mod-cluster.balancer.node.disable=\u3053\u306E\u30CE\u30FC\u30C9\u306E\u3059\u3079\u3066\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3092\u7121\u52B9\u5316
undertow.handler.mod-cluster.balancer.node.enable=\u3053\u306E\u30CE\u30FC\u30C9\u306E\u3059\u3079\u3066\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3092\u6709\u52B9\u5316
undertow.handler.mod-cluster.balancer.node.stop=\u3053\u306E\u30CE\u30FC\u30C9\u306E\u3059\u3079\u3066\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3092\u505C\u6B62
undertow.handler.mod-cluster.balancer.node.uri=\u30CE\u30FC\u30C9\u306B\u63A5\u7D9A\u3059\u308B\u305F\u3081\u306B\u30ED\u30FC\u30C9\u30D0\u30E9\u30F3\u30B5\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B URI
undertow.handler.mod-cluster.balancer.node.aliases=\u30CE\u30FC\u30C9\u306E\u30A8\u30A4\u30EA\u30A2\u30B9
undertow.handler.mod-cluster.balancer.node.context.disable=\u3053\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3092\u7121\u52B9\u5316
undertow.handler.mod-cluster.balancer.node.context.enable=\u3053\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3092\u6709\u52B9\u5316
undertow.handler.mod-cluster.balancer.node.context.stop=\u3053\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3092\u505C\u6B62
undertow.handler.mod-cluster.balancer.node.load-balancing-group=\u3053\u306E\u30CE\u30FC\u30C9\u304C\u5C5E\u3059\u308B\u30ED\u30FC\u30C9\u30D0\u30E9\u30F3\u30B7\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7
undertow.handler.mod-cluster.balancer.node.cache-connections=\u7121\u5236\u9650\u306B\u7DAD\u6301\u3055\u308C\u308B\u63A5\u7D9A\u306E\u6570
undertow.handler.mod-cluster.balancer.node.max-connections=IO \u30B9\u30EC\u30C3\u30C9\u3054\u3068\u306E\u6700\u5927\u63A5\u7D9A\u6570
undertow.handler.mod-cluster.balancer.node.open-connections=\u73FE\u5728\u958B\u304B\u308C\u305F\u63A5\u7D9A\u306E\u6570
undertow.handler.mod-cluster.balancer.node.ping=\u30CE\u30FC\u30C9\u306E ping
undertow.handler.mod-cluster.balancer.node.read=\u30CE\u30FC\u30C9\u304B\u3089\u8AAD\u307F\u53D6\u308B\u30D0\u30A4\u30C8\u6570
undertow.handler.mod-cluster.balancer.node.timeout=\u30EA\u30AF\u30A8\u30B9\u30C8\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
undertow.handler.mod-cluster.balancer.node.written=\u30CE\u30FC\u30C9\u3078\u8EE2\u9001\u3055\u308C\u305F\u30D0\u30A4\u30C8\u6570
undertow.handler.mod-cluster.balancer.node.ttl=\u63A5\u7D9A\u6570\u304C cache-connections \u3088\u308A\u3082\u591A\u3044\u5834\u5408\u3001\u9589\u3058\u3089\u308C\u308B\u524D\u306B\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u306A\u304F\u3066\u3082\u63A5\u7D9A\u304C\u7DAD\u6301\u3055\u308C\u308B\u6642\u9593
undertow.handler.mod-cluster.balancer.node.flush-packets=\u53D7\u4FE1\u3055\u308C\u305F\u30C7\u30FC\u30BF\u304C\u5373\u5EA7\u306B\u30D5\u30E9\u30C3\u30B7\u30E5\u3055\u308C\u308B\u3079\u304D\u304B\u3069\u3046\u304B
undertow.handler.mod-cluster.balancer.node.queue-new-requests=\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u53D7\u4FE1\u3055\u308C\u3001\u5373\u5EA7\u306B\u5229\u7528\u3067\u304D\u308B\u30EF\u30FC\u30AB\u30FC\u304C\u306A\u3044\u5834\u5408\u306B\u30AD\u30E5\u30FC\u306B\u7F6E\u304F\u304B\u3069\u3046\u304B
undertow.handler.mod-cluster.balancer.node.request-queue-size=\u30EA\u30AF\u30A8\u30B9\u30C8\u30AD\u30E5\u30FC\u306E\u30B5\u30A4\u30BA
undertow.handler.mod-cluster.balancer.load-balancing-group=\u30ED\u30FC\u30C9\u30D0\u30E9\u30F3\u30B7\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7
undertow.handler.mod-cluster.balancer.load-balancing-group.enable-nodes=\u30ED\u30FC\u30C9\u30D0\u30E9\u30F3\u30B7\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306E\u3059\u3079\u3066\u306E\u30CE\u30FC\u30C9\u3092\u6709\u52B9\u5316
undertow.handler.mod-cluster.balancer.load-balancing-group.disable-nodes=\u30ED\u30FC\u30C9\u30D0\u30E9\u30F3\u30B7\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306E\u3059\u3079\u3066\u306E\u30CE\u30FC\u30C9\u3092\u7121\u52B9\u5316
undertow.handler.mod-cluster.balancer.load-balancing-group.stop-nodes=\u30ED\u30FC\u30C9\u30D0\u30E9\u30F3\u30B7\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306E\u3059\u3079\u3066\u306E\u30CE\u30FC\u30C9\u3092\u505C\u6B62
undertow.http-invoker=EJB \u3084\u30CD\u30FC\u30DF\u30F3\u30B0\u306A\u3069\u3001\u30B5\u30FC\u30D3\u30B9\u306E\u30EA\u30E2\u30FC\u30C8 HTTP \u30D9\u30FC\u30B9\u306E\u547C\u3073\u51FA\u3057\u3092\u8A31\u53EF\u3059\u308B HTTP \u30A4\u30F3\u30DC\u30FC\u30AB\u30FC \u30B5\u30FC\u30D3\u30B9
undertow.http-invoker.add=HTTP \u30A4\u30F3\u30DC\u30FC\u30AB\u30FC\u3092 \u30DB\u30B9\u30C8\u306B\u8FFD\u52A0\u3057\u307E\u3059
undertow.http-invoker.remove=HTTP \u30A4\u30F3\u30DC\u30FC\u30AB\u30FC\u30B5\u30FC\u30D3\u30B9\u3092\u524A\u9664\u3057\u307E\u3059
undertow.http-invoker.path=\u30B5\u30FC\u30D3\u30B9\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u308B\u30D1\u30B9
undertow.http-invoker.http-authentication-factory=\u8A8D\u8A3C\u306B\u4F7F\u7528\u3059\u308B HTTP \u8A8D\u8A3C\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC
undertow.http-invoker.security-realm=\u8A8D\u8A3C\u306B\u4F7F\u7528\u3059\u308B\u30EC\u30AC\u30B7\u30FC\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0
