undertow=Le sous-syst\u00E8me Undertow
undertow.add=Op\u00E9ration d'ajout de sous-syst\u00E8me
undertow.remove=Op\u00E9ration de suppression de sous-syst\u00E8me
undertow.configuration=null
undertow.default-virtual-host=L'h\u00F4te virtuel par d\u00E9faut utilis\u00E9 pour les d\u00E9ploiements
undertow.default-servlet-container=Le conteneur de servlet par d\u00E9faut utilis\u00E9 pour les d\u00E9ploiements
undertow.default-server=Le serveur par d\u00E9faut utilis\u00E9 pour les d\u00E9ploiements
undertow.instance-id=L'id d'instance de cluster
undertow.statistics-enabled=Configure si les statistiques sont activ\u00E9es. Les changements prendront effet sur les statistiques de niveaux de connecteurs imm\u00E9diatement. Les statistiques de niveau de d\u00E9ploiement ne seront affect\u00E9s qu'apr\u00E8s que le d\u00E9ploiement soit red\u00E9ploy\u00E9 (ou que le conteneur soit charg\u00E9 \u00E0 nouveau).
undertow.default-security-domain=Le domaine de s\u00E9curit\u00E9 par d\u00E9faut utilis\u00E9 par les d\u00E9ploiements web
undertow.buffer-cache=Le cache tampon utilis\u00E9 pour mettre le contenu statistique en cache
undertow.buffer-cache.add=Ajoute un cache tampon
undertow.buffer-cache.remove=Supprime un cache tampon
undertow.buffer-cache.name=Le nom de cache
undertow.buffer-cache.buffer-size=La taille d'un tampon individuel, en octets.
undertow.buffer-cache.buffers-per-region=Les nombres de tampons dans une r\u00E9gion
undertow.buffer-cache.max-regions=Le nombre maximum de r\u00E9gions
undertow.server=Un serveur
undertow.server.add=Ajoute un serveur
undertow.server.remove=Supprime un serveur
undertow.server.name=Le nom du serveur
undertow.server.default-host=L'h\u00F4te virtuel par d\u00E9faut des serveurs
undertow.server.servlet-container=Le conteneur du servlet par d\u00E9faut des serveurs
undertow.server.http-listener=Un \u00E9couteur HTTP
undertow.server.https-listener=Un \u00E9couteur HTTP
undertow.server.ajp-listener=Un \u00E9couteur AJP
undertow.server.host=L'h\u00F4te des serveurs
undertow.servlet-container=Un conteneur de servlet
undertow.servlet-container.add=Ajoute un conteneur de servlet
undertow.servlet-container.remove=Supprime un conteneur de servlet
undertow.servlet-container.name=Le nom du conteneur de servlet
undertow.servlet-container.default-buffer-cache=Le cache tampon \u00E0 utiliser pour les ressources statiques de mise en cache
undertow.servlet-container.stack-trace-on-error=Indique si une page d'erreur avec stack trace doit \u00EAtre g\u00E9n\u00E9r\u00E9e en cas d'erreur. Les valeurs sont all, non et local-only
undertow.servlet-container.setting=Configurations du conteneur du servlet
undertow.servlet-container.persistent-sessions=Indique si le conteneur de servlet doit persister des sessions \u00E0 travers les red\u00E9ploiements.
undertow.servlet-container.allow-non-standard-wrappers=Si d\u00E9fini sur true, les wrappers de demande ou de r\u00E9ponse qui ne s'\u00E9tendent pas aux classes de wrappers standards pourront \u00EAtre utilis\u00E9s
undertow.servlet-container.use-listener-encoding=Utiliser un encodage d\u00E9fini sur l'\u00E9couteur
undertow.servlet-container.ignore-flush=Ignore les vidages sur flux de sortie du servlet. Dans la plupart des cas, ils affectent la performance sans bonne raison.
undertow.servlet-container.default-encoding=Encodage par d\u00E9faut \u00E0 utiliser pour toutes les applications d\u00E9ploy\u00E9es
undertow.servlet-container.eager-filter-initialization=Si d\u00E9fini sur true, les appels filtreront init() 
undertow.servlet-container.default-session-timeout=Le d\u00E9lai d'attente de session par d\u00E9faut (en minutes) pour toutes les applications d\u00E9ploy\u00E9es dans le conteneur.
undertow.servlet-container.use-global-request-controller=Si sur true, Undertow s'enregistrera dans le contr\u00F4leur de requ\u00EAtes global. Cela aura un l\u00E9ger impact sur la performance, mais cela permettra une fermeture correcte et une limite globale du nombre de requ\u00EAtes actives dans le serveur.
undertow.servlet-container.disable-caching-for-secured-pages=Indique si Undertow doit d\u00E9finir des en-t\u00EAtes pour d\u00E9sactiver la mise en cache des pages s\u00E9curis\u00E9es. En le d\u00E9sactivant, vous pouvez rencontrer les probl\u00E8mes de s\u00E9curit\u00E9, car les pages sensibles peuvent \u00EAtre mises en cache par un interm\u00E9diaire.
undertow.servlet-container.mime-mapping=Config de mappage mime du servlet
undertow.servlet-container.welcome-file=Un fichier welcome
undertow.servlet-container.directory-listing=Indique si le r\u00E9pertoire doit \u00EAtre activ\u00E9 dans les servlets par d\u00E9faut.
undertow.servlet-container.proactive-authentication=Indique si l'authentification doit \u00EAtre utilis\u00E9e. Si sur true, un utilisateur devra toujours \u00EAtre authentifi\u00E9 si les identifiants sont pr\u00E9sents.
undertow.servlet-container.session-id-length=La longueur de l'ID de session g\u00E9n\u00E9r\u00E9e. Les ID de session longs sont plus s\u00E9curis\u00E9s. Ce nombre repr\u00E9sente le nombre d'octets al\u00E9atoires qui sont utilis\u00E9s pour g\u00E9n\u00E9rer la session ID. L'ID qui sera envoy\u00E9 au client sera cod\u00E9 base64 et sera donc environ 33 % plus grand (par exemple une longueur d'id de session de 30 se traduira par une valeur de cookie de longueur 40).
undertow.servlet-container.max-sessions=Le nombre maximum de sessions pouvant \u00EAtre activ\u00E9es \u00E0 la fois
undertow.servlet-container.disable-file-watch-service=Si d\u00E9fini sur true, alors le service de surveillance des fichiers ne sera pas utilis\u00E9 pour contr\u00F4ler les changements dans les d\u00E9ploiements explos\u00E9s.
undertow.servlet-container.disable-session-id-reuse=Si d\u00E9fini \u00E0 true, un ID de session inconnu ne sera jamais r\u00E9utilis\u00E9 et un nouvel ID de session sera g\u00E9n\u00E9r\u00E9. Si d\u00E9fini \u00E0 false, il sera r\u00E9utilis\u00E9 si et seulement s'il est pr\u00E9sent dans le gestionnaire de session d'un autre d\u00E9ploiement, pour autoriser le m\u00EAme ID de session \u00E0 \u00EAtre partag\u00E9 entre les applications du m\u00EAme serveur.
undertow.mime-mapping=La configuration de mappage mime du conteneur de servlet
undertow.mime-mapping.add=Ajoute un mappage mime
undertow.mime-mapping.remove=Supprime un mappage mime
undertow.mime-mapping.value=Le type mime de ce mappage
undertow.welcome-file=Le fichier welcome
undertow.welcome-file.add=Ajoute un fichier welcome
undertow.welcome-file.remove=Supprime un fichier welcome
undertow.error-page=Pages d'erreurs du serveur
undertow.handler=Gestionnaires d'Undertow
undertow.handler.add=Ajoute un \u00E9l\u00E9ment de gestionnaire
undertow.handler.remove=Supprime un \u00E9l\u00E9ment de gestionnaire
undertow.handler.name=Le nom du gestionnaire
undertow.filter=Filtres d'Undertow
undertow.filter.add=Ajoute l'\u00E9l\u00E9ment de filtre
undertow.filter.remove=Supprime l'\u00E9l\u00E9ment de filtre
undertow.filter.name=Le nom du filtre
undertow.ajp-listener=Un \u00E9couteur AJP
undertow.ajp-listener.add=Ajoute un \u00E9couteur AJP
undertow.ajp-listener.remove=Supprime un \u00E9couteur AJP
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.access-log=Configuration du journal d'acc\u00E8s pour ce serveur virtuel.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.access-log.add=Ajoute la configuration du journal d'acc\u00E8s \u00E0 ce serveur virtuel.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.access-log.remove=Supprime la configuration du journal d'acc\u00E8s \u00E0 ce serveur virtuel.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.access-log.pattern=Sch\u00E9ma du journal d'acc\u00E8s.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.access-log.prefix=Pr\u00E9fixe pour le nom du fichier journal.
undertow.access-log.suffix=Suffixe pour le nom du fichier journal.
undertow.access-log.directory=R\u00E9pertoire dans lequel sauvegarder les journaux
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.access-log.rotate=Effectuer une rotation du journal d'acc\u00E8s chaque jour.
undertow.access-log.worker=Nom du worker \u00E0 utiliser pour la journalisation
undertow.access-log.use-server-log=Indique si le journal doit \u00EAtre \u00E9crit dans le journal du serveur, et non pas dans un fichier s\u00E9par\u00E9.
undertow.access-log.relative-to=Le r\u00E9pertoire du chemin est relatif \u00E0
undertow.access-log.extended=Indique si le journal utilise le format de fichier de journalisation \u00E9tendu
undertow.access-log.predicate=Pr\u00E9dicat qui d\u00E9termine si la requ\u00EAte doit \u00EAtre journalis\u00E9e
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.single-sign-on=Une configuration de m\u00E9canisme d'authentification SSO
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.single-sign-on.add=Ajoute un m\u00E9canisme de configuration SSO
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.single-sign-on.remove=Supprime le m\u00E9canisme d'authentification SSO.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.single-sign-on.domain=Domaine cookie qui sera utilis\u00E9.
undertow.single-sign-on.path=Chemin de cookie.
undertow.single-sign-on.http-only=D\u00E9finit l'attribut de cookie httpOnly.
undertow.single-sign-on.secure=D\u00E9finit l'attribut de cookie s\u00E9curis\u00E9e.
undertow.single-sign-on.cookie-name=Nom du cookie
undertow.single-sign-on.key-store=Une r\u00E9f\u00E9rence \u00E0 un key store contenant une cl\u00E9 priv\u00E9e.
undertow.single-sign-on.key-alias=Alias de la cl\u00E9 priv\u00E9e utilis\u00E9e pour signer et v\u00E9rifier la connexion de d\u00E9connexion back-channel
undertow.single-sign-on.credential-reference=La r\u00E9f\u00E9rence d'identifiant pour d\u00E9crypter l'entr\u00E9e de cl\u00E9 priv\u00E9e.
undertow.single-sign-on.credential-reference.store=Le nom du store d'identifiants d\u00E9tenant l'alias du l'identifiant.
undertow.single-sign-on.credential-reference.alias=L'alias d\u00E9notant un secret ou un identifiant stock\u00E9 dans le store.  
undertow.single-sign-on.credential-reference.type=Le type d'identifiant que cette r\u00E9f\u00E9rence d\u00E9note.
undertow.single-sign-on.credential-reference.clear-text=Le secret indiqu\u00E9 en texte clair. V\u00E9rifier la fa\u00E7on dont les store d'identifiants fournissent les identifiants/secrets aux services.
undertow.single-sign-on.client-ssl-context=R\u00E9f\u00E9rence au conteste SSL utilis\u00E9 pour s\u00E9curiser la connexion de d\u00E9connexion back-channel
undertow.listener=\u00E9couteur http
undertow.listener.add=Ajoute \u00E9couteur
undertow.listener.remove=Nom de l'\u00E9couteur
undertow.listener.name=Le nom de l'\u00E9couteur
undertow.listener.socket-binding=La liaison de socket de l'\u00E9couteur
undertow.listener.worker=Le worker XNIO des \u00E9couteurs
undertow.listener.buffer-pool=Le pool de la m\u00E9moire tampon des \u00E9couteurs
undertow.listener.enabled=Indique si l'\u00E9couteur est actif
undertow.listener.enabled.deprecated=Les attributs activ\u00E9s sont d\u00E9pr\u00E9ci\u00E9s car ils causent des probl\u00E8mes avec certaines exigences de consistance dans la configuration.
undertow.listener.scheme=Le sch\u00E9ma d'\u00E9couteur ; peut \u00EAtre HTTP ou HTTPS. Par d\u00E9faut, le sch\u00E9ma viendra de la requ\u00EAte AJP entrante.
undertow.listener.certificate-forwarding=Indique si le transfert de certificats doit \u00EAtre activ\u00E9. Si cette option est activ\u00E9e, l'auditeur obtiendra un certificat de l'attribut SSL_CLIENT_CERT. Ceci doit seulement \u00EAtre activ\u00E9 si derri\u00E8re un proxy et si le serveur proxy est configur\u00E9 pour d\u00E9finir ces en-t\u00EAtes \u00E0 chaque fois .
undertow.listener.ssl-context=R\u00E9f\u00E9rence au contexte SSL qui va \u00EAtre utilis\u00E9 par cet \u00E9couteur.
undertow.listener.security-realm=Le domaine de s\u00E9curit\u00E9 de l'\u00E9couteur
undertow.listener.security-realm.deprecated=Utiliser l'attribut ssl-context pour r\u00E9f\u00E9rencer un contexte SSL directement.
undertow.listener.max-post-size=La taille maximum d'un post de publication qui pourra \u00EAtre accept\u00E9e
undertow.listener.buffer-pipelined-data=Indique si l'on doit mettre les requ\u00EAtes canalis\u00E9es en m\u00E9moire tampon
undertow.listener.allow-encoded-slash=Si une requ\u00EAte arrive avec les caract\u00E8res / encod\u00E9s (par ex. %2F), ils seront d\u00E9chiffr\u00E9s.
undertow.listener.decode-url=Si sur true, l'analyseur d\u00E9codera l'URL et les param\u00E8tres de demande par un syst\u00E8me de d\u00E9codification de caract\u00E8res s\u00E9lectionn\u00E9 (UTF-8 par d\u00E9faut). Si sur false, ils ne seront pas d\u00E9cod\u00E9s. Cela permettra, par la suite, \u00E0 un gestionnaire de les d\u00E9coder dans n'importe quel jeu de caract\u00E8res d\u00E9sir\u00E9.
undertow.listener.url-charset=Charset d'URL
undertow.listener.max-header-size=La taille maximum (en octets) d'un en-t\u00EAte de requ\u00EAte http.
undertow.listener.max-headers=Le nombre maximum d'en-t\u00EAtes \u00E0 traiter. Utilis\u00E9 pour prot\u00E9ger des vuln\u00E9rabilit\u00E9s de hachage.
undertow.listener.max-cookies=Le nombre maximum de cookies \u00E0 traiter. Utilis\u00E9 pour prot\u00E9ger contre les vuln\u00E9rabilit\u00E9s de hachage.
undertow.listener.max-parameters=Le nombre maximum de param\u00E8tres \u00E0 traiter. Cela sert \u00E0 prot\u00E9ger contre les vuln\u00E9rabilit\u00E9s de hachage. Cela s'applique \u00E0 la fois aux param\u00E8tres de requ\u00EAte et aux donn\u00E9es de publication (POST), mais ce n'est pas cumulatif (c.-\u00E0-d. vous pouvez avoir des param\u00E8tres max * 2 param\u00E8tres au total).
undertow.listener.verify-client=Le mode d'authentification du client SSL d\u00E9sir\u00E9 pour les canaux SSL
undertow.listener.verify-client.deprecated=Quand un contexte SSL est r\u00E9f\u00E9renc\u00E9, il doit \u00EAtre configur\u00E9 directement dans le mode de v\u00E9rification du client demand\u00E9.
undertow.listener.always-set-keep-alive=Si d\u00E9fini sur true, alors un en-t\u00EAte Connection\: keep-alive sera ajout\u00E9 aux r\u00E9ponses, m\u00EAme si cela n'est pas strictement exig\u00E9 par la sp\u00E9cification.
undertow.listener.redirect-socket=Si cet \u00E9couteur supporte des requ\u00EAtes non-SSL, et qu'une requ\u00EAte est re\u00E7ue avec une <security-constraint> n\u00E9cessitant un transport SSL, Undertow redirigera la requ\u00EAte directement au port de liaison de socket sp\u00E9cifi\u00E9 ici.
undertow.listener.proxy-address-forwarding=Active la gestion de l'en-t\u00EAte de x-forwarded-host (et autres en-t\u00EAtes x-forwarder-*) et utilise ces informations d'en-t\u00EAtes pour d\u00E9finir l'adresse distante. Doit uniquement \u00EAtre utilis\u00E9 avec un serveur proxy de confiance d\u00E9finissant ces en-t\u00EAtes, sinon un utilisateur distant pourrait usurper leurs adresses IP.
undertow.listener.enabled-cipher-suites=Configure Ciphers SSL activ\u00E9
undertow.listener.enabled-cipher-suites.deprecated=Quand un contexte SSL est r\u00E9f\u00E9renc\u00E9, il doit \u00EAtre configur\u00E9 dans les suites chiffr\u00E9es qui seront prises en charge.
undertow.listener.enabled-protocols=Configure Protocoles SSL
undertow.listener.enabled-protocols.deprecated=Quand un contexte SSL est r\u00E9f\u00E9renc\u00E9, il doit \u00EAtre configur\u00E9 avec les protocoles pris en charge.
undertow.listener.max-buffered-request-size=Taille maximum d'une requ\u00EAte en m\u00E9moire tampon, en octets. Les requ\u00EAtes ne sont normalement pas mises en m\u00E9moire tampon, le cas le plus courant \u00E9tant lors de la ren\u00E9gociation SSL d'une requ\u00EAte de POST, et que les donn\u00E9es du post de publication doivent \u00EAtre enti\u00E8rement mises en m\u00E9moire tampon pour pouvoir faire la n\u00E9gociation.
undertow.listener.record-request-start-time=Si sur true, Undertow enregistrera l'heure de d\u00E9part de la demande, pour que la dur\u00E9e puisse \u00EAtre journalis\u00E9e. Cela a un moindre impact de performance, mesurable cependant.
undertow.listener.allow-equals-in-cookie-value=Si sur true, Undertow autorisera les caract\u00E8res "\u00E9gal" sans s\u00E9quence d'\u00E9chappement dans les valeurs de cookie sans guillemets. Les valeurs sans guillemets ne peuvent contenir des caract\u00E8res "\u00E9gal". Si pr\u00E9sentes, les valeurs se terminent avant le signe "\u00E9gal". Le reste de la valeur du cookie sera abandonn\u00E9.
undertow.listener.no-request-timeout=La dur\u00E9e, en millisecondes, pendant laquelle la connexion peut \u00EAtre inactive avant qu'elle puisse \u00EAtre ferm\u00E9e par le conteneur. 
undertow.listener.request-parse-timeout=La dur\u00E9e maximale (en millisecondes) pendant laquelle une demande peut \u00EAtre trait\u00E9e
undertow.listener.rfc6265-cookie-validation=Si les cookies doivent \u00EAtre valid\u00E9s pour garantir qu'ils respectent la norme RFC6265.
undertow.listener.receive-buffer=La taille de la m\u00E9moire tampon de r\u00E9ception, en octets.
undertow.listener.send-buffer=La taille de la m\u00E9moire tampon d'envoi, en octets.
undertow.listener.max-connections=Le nombre maximum de connexions simultan\u00E9es. Seules les valeurs sup\u00E9rieures \u00E0 0 sont accept\u00E9es. Pour les connexions illimit\u00E9es, il suffit de ne pas d\u00E9finir cette valeur d'attribut.
undertow.listener.tcp-backlog=Configurer un serveur avec un backlog particulier.
undertow.listener.tcp-keep-alive=Configurer un canal pour envoyer les messages TCP keep-alive de mani\u00E8re \u00E0 ce qu'ils soient d\u00E9pendants de l'impl\u00E9mentation.
undertow.listener.read-timeout=Configurer un d\u00E9lai d'attente de lecture de socket, en millisecondes. Si la dur\u00E9e demand\u00E9e expire sans qu'une lecture satisfaisante ait pu avoir lieu, la prochaine lecture du socket g\u00E9n\u00E9rera une exception  {@link Readd\u00E9lai d'attenteException}.
undertow.listener.write-timeout=Configurer un d\u00E9lai d'attente d'\u00E9criture  de socket, en millisecondes. Si la dur\u00E9e demand\u00E9e expire sans qu'un temps d'\u00E9criture satisfaisant ait pu avoir lieu, la prochaine lecture du socket g\u00E9n\u00E9rera une exception  {@link Writed\u00E9lai d'attenteException}.
undertow.listener.resolve-peer-address=Active host dns lookup
undertow.listener.enable-connector-statistics=D\u00E9finit si les statistiques de connecteurs sont activ\u00E9s. Cela permettra l'acc\u00E8s aux statistiques, au co\u00FBt d'un certain montant de performance.
undertow.listener.request-count=Le nombre de requ\u00EAtes que cet \u00E9couteur a servi.
undertow.listener.bytes-sent=Le nombre d'octets envoy\u00E9s sur cet \u00E9couteur
undertow.listener.bytes-received=Le nombre d'octets re\u00E7us par cet \u00E9couteur
undertow.listener.error-count=Le nombre de 500 r\u00E9ponses envoy\u00E9es par cet \u00E9couteur
undertow.listener.processing-time=Le temps de traitement total de toutes les requ\u00EAtes effectu\u00E9es par cet \u00E9couteur
undertow.listener.max-processing-time=Le temps de traitement maximal pris par une requ\u00EAte sur cet \u00E9couteur
undertow.listener.reset-statistics=Restaure tous les statistiques de connecteur \u00E0 z\u00E9ro
undertow.listener.enable-http2=Active le support HTTP2 pour cet \u00E9couteur
undertow.listener.enable-spdy=Active le support SPDY pour cet \u00E9couteur. D\u00E9pr\u00E9ci\u00E9 et sans effet, HTTP/2 doit \u00EAtre utilis\u00E9 \u00E0 la place.
undertow.listener.enable-spdy.deprecated=SPDY a \u00E9t\u00E9 remplac\u00E9 par HTTP/2
undertow.listener.disallowed-methods=Liste de m\u00E9thodes HTTP non autoris\u00E9es s\u00E9par\u00E9es par des virgules
undertow.listener.ssl-session-cache-size=Le nombre maximum de sessions SSL actives
undertow.listener.ssl-session-cache-size.deprecated=Cela peut \u00EAtre maintenant configur\u00E9 dans le contexte de s\u00E9curit\u00E9 Elytron
undertow.listener.ssl-session-timeout=Le d\u00E9lai d'expiration des sessions SSL, en secondes
undertow.listener.ssl-session-timeout.deprecated=Cela peut \u00EAtre maintenant configur\u00E9 dans le contexte de s\u00E9curit\u00E9 Elytron
undertow.listener.secure=Si d\u00E9fini sur true, alors les requ\u00EAtes qui viennent de cet \u00E9couteur seront indiqu\u00E9es comme \u00E9tant s\u00E9curis\u00E9es, m\u00EAme si la requ\u00EAte n'utilise pas d'HTTPS.
undertow.listener.max-ajp-packet-size=La taille maximum de paquets AJP support\u00E9e. Si modifi\u00E9e, elle devra \u00E9galement \u00EAtre ajust\u00E9e sur l'\u00E9quilibreur des charges et sur le serveur principal.
undertow.listener.http2-enable-push=Si la Transmission des messages par le serveur est activ\u00E9e pour cette connexion
undertow.listener.http2-max-frame-size=La taille de trame HTTP/2 max
undertow.listener.http2-max-concurrent-streams=Le nombre de flux HTTP/2 pouvant \u00EAtre actifs \u00E0 tout moment sur une simple connexion
undertow.listener.http2-max-header-list-size=La taille maximale d'en-t\u00EAtes de requ\u00EAtes que le serveur est pr\u00EAt \u00E0 accepter.
undertow.listener.http2-initial-window-size=La taille de fen\u00EAtre de contr\u00F4le de flux qui contr\u00F4le la vitesse \u00E0 laquelle le client peut envoyer des donn\u00E9es au serveur
undertow.listener.http2-header-table-size=La taille de la table d'en-t\u00EAtes utilis\u00E9s pour la compression HPACK, en octets. Ce montant de m\u00E9moire sera allou\u00E9 par connexion de compression. Les plus grandes valeurs utilisent un plus grand montant de m\u00E9moire, mais assurent une meilleure compression.
undertow.listener.require-host-http11=Requiert l'en-t\u00EAte d'h\u00F4te quand on utilise le protocole HTTP/1.1, suivant la sp\u00E9cification RFC. Si la requ\u00EAte n'inclut pas d'en-t\u00EAte, elle sera rejet\u00E9e avec une erreur 403. 
undertow.host=Un h\u00F4te Undertow
undertow.host.add=Ajoute un nouvel h\u00F4te
undertow.host.remove=Supprime un h\u00F4te
undertow.host.name=Le nom de l'h\u00F4te
undertow.host.alias=Alias d'h\u00F4te
undertow.host.default-web-module=Module web par d\u00E9faut
undertow.host.setting=Configuration
undertow.host.default-response-code=Si d\u00E9fini, cela correspondra au code de r\u00E9ponse renvoy\u00E9 quand le contexte demand\u00E9 n'existe pas dans le serveur.
undertow.host.disable-console-redirect=Si d\u00E9fini sur true, /console redirect ne sera pas activ\u00E9 pour cet h\u00F4te. La valeur par d\u00E9faut est false.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp=Configuration du conteneur JSP.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.add=Ajoute la configuration du conteneur JSP.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.remove=Supprime la configuration du conteneur JSP.
undertow.setting.jsp.development=Active le Mode de d\u00E9veloppement qui permet le chargement \u00E0 nouveau de JSP imm\u00E9diatement
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.disabled=D\u00E9sactive le conteneur JSP.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.keep-generated=Conserver les servlets g\u00E9n\u00E9r\u00E9es.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.trim-spaces=D\u00E9couper quelques espaces de la servlet g\u00E9n\u00E9r\u00E9e.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.tag-pooling=Active le sondage de balises.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.mapped-file=Mapper vers la source JSP.
undertow.setting.jsp.check-interval=V\u00E9rifier l'intervalle pour les mises \u00E0 jour de JSP \u00E0 l'aide d'un thread en arri\u00E8re plan. Cela n'a aucun effet sur la plupart des d\u00E9ploiements pour lesquels les notifications de modification de JSP sont trait\u00E9es \u00E0 l'aide d'une API de notification des syst\u00E8mes de fichier. Cela n'a d'effet que si le service de surveillance des fichiers est d\u00E9sactiv\u00E9. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.modification-test-interval=Temps minimum entre deux tests pour les mises \u00E0 jour, en secondes.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.recompile-on-fail=\u00C9chec des compilations JSP de la nouvelle tentative sur chaque requ\u00EAte.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.smap=Active SMAP.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.dump-smap=\u00C9crire des donn\u00E9es SMAP sur un fichier.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.generate-strings-as-char-arrays=G\u00E9n\u00E9rer des constances de cha\u00EEnes en tant que matrices char.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.error-on-use-bean-invalid-class-attribute=Active les erreurs lors de l'utilisation d'une classe erron\u00E9e dans useBean.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.scratch-dir=Sp\u00E9cifier un r\u00E9pertoire de travail diff\u00E9rent.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.source-vm=Niveau VM source pour compilation.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.target-vm=Niveau VM cible pour compilation.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.java-encoding=Sp\u00E9cifier l'encodage utilis\u00E9 pour les sources JAVA.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author samfreemanz
undertow.setting.jsp.x-powered-by=Active la publicit\u00E9 du moteur JSP dans x-powered-by.
undertow.setting.jsp.display-source-fragment=Lorsqu'une erreur de runtime se produit, une tentative d'afficher le fragment source JSP correspondant est effectu\u00E9e. 
undertow.setting.jsp.optimize-scriptlets=Indique si les scriptlets JSP doivent \u00EAtre optimis\u00E9s pour retirer la concat\u00E9nation de cha\u00EEne.
undertow.setting.session-cookie=Configuration de cookie de session
undertow.setting.session-cookie.add=Ajoute une configuration de cookie de session
undertow.setting.session-cookie.remove=Supprime une configuration de cookie de session
undertow.setting.session-cookie.name=Nom du cookie
undertow.setting.session-cookie.http-only=Est un cookie http-only
undertow.setting.session-cookie.secure=Est-ce un cookie s\u00E9curis\u00E9 ?
undertow.setting.session-cookie.domain=Domaine de cookie
undertow.setting.session-cookie.comment=Commentaire de cookie
undertow.setting.session-cookie.max-age=\u00C2ge max du cookie
undertow.setting.persistent-sessions=Sessions persistantes de session
undertow.setting.persistent-sessions.enabled=Si d\u00E9fini sur true, les sessions persistantes seront autoris\u00E9es
undertow.setting.persistent-sessions.add=Ajoute la ressource de sessions persistantes
undertow.setting.persistent-sessions.remove=Supprime la ressource de sessions persistantes
undertow.setting.persistent-sessions.path=Le chemin qui m\u00E8ne au r\u00E9pertoire de donn\u00E9es de sessions persistantes. Si sur null, les sessions seront stock\u00E9es en m\u00E9moire 
undertow.setting.persistent-sessions.relative-to=Le r\u00E9pertoire du chemin est relatif \u00E0
undertow.handler.simple-error-page=Configuration de page d'erreur simple
undertow.setting.websockets=Indique si les websockets sont activ\u00E9s pour ce conteneur
undertow.setting.websockets.add=Ajoute un support pour les websockets
undertow.setting.websockets.remove=Supprime un support pour les websockets
undertow.setting.websockets.dispatch-to-worker=Indique si les rappels doivent \u00EAtre exp\u00E9di\u00E9s vers un thread de travail. Si sur faux, alors, ils seront ex\u00E9cut\u00E9s dans le thread d'e/s, qui est plus rapide, cependant il ne faut pas d'op\u00E9rations de blocage.
undertow.setting.websockets.worker=Le worker \u00E0 utiliser pour les d\u00E9ploiements de websockets
undertow.setting.websockets.buffer-pool=Le pool de m\u00E9moire tampon \u00E0 utiliser pour les d\u00E9ploiements de websockets
undertow.setting.websockets.per-message-deflate=Active l'extension de compression par message du websocket, RFC-7692
undertow.setting.websockets.deflater-level=Configure le niveau de compression de l'algorithme COMPRESS\u00C9
undertow.setting.crawler-session-management=Configure la gestion de sessions sp\u00E9ciales robots d'indexation
undertow.setting.crawler-session-management.add=Ajoute la gestion de sessions sp\u00E9ciales robots d'indexation
undertow.setting.crawler-session-management.remove=Supprime la gestion de sessions sp\u00E9ciales robots d'indexation
undertow.setting.crawler-session-management.user-agents=Expression standard utilis\u00E9e pour faire correspondre l\u2019agent utilisateur d'un robot
undertow.setting.crawler-session-management.session-timeout=Le d\u00E9lai d'expiration des sessions appartenant aux robots
undertow.handler.simple-error-page.add=Ajoute une page d'erreur simple
undertow.handler.simple-error-page.remove=Supprime une page d'erreur simple
undertow.handler.simple-error-page.name=Nom de la page d'erreur
undertow.handler.simple-error-page.code=Code erreur
undertow.handler.file=Gestionnaire de fichiers
undertow.handler.file.add=Ajoute un gestionnaire de fichiers
undertow.handler.file.remove=Supprime gestionnaire de fichiers
undertow.handler.file.name=Nom du gestionnaire de fichiers
undertow.handler.file.path=Chemin d'acc\u00E8s du syst\u00E8me de fichiers o\u00F9 le gestionnaire de fichiers servira des ressources
undertow.handler.file.cache-buffer-size=Taille des tampons, en octets.
undertow.handler.file.cache-buffers=Nombre de tampons
undertow.handler.file.directory-listing=Active la liste de r\u00E9pertoires\u00A0?
undertow.handler.file.follow-symlink=Active les liens symboliques suivants
undertow.handler.file.safe-symlink-paths=Chemins fiables en tant que cibles de liens symboliques
undertow.handler.file.case-sensitive=Utiliser la gestion de fichiers sensible \u00E0 chaque cas
undertow.handler.reverse-proxy=Un gestionnaire de proxys inverses
undertow.handler.reverse-proxy.add=Ajoute un gestionnaire de proxys inverses
undertow.handler.reverse-proxy.remove=Supprime un gestionnaire de proxys inverses
undertow.handler.reverse-proxy.problem-server-retry=Dur\u00E9e \u00E0 attendre avant de tenter de se reconnecter \u00E0 un serveur d\u00E9connect\u00E9
undertow.handler.reverse-proxy.sticky-session-lifetime=Dur\u00E9e, en minutes, pendant laquelle les donn\u00E9es de la sticky session survivront
undertow.handler.reverse-proxy.session-cookie-names=Liste de noms de cookies s\u00E9par\u00E9s par des virgules. Normalement JSESSIONID.
undertow.handler.reverse-proxy.max-request-time=Dur\u00E9e maximum pendant laquelle une requ\u00EAte de proxy peut demeurer active, avant d'\u00EAtre supprim\u00E9e. 
undertow.handler.reverse-proxy.connections-per-thread=Le nombre de connexions \u00E0 maintenir dans les serveurs de backend, par thread e/s.
undertow.handler.reverse-proxy.request-queue-size=Le nombre de requ\u00EAtes pouvant \u00EAtre contenues si le pool de connexions est plein avant que les requ\u00EAtes soient rejet\u00E9es avec erreur 503
undertow.handler.reverse-proxy.host=H\u00F4te auquel le proxy inverse enverra des requ\u00EAtes
undertow.handler.reverse-proxy.host.instance-id=L'id d'instance (aka route JVM) qui sera utilis\u00E9e pour activer les sticky sessions
undertow.handler.reverse-proxy.host.outbound-socket-binding=Liaison de socket sortante pour cet h\u00F4te
undertow.handler.reverse-proxy.host.scheme=Quel sorte de sch\u00E9ma est utilis\u00E9
undertow.handler.reverse-proxy.host.path=Chemin optionnel si l'h\u00F4te utilise une ressource non root 
undertow.handler.reverse-proxy.cached-connections-per-thread=Le nombre de connexions qui seront maintenues live ind\u00E9finiment
undertow.handler.reverse-proxy.connection-idle-timeout=La dur\u00E9e pendant laquelle une connexion peut demeurer inactive avant qu'elle soit ferm\u00E9e. Les connexions n'expireront pas une fois que la taille du pool est au niveau minimum configur\u00E9 (voir cached-connections-per-thread)
undertow.handler.reverse-proxy.host.add=Ajoute un gestionnaire h\u00F4te de proxys inverses
undertow.handler.reverse-proxy.host.remove=Supprime un gestionnaire h\u00F4te de proxys inverses
undertow.handler.reverse-proxy.host.security-realm=Le domaine de s\u00E9curit\u00E9 qui fournit la configuration SSL de la connexion \u00E0 l'h\u00F4te
undertow.handler.reverse-proxy.host.ssl-context=R\u00E9f\u00E9rence au contexte SSL qui va \u00EAtre utilis\u00E9 par ce gestionnaire.
undertow.handler.reverse-proxy.host.security-realm.deprecated=Utiliser l'attribut ssl-context pour r\u00E9f\u00E9rencer un contexte SSL directement.
undertow.handler.reverse-proxy.host.enable-http2=Si d\u00E9fini \u00E0 true, le proxy tente d'utiliser HTTP/2 pour se connecter au backend. Si HTTP/2 n'est pas pris en charge, HTTP/1.1/ sera utilis\u00E9 \u00E0 la place.
undertow.handler.reverse-proxy.max-retries=Le nombre de nouvelles tentatives si une requ\u00EAte \u00E9choue. Notez que si la requ\u00EAte n'est pas consid\u00E9r\u00E9e idempotent, elle ne sera tent\u00E9e \u00E0 nouveau que si le serveur proxy est certain qu'elle n'a pas \u00E9t\u00E9 envoy\u00E9e \u00E0 un serveur de backend).
undertow.filter.basic-auth=Configuration auth de base
undertow.filter.basic-auth.add=Ajoute auth de base
undertow.filter.basic-auth.remove=Supprime auth de base
undertow.filter.basic-auth.name=Nom du filtre
undertow.filter.basic-auth.security-domain=Domaine de s\u00E9curit\u00E9
undertow.filter.connection-limit=Gestionnaire de d\u00E9limitation de demandes simultan\u00E9es. Nom d\u00E9pr\u00E9ci\u00E9 de la ressource request-limit.
undertow.filter.connection-limit.add=Ajoute un d\u00E9limiteur de requ\u00EAtes
undertow.filter.connection-limit.remove=supprime de d\u00E9limiteur
undertow.filter.connection-limit.name=nom du gestionnaire
undertow.filter.connection-limit.max-concurrent-requests=Nombre maximum de requ\u00EAtes simultan\u00E9es
undertow.filter.connection-limit.queue-size=Nombre de requ\u00EAtes en file d'attente avant qu'elles commencent \u00E0 \u00EAtre rejet\u00E9es
undertow.filter.request-limit=Gestionnaire de d\u00E9limiteur de requ\u00EAtes simultan\u00E9es
undertow.filter.request-limit.add=Ajoute un d\u00E9limiteur de requ\u00EAtes
undertow.filter.request-limit.remove=supprime de d\u00E9limiteur
undertow.filter.request-limit.name=nom du gestionnaire
undertow.filter.request-limit.max-concurrent-requests=Nombre maximum de requ\u00EAtes simultan\u00E9es
undertow.filter.request-limit.queue-size=Nombre de requ\u00EAtes en file d'attente avant qu'elles commencent \u00E0 \u00EAtre rejet\u00E9es
undertow.filter.response-header=Le filtre d'en-t\u00EAtes de r\u00E9ponses vous permet d'ajouter des en-t\u00EAtes personnalis\u00E9s.
undertow.filter.response-header.add=Ajoute un filtre
undertow.filter.response-header.remove=Supprime un filtre
undertow.filter.response-header.name=Nom du filtre
undertow.filter.response-header.header-name=Nom de l'en-t\u00EAte
undertow.filter.response-header.header-value=Valeur de l'en-t\u00EAte
undertow.filter.gzip=D\u00E9finit le filtre gzip
undertow.filter.gzip.add=Ajoute un filtre
undertow.filter.gzip.remove=Supprime un filtre
undertow.filter.gzip.name=Nom du filtre
undertow.filter.error-page=Pages d'erreurs
undertow.filter.error-page.add=Ajoute une page d'erreur
undertow.filter.error-page.remove=Supprime une page d'erreur
undertow.filter.error-page.name=Nom de page d'erreur
undertow.filter.error-page.code=Code de page d'erreur
undertow.filter.error-page.path=Chemin de page d'erreur
undertow.filter.custom-filter=Filtre personnalis\u00E9
undertow.filter.custom-filter.add=Ajoute un filtre personnalis\u00E9
undertow.filter.custom-filter.remove=Supprime un filtre personnalis\u00E9
undertow.filter.custom-filter.class-name=Nom de classe du HttpHandler
undertow.filter.custom-filter.module=Nom de module \u00E0 partir duquel la classe peut \u00EAtre t\u00E9l\u00E9charg\u00E9e
undertow.filter.custom-filter.parameters=Param\u00E8tres de filtre
undertow.filter.expression-filter=Un filtre analys\u00E9 dans le langage d'expressions d'Undertow
undertow.filter.expression-filter.add=Ajoute un filtre analys\u00E9 par le langage d'expressions d'Undertow
undertow.filter.expression-filter.remove=Supprime le filtre d'expressions
undertow.filter.expression-filter.expression=L'expression qui d\u00E9finit le filtre
undertow.filter.expression-filter.module=Module \u00E0 utiliser pour t\u00E9l\u00E9charger les d\u00E9finitions de filtres
undertow.filter.rewrite=Un filtre de r\u00E9-\u00E9criture (ou de redirection)
undertow.filter.rewrite.add=Ajoute un filtre de r\u00E9-\u00E9criture
undertow.filter.rewrite.remove=Supprime un filtre de r\u00E9-\u00E9criture
undertow.filter.rewrite.target=L'expression qui d\u00E9finit la cible. Si vous redirigez vers une cible constante, mettez des apostrophes devant et apr\u00E8s la valeur
undertow.filter.rewrite.redirect=Si sur true, une redirection au lieu d'une r\u00E9-\u00E9criture aura lieu
undertow.host.location=Contient la configuration de la ressource d'emplacement
undertow.host.location.add=Ajoute un nouvel emplacement
undertow.host.location.remove=Supprime cet emplacement
undertow.host.location.name=Nom de l'emplacement, agit en tant que chemin contextuel
undertow.host.location.handler=Gestionnaire par d\u00E9faut pour cet emplacement
undertow.host.location.filter-ref=R\u00E9f\u00E9rence au filtre
undertow.host.filter-ref=R\u00E9f\u00E9rence au filtre
undertow.filter-ref=R\u00E9f\u00E9rence au filtre
undertow.filter-ref.add=Ajoute une nouvelle r\u00E9f\u00E9rence
undertow.filter-ref.remove=Supprime la r\u00E9f\u00E9rence s\u00E9lectionn\u00E9e
undertow.filter-ref.name=R\u00E9f\u00E9rence \u00E0 quel filtre
undertow.filter-ref.predicate=Les pr\u00E9dicats fournissent un moyen simple de faire une d\u00E9cision true/false bas\u00E9e sur un \u00E9change. De nombreux gestionnaires doivent \u00EAtre appliqu\u00E9s de fa\u00E7on conditionnelle, et les pr\u00E9dicats donnent une m\u00E9thode g\u00E9n\u00E9rale pour sp\u00E9cifier une condition.
undertow.filter-ref.priority=D\u00E9finit l'ordre de filtrage. Il doit \u00EAtre d\u00E9fini \u00E0 1 ou \u00E0 un nombre sup\u00E9rieur\u00A0; un nombre \u00E9lev\u00E9 instruit le serveur d'\u00EAtre inclus plus t\u00F4t dans la cha\u00EEne de gestionnaires par rapport \u00E0 un autre serveur dans les m\u00EAmes circonstances.
undertow.application-security-domain=Un mappage de domaine de s\u00E9curit\u00E9 r\u00E9f\u00E9rence dans une application d\u00E9ploy\u00E9e.
undertow.application-security-domain.add=Ajoute un nouveau mappage de domaine de s\u00E9curit\u00E9 r\u00E9f\u00E9renc\u00E9 par une application.
undertow.application-security-domain.remove=Supprime le mappage de domaine de s\u00E9curit\u00E9 r\u00E9f\u00E9renc\u00E9 par une application.
undertow.application-security-domain.http-authentication-factory=La fabrique d'authentifications HTTP qui doit \u00EAtre utilis\u00E9e par les d\u00E9ploiements qui r\u00E9f\u00E9rencent le domaine de s\u00E9curit\u00E9 mapp\u00E9.
undertow.application-security-domain.override-deployment-config=Est-ce que la configuration d'authentification doit \u00EAtre remplac\u00E9e par la fabrique dans le d\u00E9ploiement\u00A0?
undertow.application-security-domain.enable-jacc=Activer l'autorisation par JACC
undertow.application-security-domain.referencing-deployments=Les d\u00E9ploiements qui r\u00E9f\u00E9rencent ce mappage actuellement.
undertow.application-security-domain.setting=Configuration
undertow.deployment=Information sur le gestionnaire de conteneur Web de ce d\u00E9ploiement
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author croe@redhat.com
undertow.deployment.context-root=Le contexte racine de l'application web
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author croe@redhat.com
undertow.deployment.virtual-host=Le nom de l'h\u00F4te virtuel sur lequel l'application web est servie
undertow.deployment.server=Le nom du serveur auquel cette application appartient
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author croe@redhat.com
undertow.deployment.active-sessions=Nombre de sessions actives
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author croe@redhat.com
undertow.deployment.expired-sessions=Nombre de sessions qui sont expir\u00E9
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author croe@redhat.com
undertow.deployment.rejected-sessions=Nombre de sessions rejet\u00E9es
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author croe@redhat.com
undertow.deployment.max-active-sessions=Nombre maximum de sessions actives concurrentes autoris\u00E9es par ce gestionnaire de sessions
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author croe@redhat.com
undertow.deployment.sessions-created=Nombre total de sessions cr\u00E9\u00E9es
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author croe@redhat.com
undertow.deployment.duplicated-session-ids=Nombre d'ID de sessions en double g\u00E9n\u00E9r\u00E9es par la source au hasard (tout ce qui d\u00E9passe 0 implique un probl\u00E8me)
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author croe@redhat.com
undertow.deployment.session-avg-alive-time=Dur\u00E9e moyenne (en secondes) pendant laquelle des sessions expir\u00E9es ont pu \u00EAtre live
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author croe@redhat.com
undertow.deployment.session-max-alive-time=Dur\u00E9e maximum (en secondes) pendant laquelle des sessions expir\u00E9es ont pu \u00EAtre live
undertow.deployment.servlet=Information sur le statut et la configuration de ce servlet
undertow.deployment.servlet.servlet-name=Nom du servlet
undertow.deployment.servlet.servlet-class=Classe du servlet
undertow.deployment.servlet.min-request-time=Temps minimal de traitement d'une requ\u00EAte
undertow.deployment.servlet.max-request-time=Temps maximal de traitement d'une requ\u00EAte
undertow.deployment.servlet.total-request-time=Temps de traitement total pour toutes les requ\u00EAtes
undertow.deployment.servlet.request-count=Nombre pour toutes les requ\u00EAtes
undertow.deployment.servlet.mappings=Mappages de servlet
undertow.deployment.websocket=Information sur le statut et la configuration de ce socket Web
undertow.deployment.websocket.endpoint-class=Classe du point de terminaison
undertow.deployment.websocket.path=Le chemin de d\u00E9ploiement du point de terminaison
undertow.deployment.invalidate-session=Invalide une session donn\u00E9e
undertow.deployment.invalidate-session.session-id=ID de session \u00E0 invalider
undertow.filter.mod-cluster=Un \u00E9quilibreur de charges frontal de mod-cluster
undertow.handler.mod-cluster=Un \u00E9quilibreur de charges frontal de mod-cluster
undertow.handler.mod-cluster.add=Ajoute un \u00E9quilibreur de charges de mod-proxy frontal
undertow.handler.mod-cluster.remove=Supprime un gestionnaire de proxys de mod-cluster
undertow.handler.mod-cluster.management-socket-binding=La liaison de socket de l'adresse et du port de gestion de mod_cluster. Lorsque vous utilisez mod_cluster, deux \u00E9couteurs HTTP doivent \u00EAtre d\u00E9finis, un public pour g\u00E9rer les requ\u00EAtes et un li\u00E9 au r\u00E9seau interne pour g\u00E9rer les commandes de cluster mod. Cette liaison du socket doit correspondre \u00E0 l'\u00E9couteur  interne et ne doit pas \u00EAtre accessible au public.
undertow.handler.mod-cluster.advertise-socket-binding=Le port et le groupe multidiffusion utilis\u00E9s pour les annonces
undertow.handler.mod-cluster.security-key=Le cl\u00E9 de s\u00E9curit\u00E9 utilis\u00E9e par le groupe mod-cluster. Tous les membres doivent utiliser la m\u00EAme cl\u00E9 de s\u00E9curit\u00E9.
undertow.handler.mod-cluster.advertise-protocol=Le protocole utilis\u00E9.
undertow.handler.mod-cluster.advertise-path=La chemin sous lequel mod-cluster est enregistr\u00E9.
undertow.handler.mod-cluster.advertise-frequency=Le fr\u00E9quence \u00E0 laquelle mod-cluster fait des annonces sur le r\u00E9seau (en millisecondes)
undertow.handler.mod-cluster.failover-strategy=D\u00E9termine comment un n\u0153ud de bascule est choisi, dans le cas o\u00F9 un n\u0153ud auquel une session a une affinit\u00E9 ne soit pas disponible. 
undertow.handler.mod-cluster.health-check-interval=La fr\u00E9quence des pings de contr\u00F4le de sanit\u00E9 allant vers les n\u0153uds de backend
undertow.handler.mod-cluster.broken-node-timeout=La dur\u00E9e qui doit s'\u00E9couler avant qu'un n\u0153ud cass\u00E9 soit retir\u00E9 du tableau 
undertow.handler.mod-cluster.max-request-time=La dur\u00E9e maximale d'une requ\u00EAte effectu\u00E9e aupr\u00E8s d'un n\u0153ud de backend avant qu'elle soit an\u00E9antie
undertow.handler.mod-cluster.management-access-predicate=Un pr\u00E9dicat appliqu\u00E9 \u00E0 des requ\u00EAtes entrantes pour d\u00E9terminer si elles doivent effectuer des commandes de gestion de mod cluster. Fournit un niveau de s\u00E9curit\u00E9 suppl\u00E9mentaire en plus de ce qui est fourni en limitant la gestion \u00E0 des requ\u00EAtes provenant de management-socket-binding.
undertow.handler.mod-cluster.session-cookie-names=Une liste de noms de cookies des sessions s\u00E9par\u00E9s par des virgules. Normalement JSESSIONSID.
undertow.handler.mod-cluster.connections-per-thread=Le nombre de connexions \u00E0 maintenir dans les serveurs de backend, par thread e/s. La valeur par d\u00E9faut est 10.
undertow.handler.mod-cluster.request-queue-size=Le nombre de requ\u00EAtes pouvant \u00EAtre contenues si le pool de connexions est plein avant que les requ\u00EAtes soient rejet\u00E9es avec erreur 503
undertow.handler.mod-cluster.cached-connections-per-thread=Le nombre de connexions qui seront maintenues live ind\u00E9finiment
undertow.handler.mod-cluster.connection-idle-timeout=La dur\u00E9e pendant laquelle une connexion peut demeurer inactive avant qu'elle soit ferm\u00E9e. Les connexions n'expireront pas une fois que la taille du pool est au niveau minimum configur\u00E9 (voir cached-connections-per-thread)
undertow.handler.mod-cluster.worker=Le worker XNIO utilis\u00E9 pour envoyer des notifications d'annonces
undertow.handler.mod-cluster.ssl-context=R\u00E9f\u00E9rence au contexte SSL qui va \u00EAtre utilis\u00E9 par ce filtre.
undertow.handler.mod-cluster.security-realm=Le domaine de s\u00E9curit\u00E9 qui fournit la configuration SSL
undertow.handler.mod-cluster.security-realm.deprecated=Utiliser l'attribut ssl-context pour r\u00E9f\u00E9rencer un contexte SSL directement.
undertow.handler.mod-cluster.use-alias=Indique si une v\u00E9rification d'alias a lieu
undertow.handler.mod-cluster.enable-http2=Indique si l'\u00E9quilibreur des charges doit tenter de mettre les connexions de backend \u00E0 niveau \u00E0 HTTP2. Si HTTP2 n'est pas pris en charge, HTTP ou HTTPS seront utilis\u00E9s normalement.
undertow.handler.mod-cluster.max-ajp-packet-size=La taille maximale des paquets AJP. L'augmenter permettra \u00E0 AJP de travailler pour des requ\u00EAtes/r\u00E9ponses qui ont un grand montant d'en-t\u00EAtes. C'est une option avanc\u00E9e, et on doit trouver la m\u00EAme chose dans les \u00E9quilibreurs de charge et les serveurs de backend.
undertow.handler.mod-cluster.http2-enable-push=Indique si la transmission de type push doit \u00EAtre \u00E9tablie pour les connexions HTTP/2
undertow.handler.mod-cluster.http2-max-frame-size=La taille de trame HTTP/2 max
undertow.handler.mod-cluster.http2-max-concurrent-streams=Le nombre de flux HTTP/2 pouvant \u00EAtre actifs \u00E0 tout moment sur une simple connexion
undertow.handler.mod-cluster.http2-max-header-list-size=La taille maximale d'en-t\u00EAtes de requ\u00EAtes que le serveur est pr\u00EAt \u00E0 accepter.
undertow.handler.mod-cluster.http2-initial-window-size=La taille de fen\u00EAtre de contr\u00F4le de flux qui contr\u00F4le la vitesse \u00E0 laquelle le client peut envoyer des donn\u00E9es au serveur
undertow.handler.mod-cluster.http2-header-table-size=La taille de la table d'en-t\u00EAtes utilis\u00E9s pour la compression HPACK, en octets. Ce montant de m\u00E9moire sera allou\u00E9 par connexion de compression. Les plus grandes valeurs utilisent un plus grand montant de m\u00E9moire, mais assurent une meilleure compression.
undertow.handler.mod-cluster.balancer=La repr\u00E9sentation de runtime d'un \u00E9quilibreur de charges de mod_cluster
undertow.handler.mod-cluster.balancer.sticky-session-path=Le chemin de la cookie de la sticky session
undertow.handler.mod-cluster.balancer.sticky-session=Indique si les sticky sessions sont activ\u00E9es
undertow.handler.mod-cluster.balancer.sticky-session-cookie=Le nom de la cookie de session
undertow.handler.mod-cluster.balancer.sticky-session-force=Si sur true, une erreur sera renvoy\u00E9e quand la requ\u00EAte n'est pas rout\u00E9e vers le sticky node, sinon, elle sera r\u00E9-achemin\u00E9e vers un autre n\u0153ud.
undertow.handler.mod-cluster.balancer.sticky-session-remove=Supprime le cookie de session si la requ\u00EAte ne peut pas \u00EAtre achemin\u00E9e vers l'h\u00F4te qui convient.
undertow.handler.mod-cluster.balancer.max-attempts=Nombre de tentatives d'envoi de requ\u00EAtes \u00E0 un serveur de backend.
undertow.handler.mod-cluster.balancer.wait-worker=Le nombre de secondes \u00E0 attendre pour qu'un worker soit disponible.
undertow.handler.mod-cluster.max-retries=Le nombre de nouvelles tentatives si une requ\u00EAte \u00E9choue. Notez que si la requ\u00EAte n'est pas consid\u00E9r\u00E9e idempotent, elle ne sera tent\u00E9e \u00E0 nouveau que si le serveur proxy est certain qu'elle n'a pas \u00E9t\u00E9 envoy\u00E9e \u00E0 un serveur de backend).
undertow.handler.mod-cluster.balancer.node=La repr\u00E9sentation de runtime d'un n\u0153ud de mod_cluster
undertow.handler.mod-cluster.balancer.node.context=La repr\u00E9sentation de runtime d'un contexte de mod_cluster
undertow.handler.mod-cluster.balancer.node.context.requests=Le nombre de requ\u00EAtes dans ce contexte
undertow.handler.mod-cluster.balancer.node.context.status=Le statut de ce contexte
undertow.handler.mod-cluster.balancer.node.load=La charge actuelle de ce n\u0153ud
undertow.handler.mod-cluster.balancer.node.elected=Le nombre choisi
undertow.handler.mod-cluster.balancer.node.status=Le statut actuel de ce n\u0153ud
undertow.handler.mod-cluster.balancer.node.disable=D\u00E9sactive tous les contextes sur ce n\u0153ud
undertow.handler.mod-cluster.balancer.node.enable=Active tous les contextes sur ce n\u0153ud
undertow.handler.mod-cluster.balancer.node.stop=Arr\u00EAte tous les contextes sur ce n\u0153ud
undertow.handler.mod-cluster.balancer.node.uri=L'URI que l'\u00E9quilibreur des charges utilise pour se connecter \u00E0 ce n\u0153ud
undertow.handler.mod-cluster.balancer.node.aliases=Les alias de n\u0153uds
undertow.handler.mod-cluster.balancer.node.context.disable=D\u00E9sactive ce contexte
undertow.handler.mod-cluster.balancer.node.context.enable=Active ce contexte
undertow.handler.mod-cluster.balancer.node.context.stop=Arr\u00EAte ce contexte
undertow.handler.mod-cluster.balancer.node.load-balancing-group=Le groupe d'\u00E9quilibreur de charge auquel ce n\u0153ud appartient
undertow.handler.mod-cluster.balancer.node.cache-connections=Le nombre de connexions \u00E0 maintenir live ind\u00E9finiment
undertow.handler.mod-cluster.balancer.node.max-connections=Le nom maximum de connexions par thread IO
undertow.handler.mod-cluster.balancer.node.open-connections=Le nombre actuel de connexions ouvertes
undertow.handler.mod-cluster.balancer.node.ping=Le ping de noeud
undertow.handler.mod-cluster.balancer.node.read=Le nombre d'octets lus par le n\u0153ud
undertow.handler.mod-cluster.balancer.node.timeout=Le d\u00E9lai d'attente de la requ\u00EAte
undertow.handler.mod-cluster.balancer.node.written=Le nombre d'octets transf\u00E9r\u00E9s au n\u0153ud
undertow.handler.mod-cluster.balancer.node.ttl=Les temps de connexion resteront live tant qu'ils n'ont pas de requ\u00EAtes, avant d'\u00EAtre ferm\u00E9es si le nombre de connexions est sup\u00E9rieur aux connexions de cache.
undertow.handler.mod-cluster.balancer.node.flush-packets=Indique si les donn\u00E9es re\u00E7ues doivent \u00EAtre imm\u00E9diatement vid\u00E9es
undertow.handler.mod-cluster.balancer.node.queue-new-requests=Si une requ\u00EAte est re\u00E7ue et qu'aucun worker n'est disponible imm\u00E9diatement, doit-elle rejoindre la file d'attente
undertow.handler.mod-cluster.balancer.node.request-queue-size=La taille de la file d'attente de demandes
undertow.handler.mod-cluster.balancer.load-balancing-group=Un groupe d'\u00E9quilibrage des charges
undertow.handler.mod-cluster.balancer.load-balancing-group.enable-nodes=Active tous les n\u0153uds d'un groupe d'\u00E9quilibrage des charges
undertow.handler.mod-cluster.balancer.load-balancing-group.disable-nodes=D\u00E9sactive tous les n\u0153uds d'un groupe d'\u00E9quilibrage des charges
undertow.handler.mod-cluster.balancer.load-balancing-group.stop-nodes=Stoppe tous les n\u0153uds d'un groupe d'\u00E9quilibrage des charges
undertow.http-invoker=Les services d'invocateur HTTP qui permettent l'invocation de services bas\u00E9s HTTP cmme EJB et Naming
undertow.http-invoker.add=Ajoute le serveur d'invocateur HTTP \u00E0 l'h\u00F4te
undertow.http-invoker.remove=Supprime le service d'invocateur HTTP
undertow.http-invoker.path=Le chemin sous lequel les services sont install\u00E9s
undertow.http-invoker.http-authentication-factory=L'usine d'authentification HTTP \u00E0 utiliser pour l'authentification
undertow.http-invoker.security-realm=Domaine de s\u00E9curit\u00E9 h\u00E9rit\u00E9 \u00E0 utiliser pour l'authentification
