undertow=Undertow-Untersystem
undertow.add=Operation f\u00FCgt Subsystem hinzu
undertow.remove=Operation entfernt Subsystem
undertow.configuration=null
undertow.default-virtual-host=Der standardm\u00E4\u00DFige virtuelle Host f\u00FCr Deployments
undertow.default-servlet-container=Der standardm\u00E4\u00DFige Servlet-Container f\u00FCr Deployments
undertow.default-server=Der standardm\u00E4\u00DFige Server f\u00FCr Deployments
undertow.instance-id=Die Cluster-Instanz-ID
undertow.default-security-domain=Die von Web-Deployments standardm\u00E4\u00DFig verwendete Sicherheitsdomain
undertow.buffer-cache=Der Pufferspeicher zum Cachen von statischen Inhalten
undertow.buffer-cache.add=F\u00FCgt einen Pufferspeicher hinzu
undertow.buffer-cache.remove=Entfernt ein Pufferspeicher
undertow.buffer-cache.name=Der Cache-Name
undertow.buffer-cache.buffer-size=Die Gr\u00F6\u00DFe eines einzelnen Puffers, in Bytes.
undertow.buffer-cache.buffers-per-region=Die Anzahl der Puffer in einer Region
undertow.buffer-cache.max-regions=Die H\u00F6chstanzahl von Regionen
undertow.server=Ein Server
undertow.server.add=F\u00FCgt einen Server hinzu
undertow.server.remove=Entfernt einen Server
undertow.server.name=Der Servername
undertow.server.default-host=Der virtuelle Host des Servers
undertow.server.servlet-container=Der standardm\u00E4\u00DFige Servlet-Container des Servers
undertow.server.http-listener=Ein HTTP-Listener
undertow.server.https-listener=Ein HTTPS-Listener
undertow.server.ajp-listener=Ein AJP-Listener
undertow.server.host=Der Host des Servers
undertow.servlet-container=Ein Servlet-Container
undertow.servlet-container.add=F\u00FCgt einen Servlet-Container hinzu
undertow.servlet-container.remove=Entfernt einen Servlet-Container
undertow.servlet-container.name=Der Servlet-Containername
undertow.servlet-container.default-buffer-cache=Der Pufferspeicher zum Cachen von statischen Ressourcen
undertow.servlet-container.stack-trace-on-error=Ob im Fehlerfall eine Fehlerseite mit Stack Trace generiert werden soll. M\u00F6gliche Werte sind all, none und local-only
undertow.servlet-container.setting=Einstellungen des Servlet-Containers
undertow.servlet-container.persistent-sessions=Ob Servlet-Container Sessions \u00FCber Neu-Deployments hinweg bewahren sollen
undertow.servlet-container.allow-non-standard-wrappers=Falls "true", k\u00F6nnen Anfrage- und Antwort-Wrapper verwendet werden, die nicht die standardm\u00E4\u00DFigen Wrapper-Klassen erweitern
undertow.servlet-container.use-listener-encoding=Kodierung verwenden, die am Listener definiert ist
undertow.servlet-container.ignore-flush=Bereinigungen auf dem Servlet-Ausgabe-Stream ignorieren. In den meisten F\u00E4llen beeintr\u00E4chtigen diese die Performance ohne ersichtlichen Vorteil.
undertow.servlet-container.default-encoding=Standardkodierung f\u00FCr alle bereitgestellten Applikationen
undertow.servlet-container.eager-filter-initialization=Falls "true", ruft Undertow filter init() beim Start des Deployments auf, nicht bei der ersten Anfrage.
undertow.servlet-container.default-session-timeout=Der standardm\u00E4\u00DFige Session-Timeout (in Minuten) f\u00FCr alle Applikationen, die im Container bereitgestellt sind.
undertow.servlet-container.use-global-request-controller=Falls "true", registriert Undertow sich selbst beim globalen Anfrage-Controller. Dies verursacht zwar leichte Performanceeinbu\u00DFen,  erm\u00F6glicht jedoch das ordnungsgem\u00E4\u00DFe Herunterfahren sowie eine globale H\u00F6chstanzahl f\u00FCr aktive Anfragen auf dem Server.
undertow.servlet-container.disable-caching-for-secured-pages=Ob Undertow die Header so einstellen soll, um das Cachen von gesicherten Seiten zu deaktivieren. Eine Deaktivierung kann Sicherheitsprobleme verursachen, da sensible Seiten von einem Proxy-Server gecacht werden k\u00F6nnen.
undertow.servlet-container.mime-mapping=Servlet MIME-Mapping-Konfiguration
undertow.servlet-container.welcome-file=Eine Begr\u00FC\u00DFungsdatei
undertow.servlet-container.directory-listing=Ob Verzeichnislisting f\u00FCr Standard-Servlets aktiviert sein soll.
undertow.servlet-container.proactive-authentication=Ob proaktive Authentifizierung verwendet werden soll. Falls "true", wird ein Benutzer immer authentifiziert, wenn Berechtigungsnachweise vorliegen.
undertow.servlet-container.session-id-length=Die L\u00E4nge der generierten Session-ID. L\u00E4ngere Session-IDs sind sicherer. Diese Zahl bezieht sich auf die Anzahl zuf\u00E4lliger Bytes, die zum Generieren der Session-ID verwendet werden. Die eigentliche ID, die an den Client gesendet wird, ist base64-kodiert und ist infolgedessen etwa 33% l\u00E4nger (z.B. resultiert eine ID-L\u00E4nge von 30 in einer Cookie-Wertl\u00E4nge von 40).
undertow.servlet-container.max-sessions=Die H\u00F6chstzahl von Sessions, die gleichzeitig aktiv sein k\u00F6nnen.
undertow.servlet-container.disable-file-watch-service=Falls "true" wird der Datei\u00FCberwachungsdienst keine entpackten Deployments auf \u00C4nderungen \u00FCberwachen
undertow.mime-mapping=Die MIME-Mapping-Konfiguration des Servlet-Containers
undertow.mime-mapping.add=F\u00FCgt ein MIME-Mapping hinzu
undertow.mime-mapping.remove=Entfernt ein MIME-Mapping
undertow.mime-mapping.value=Der MIME-Typ f\u00FCr dieses Mapping
undertow.welcome-file=Die Begr\u00FC\u00DFungsdatei
undertow.welcome-file.add=F\u00FCgt eine Begr\u00FC\u00DFungsdatei hinzu
undertow.welcome-file.remove=Entfernt eine Begr\u00FC\u00DFungsdatei
undertow.error-page=Server-Fehlerseiten
undertow.handler=Undertow-Handler
undertow.handler.add=F\u00FCgt das Handler-Element hinzu
undertow.handler.remove=Entfernt das Handler-Element
undertow.handler.name=Der Handler-Name
undertow.filter=Undertow-Filter
undertow.filter.add=F\u00FCgt das Filter-Element hinzu
undertow.filter.remove=Entfernt das Filter-Element
undertow.filter.name=Der Filtername
undertow.ajp-listener=Ein AJP-Listener
undertow.ajp-listener.add=F\u00FCgt einen AJP-Listener hinzu
undertow.ajp-listener.remove=Entfernt einen AJP-Listener
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.access-log=Die Konfiguration des Zugriffsprotokolls f\u00FCr diesen virtuellen Server.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.access-log.add=Zugriffsprotokoll-Konfiguration f\u00FCr diesen virtuellen Server hinzuf\u00FCgen.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.access-log.remove=Zugriffsprotokoll-Konfiguration von diesem virtuellen Server entfernen.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author jdimanos
undertow.access-log.pattern=Das Zugriffsprotokollmuster.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.access-log.prefix=Pr\u00E4fix f\u00FCr den Protokolldateinamen.
undertow.access-log.suffix=Suffix f\u00FCr den Protokolldateinamen.
undertow.access-log.directory=Verzeichnis zur Speicherung der Protokolle
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.access-log.rotate=Zugriffsprotokoll t\u00E4glich rotieren.
undertow.access-log.worker=Name des Workers zur Protokollierung
undertow.access-log.use-server-log=Ob das Protokoll in das Serverprotokoll geschrieben werden soll, statt in eine separate Datei.
undertow.access-log.relative-to=Das Verzeichnis, zu dem der Pfad relativ ist
undertow.access-log.extended=Ob das Protokoll das erweiterte Protokolldateiformat verwendet
undertow.access-log.predicate=Pr\u00E4dikat, das festlegt, ob die Anfrage protokolliert werden soll
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.single-sign-on.domain=Die zu verwendende Cookie-Domain.
undertow.single-sign-on.path=Cookie-Pfad.
undertow.single-sign-on.http-only=httpOnly-Attribut f\u00FCr Cookie festlegen.
undertow.single-sign-on.secure=secure-Attribut f\u00FCr Cookie festlegen.
undertow.single-sign-on.cookie-name=Name des Cookies
undertow.listener=HTTP-Listener
undertow.listener.add=Listener hinzuf\u00FCgen
undertow.listener.remove=Listener-Name
undertow.listener.name=Der Listener-Name
undertow.listener.socket-binding=Das Socket-Binding des Listeners
undertow.listener.worker=Der XNIO-Worker des Listeners
undertow.listener.buffer-pool=Der Pufferpool des Listeners
undertow.listener.enabled=Ob der Listener aktiviert ist
undertow.listener.enabled.deprecated=Aktivierte Attribute gelten als veraltet, da sie Probleme beim Erzwingen der Konfigurationskonsistenz verursachen
undertow.listener.scheme=Das Listener-Schema, kann HTTP oder HTTPS sein. Standardm\u00E4\u00DFig wird das Schema der eingehenden AJP-Anfrage entnommen.
undertow.listener.certificate-forwarding=Ob die Zertifikatsweiterleitung aktiviert sein soll. Falls aktiviert, \u00FCbernimmt der Listener das Zertifikat vom SSL_CLIENT_CERT-Attribut. Dies sollte nur aktiviert werden, falls hinter einem Proxy und falls der Proxy konfiguriert ist, diese Header immer einzustellen.
undertow.listener.ssl-context=Referenz zum SSLContext, der von diesem Listener verwendet werden soll.
undertow.listener.security-realm=Der Sicherheitsbereich des Listeners
undertow.listener.security-realm.deprecated=Verwenden Sie das Attribut ssl-context, um direkt einen konfigurierten SSLContext zu referenzieren.
undertow.listener.max-post-size=Die maximale Gr\u00F6\u00DFe eines akzeptierten Beitrags, in Bytes.
undertow.listener.buffer-pipelined-data=Ob ausstehende Anfragen gepuffert werden sollen.
undertow.listener.allow-encoded-slash=Ob in einer Anfrage mit kodierten / Zeichen (d.h. %2F) diese Zeichen dekodiert werden sollen.
undertow.listener.decode-url=Falls "true", dekodiert der Parser die URL und Anfrageparameter unter Verwendung der gew\u00E4hlten Zeichenkodierung (standardm\u00E4\u00DFig UTF-8). Falls "false", werden sie nicht dekodiert. Dies erm\u00F6glicht es einem sp\u00E4teren Handler, sie in einen anderen gew\u00FCnschten Zeichensatz zu dekodieren.
undertow.listener.url-charset=URL-Zeichensatz
undertow.listener.max-header-size=Die maximale Gr\u00F6\u00DFe eines HTTP-Anfrage-Headers, in Bytes.
undertow.listener.max-headers=Die maximale Anzahl von Headern, die geparst werden. Dies dienst dem Schutz vor Hash-Schwachstellen.
undertow.listener.max-cookies=Die maximale Anzahl von Cookies, die geparst werden. Dies dienst dem Schutz vor Hash-Schwachstellen.
undertow.listener.max-parameters=Die maximale Anzahl von Parametern, die geparst werden. Dies dienst dem Schutz vor Hash-Schwachstellen. Dies gilt sowohl f\u00FCr Anfrageparameter als auch f\u00FCr POST-Daten, ist jedoch nicht kumulativ (d.h. Sie k\u00F6nnen potenziell maximale Parameter * 2 Gesamtparameter haben).
undertow.listener.verify-client=Der gew\u00FCnschte SSL-Client-Authentifizierungsmodus f\u00FCr SSL-Channel
undertow.listener.verify-client.deprecated=Wo ein SSLContext referenziert wird, sollte er direkt konfiguriert werden f\u00FCr den erforderlichen Modus der Client-Authentifizierung.
undertow.listener.always-set-keep-alive=Falls "true", wird ein Connection\: keep-alive Header zu Antworten hinzugef\u00FCgt, selbst wenn dies nicht von der Spezifikation erfordert wird.
undertow.listener.redirect-socket=Falls dieser Listener nicht-SSL-Anfragen unterst\u00FCtzt und eine Anfrage eingeht, f\u00FCr die eine entsprechende <security-constraint> eine SSL-\u00DCbertragung erfordert, wird Undertow die Anfrage automatisch an den hier festgelegten Socket-Binding-Port weiterleiten.
undertow.listener.enabled-cipher-suites=Konfiguriert aktivierte SSL-Algorithmen
undertow.listener.enabled-cipher-suites.deprecated=Wo ein SSLContext referenziert wird, sollte er konfiguriert werden mit den unterst\u00FCtzten Cipher Suites.
undertow.listener.enabled-protocols=Konfiguriert SSL-Protokolle
undertow.listener.enabled-protocols.deprecated=Wo ein SSLContext referenziert wird, sollte er konfiguriert werden mit den unterst\u00FCtzten Protkollen.
undertow.listener.max-buffered-request-size=Maximale Gr\u00F6\u00DFe einer gepufferten Anfrage in Bytes. Anfragen werden normalerweise nicht gepuffert, h\u00E4ufig erfolgt die Pufferung jedoch bei der SSL-Neuverhandlung f\u00FCr eine POST-Anfrage; die POST-Daten m\u00FCssen vollst\u00E4ndig gepuffert werden, um die Neuverhandlung durchf\u00FChren zu k\u00F6nnen.
undertow.listener.record-request-start-time=Falls "true", zeichnet Undertow die Startzeit der Anfrage auf, um die Protokollierung der Anfragezeit zu erm\u00F6glichen. Dies hat einen kleinen, aber messbaren Performance-Nachteil.
undertow.listener.allow-equals-in-cookie-value=Falls "true", erlaubt Undertow Gleichheitszeichen ohne Fluchtzeichen in Cookie-Werten ohne Anf\u00FChrungszeichen. Cookie-Werte ohne Anf\u00FChrungszeichen d\u00FCrfen keine Gleichheitszeichen enthalten. Falls vorhanden, endet der Wert vor dem Gleichheitszeichen. Der Rest des Cookies wird verworfen.
undertow.listener.no-request-timeout=Die Zeitspanne in Millisekunden, die eine Verbindung unt\u00E4tig sein darf, ehe sie vom Container geschlossen wird.
undertow.listener.request-parse-timeout=Die maximale Zeitspanne (in Millisekunden), die das Parsen der Anfrage dauern darf
undertow.listener.receive-buffer=Die Gr\u00F6\u00DFe des Empfangspuffer in Bytes.
undertow.listener.send-buffer=Die Gr\u00F6\u00DFe des Sendepuffers, in Bytes.
undertow.listener.max-connections=Die maximale Anzahl gleichzeitiger Verbindungen. Ausschlie\u00DFlich Werte \u00FCber 0 sind zul\u00E4ssig. F\u00FCr eine unbegrenzte Verbindungsanzahl lassen Sie diesen Attributwert undefiniert.
undertow.listener.tcp-backlog=Einen Server mit dem angegebenen Backlog konfigurieren.
undertow.listener.tcp-keep-alive=Einen Channel zum Senden von TCP-Keep-Alive-Nachrichten auf implementationsunabh\u00E4ngige Weise konfigurieren.
undertow.listener.read-timeout=Einen Lese-Timeout f\u00FCr einen Socket konfigurieren (in Millisekunden). Falls die angegebene Zeitspanne abl\u00E4uft, ohne dass ein erfolgreicher Lesevorgang stattfindet, gibt der n\u00E4chste Lesevorgang des Sockets eine {@link ReadTimeoutException} aus.
undertow.listener.write-timeout=Einen Schreib-Timeout f\u00FCr einen Socket konfigurieren (in Millisekunden). Falls die angegebene Zeitspanne abl\u00E4uft, ohne dass ein erfolgreicher Schreibvorgang stattfindet, gibt der n\u00E4chste Schreibvorgang des Sockets eine {@link WriteTimeoutException} aus.
undertow.listener.resolve-peer-address=Aktiviert Host-DNS-Lookup
undertow.listener.enable-connector-statistics=Ob Connector-Statistiken aktiviert sein sollen. Dies erm\u00F6glicht Zugriff auf Statistiken, bringt jedoch gewisse Performance-Nachteile mit sich.
undertow.listener.request-count=Die Anzahl von Anfragen, die dieser Listener bedient hat
undertow.listener.bytes-sent=Die Anzahl von Bytes, die von diesem Listener gesendet wurden
undertow.listener.bytes-received=Die Anzahl von Bytes, die von diesem Listener empfangen wurden
undertow.listener.error-count=Die Anzahl von 500-Antworten, die von diesem Listener gesendet wurden
undertow.listener.processing-time=Die gesamte Verarbeitungszeit aller Anfragen, die von diesem Listener gehandhabt wurden
undertow.listener.max-processing-time=Die maximale Verarbeitungszeit, die eine Anfrage auf diesem Listener erforderte
undertow.listener.reset-statistics=Setzt alle Connector-Statistiken auf Null
undertow.listener.enable-http2=Aktiviert HTTP2-Unterst\u00FCtzung f\u00FCr diesen Listener
undertow.listener.enable-spdy=Aktiviert SPDY-Unterst\u00FCtzung f\u00FCr diesen Listener. Dies gilt als veraltet und hat keinerlei Auswirkungen. Stattdessen sollte HTTP/2 verwendet werden
undertow.listener.enable-spdy.deprecated=SPDY wurde ersetzt durch HTTP/2
undertow.listener.disallowed-methods=Eine kommagetrennte Liste von unzul\u00E4ssigen HTTP-Methoden
undertow.listener.ssl-session-cache-size=Die maximale Anzahl aktiver SSL-Sessions
undertow.listener.ssl-session-timeout=Der Timeout f\u00FCr SSL-Sessions in Sekunden
undertow.listener.secure=Falls "true", werden Anfragen, die von diesem Listener stammen, als sicher gekennzeichnet, selbst wenn die Anfrage kein HTTPS verwendet.
undertow.listener.max-ajp-packet-size=Die maximal unterst\u00FCtzte Gr\u00F6\u00DFe von AJP-Paketen. Falls diese ver\u00E4ndert wird, muss sie auf dem Lastverteiler und dem Backend-Server erh\u00F6ht werden.
undertow.listener.http2-enable-push=Ob Server-Push f\u00FCr diese Verbindung aktiviert ist
undertow.listener.http2-max-frame-size=Die maximale HTTP/2 Frame-Gr\u00F6\u00DFe
undertow.listener.http2-max-concurrent-streams=Die maximale Anzahl von HTTP/2 Streams, die auf einer einzelnen Verbindung gleichzeitig aktiv sein k\u00F6nnen
undertow.listener.http2-max-header-list-size=Die maximale Gr\u00F6\u00DFe von Anfrage-Headern, die der Server bereit ist zu akzeptieren
undertow.listener.http2-initial-window-size=Die Fenstergr\u00F6\u00DFe der Flusskontrolle, die steuert, wie schnell der Client Daten zum Server senden kann
undertow.listener.http2-header-table-size=Die Gr\u00F6\u00DFe der Header-Tabelle, die zur HPACK-Komprimierung verwendet wird, in Bytes. Diese Speichermenge wird pro Verbindung f\u00FCr die Komprimierung reserviert. Gr\u00F6\u00DFere Werte brauchen mehr Speicher, erreichen jedoch m\u00F6glicherweise eine bessere Komprimierung.
undertow.host=Ein Undertow-Host
undertow.host.add=F\u00FCgt einen neuen Host hinzu
undertow.host.remove=Entfernt einen Host
undertow.host.name=Der Host-Name
undertow.host.alias=Aliasse f\u00FCr den Host
undertow.host.default-web-module=Standardm\u00E4\u00DFiges Webmodul
undertow.host.setting=Einstellungen
undertow.host.default-response-code=Falls eingestellt, wird dieser Antwortcode zur\u00FCckgeschickt, falls der angefragte Kontext nicht auf dem Server existiert.
undertow.host.disable-console-redirect=Falls "true", ist die /console Weiterleitung f\u00FCr diesen Host nicht aktiviert. Standard ist "false"
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author jdimanos
undertow.setting.jsp=JSP-Container-Konfiguration.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author jdimanos
undertow.setting.jsp.add=F\u00FCgt JSP-Container-Konfiguration hinzu.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author jdimanos
undertow.setting.jsp.remove=Entfernt JSP-Container-Konfiguration.
undertow.setting.jsp.development=Entwicklungsmodus aktivieren, was das Neuladen von JSP im laufenden Betrieb erm\u00F6glicht
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author jdimanos
undertow.setting.jsp.disabled=Den JSP-Container deaktivieren.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author jdimanos
undertow.setting.jsp.keep-generated=Die generierten Servlets behalten.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.setting.jsp.trim-spaces=\u00DCberfl\u00FCssige Leerzeichen aus den generierten Servlets entfernen.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.setting.jsp.tag-pooling=Tag-Pooling aktivieren.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.setting.jsp.mapped-file=Zur JSP-Quelle mappen.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.setting.jsp.modification-test-interval=Mindest-Zeitabstand zwischen zwei Pr\u00FCfungen auf Aktualisierungen, in Sekunden.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author jdimanos
undertow.setting.jsp.recompile-on-fail=Wiederversuch schlug bei jeder Anfrage f\u00FCr JSP-Kompilierungen fehl.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author jdimanos
undertow.setting.jsp.smap=SMAP aktivieren.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author jdimanos
undertow.setting.jsp.dump-smap=SMAP-Daten in eine Datei schreiben.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author jdimanos
undertow.setting.jsp.generate-strings-as-char-arrays=String-Konstanten als char-Arrays generieren.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.setting.jsp.error-on-use-bean-invalid-class-attribute=Fehler aktivieren bei Verwendung einer fehlerhaften Klasse in useBean.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.setting.jsp.scratch-dir=Festlegen eines anderen Arbeitsverzeichnisses.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.setting.jsp.source-vm=Quell-VM-Ebene f\u00FCr die Kompilierung.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.setting.jsp.target-vm=Ziel-VM-Ebene f\u00FCr die Kompilierung.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.setting.jsp.java-encoding=Festlegen der f\u00FCr Java-Quellen verwendete Verschl\u00FCsselung. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author Hedda Peters
undertow.setting.jsp.x-powered-by=Aktivieren der JSP Engine Werbung in x-powered-by.
undertow.setting.jsp.display-source-fragment=Wenn ein Laufzeitfehler auftritt, zugeh\u00F6riges JSP-Quellfragment anzuzeigen versuchen.
undertow.setting.jsp.optimize-scriptlets=Ob JSP-Scriptlets optimiert werden sollen, um Stringk\u00FCrzungen zu vermeiden
undertow.setting.session-cookie=Session-Cookie-Konfiguration
undertow.setting.session-cookie.add=Session-Cookie-Konfiguration hinzuf\u00FCgen
undertow.setting.session-cookie.remove=Session-Cookie-Konfiguration entfernen
undertow.setting.session-cookie.name=Name des Cookies
undertow.setting.session-cookie.http-only=Ist das Cookie "http-only"
undertow.setting.session-cookie.secure=Ist das Cookie sicher?
undertow.setting.session-cookie.domain=Cookie-Domain
undertow.setting.session-cookie.comment=Cookie-Kommentar
undertow.setting.session-cookie.max-age=Maximales Alter des Cookies
undertow.setting.persistent-sessions=Session-Persistenz-Sessions
undertow.setting.persistent-sessions.enabled=Falls "true", werden persistente Sessions aktiviert
undertow.setting.persistent-sessions.add=F\u00FCgt die persistente Sessions-Ressource hinzu
undertow.setting.persistent-sessions.remove=Entfernt die persistente Sessions-Ressource
undertow.setting.persistent-sessions.path=Der Pfad zum Verzeichnis der persistenten Sessiondaten. Falls null, werden Sessions im Arbeitsspeicher bewahrt
undertow.setting.persistent-sessions.relative-to=Das Verzeichnis, zu dem der Pfad relativ ist
undertow.handler.simple-error-page=Konfiguration der einfachen Fehlerseite
undertow.setting.websockets=Ob Websockets f\u00FCr diesen Container aktiviert sind
undertow.setting.websockets.add=F\u00FCgt Websockets-Support hinzu
undertow.setting.websockets.remove=Entfernt Websockets-Support
undertow.setting.websockets.dispatch-to-worker=Ob Callbacks an einen Worker-Thread \u00FCbergeben werden. Falls "false", werden diese im IO-Thread ausgef\u00FChrt, was schneller ist; allerdings muss sichergestellt werden, dass keine sperrenden Operationen ausgef\u00FChrt werden.
undertow.setting.websockets.worker=Der Worker f\u00FCr Websocket-Deployments
undertow.setting.websockets.buffer-pool=Der Pufferpool f\u00FCr Websocket-Deployments
undertow.setting.websockets.per-message-deflate=Aktiviert die Komprimierungserweiterung auf Nachrichtenbasis f\u00FCr Websockets, RFC-7692
undertow.setting.websockets.deflater-level=Konfiguriert die Komprimierungsrate des DEFLATE-Algorithmus
undertow.setting.crawler-session-management.session-timeout=Der Session-Timeout f\u00FCr Sessions, die Crawlern geh\u00F6ren
undertow.handler.simple-error-page.add=F\u00FCgt einfache Fehlerseite hinzu
undertow.handler.simple-error-page.remove=Entfernt einfache Fehlerseite
undertow.handler.simple-error-page.name=Name der Fehlerseite
undertow.handler.simple-error-page.code=Fehlercode
undertow.handler.file=Datei-Handler
undertow.handler.file.add=Datei-Handler hinzuf\u00FCgen
undertow.handler.file.remove=Datei-Handler entfernen
undertow.handler.file.name=Name des Datei-Handlers
undertow.handler.file.path=Pfad im Dateisystem, vom dem der Datei-Handler Ressourcen bereitstellt
undertow.handler.file.cache-buffer-size=Gr\u00F6\u00DFe der Puffer in Bytes
undertow.handler.file.cache-buffers=Anzahl der Puffer
undertow.handler.file.directory-listing=Verzeichnislisting aktivieren?
undertow.handler.file.follow-symlink=Folgen von symbolischen Links aktivieren
undertow.handler.file.safe-symlink-paths=Pfade, die sichere Ziele f\u00FCr symbolische Links sind
undertow.handler.file.case-sensitive=Gro\u00DF- und Kleinschreibung bei Dateihandhabung beachten
undertow.handler.reverse-proxy=Ein Reverse-Proxy-Handler
undertow.handler.reverse-proxy.add=F\u00FCgt einen Reverse-Proxy-Handler hinzu
undertow.handler.reverse-proxy.remove=Entfernt einen Reverse-Proxy-Handler
undertow.handler.reverse-proxy.problem-server-retry=Zeit in Sekunden, die gewartet wird, ehe ein Neuversuch zur Verbindung mit einem inaktiven Server unternommen wird
undertow.handler.reverse-proxy.sticky-session-lifetime=Zeit in Minuten, die Sticky-Session-Daten bewahrt werden
undertow.handler.reverse-proxy.session-cookie-names=Kommagetrennte Liste mit Session-Cookie-Namen. Im Allgemeinen ist dies nur JSESSIONID.
undertow.handler.reverse-proxy.max-request-time=Die maximale Zeit, die eine Proxy-Anfrage aktiv sein kann, bevor sie abgebrochen wird.
undertow.handler.reverse-proxy.connections-per-thread=Die Anzahl der Verbindungen pro IO-Thread, die zu Backend-Servern aufrecht erhalten werden.
undertow.handler.reverse-proxy.request-queue-size=Die Anzahl der Anfragen, die in die Warteschlange platziert werden k\u00F6nnen, wenn der Verbindungspool voll ist, bevor Anfragen mit einem 503-Fehler abgelehnt werden
undertow.handler.reverse-proxy.host=Ein Host, an den der Reverse-Proxy Anfragen weiterleiten wird
undertow.handler.reverse-proxy.host.instance-id=Die Instanzen-ID (auch JVM-Route genannt) die zum Aktivieren von Sticky-Sessions verwendet wird
undertow.handler.reverse-proxy.host.outbound-socket-binding=Ausgehendes Socket-Binding f\u00FCr diesen Host
undertow.handler.reverse-proxy.host.scheme=Welche Art von Schema verwendet wird
undertow.handler.reverse-proxy.host.path=Optionaler Pfad, falls Host eine Nicht-Root-Ressource verwendet
undertow.handler.reverse-proxy.cached-connections-per-thread=Die Anzahl der Verbindungen, die zeitlich unbegrenzt aktiv gehalten werden.
undertow.handler.reverse-proxy.connection-idle-timeout=Die Zeitspanne, die eine Verbindung unt\u00E4tig sein darf, ehe sie geschlossen wird. Verbindungen unterliegen keinem Timeout, sobald die Poolgr\u00F6\u00DFe auf das konfigurierte Minimum abgesunken ist (konfiguriert von cached-connections-per-thread)
undertow.handler.reverse-proxy.host.add=F\u00FCgt einen Reverse-Proxy-Handler-Host hinzu
undertow.handler.reverse-proxy.host.remove=Entfernt einen Reverse-Proxy-Handler-Host
undertow.handler.reverse-proxy.host.security-realm=Der Sicherheitsbereich, der die SSL-Konfiguration f\u00FCr die Verbindung zum Host bereitstellt
undertow.handler.reverse-proxy.host.ssl-context=Referenz zum SSLContext, der von diesem Handler verwendet werden soll.
undertow.handler.reverse-proxy.host.security-realm.deprecated=Verwenden Sie das Attribut ssl-context, um direkt einen konfigurierten SSLContext zu referenzieren.
undertow.handler.reverse-proxy.max-retries=Die Anzahl der Neuversuche f\u00FCr einen fehlgeschlagenen Aufruf. Beachten Sie, dass ein Aufruf, der als idempotent gilt, nur erneut versucht wird, falls der Proxy sichergehen kann, dass er nicht an den Backend-Server geschickt wurde.
undertow.filter.basic-auth=Grundlegende Authentifizierungskonfiguration
undertow.filter.basic-auth.add=Grundlegende Authentifizierung hinzuf\u00FCgen
undertow.filter.basic-auth.remove=Grundlegende Authentifizierung entfernen
undertow.filter.basic-auth.name=Name des Filters
undertow.filter.basic-auth.security-domain=Sicherheitsdomain
undertow.filter.connection-limit=Handler f\u00FCr Begrenzung gleichzeitiger Anfragen. Veralteter Name f\u00FCr die Ressource request-limit.
undertow.filter.connection-limit.add=Anfragebegrenzung hinzuf\u00FCgen
undertow.filter.connection-limit.remove=Entfernt Begrenzung
undertow.filter.connection-limit.name=Name des Handlers
undertow.filter.connection-limit.max-concurrent-requests=Maximale Anzahl gleichzeitiger Anfragen
undertow.filter.connection-limit.queue-size=Anzahl der Anfragen, die in die Warteschlange platziert werden, bevor Anfragen abgewiesen werden
undertow.filter.request-limit=Handler f\u00FCr Begrenzung gleichzeitiger Anfragen
undertow.filter.request-limit.add=Anfragebegrenzung hinzuf\u00FCgen
undertow.filter.request-limit.remove=Entfernt Begrenzung
undertow.filter.request-limit.name=Name des Handlers
undertow.filter.request-limit.max-concurrent-requests=Maximale Anzahl gleichzeitiger Anfragen
undertow.filter.request-limit.queue-size=Anzahl der Anfragen, die in die Warteschlange platziert werden, bevor Anfragen abgewiesen werden
undertow.filter.response-header=Filter f\u00FCr Antworten-Header erm\u00F6glicht Ihnen das Hinzuf\u00FCgen von angepassten Headern.
undertow.filter.response-header.add=F\u00FCgt Filter hinzu
undertow.filter.response-header.remove=Entfernt Filter
undertow.filter.response-header.name=Name des Filters
undertow.filter.response-header.header-name=Header-Name
undertow.filter.response-header.header-value=Wert f\u00FCr Header
undertow.filter.gzip=Definiert gzip-Filter
undertow.filter.gzip.add=F\u00FCgt Filter hinzu
undertow.filter.gzip.remove=Entfernt Filter
undertow.filter.gzip.name=Name des Filters
undertow.filter.error-page=Die Fehlerseiten
undertow.filter.error-page.add=F\u00FCgt eine Fehlerseite hinzu
undertow.filter.error-page.remove=Entfernt eine Fehlerseite
undertow.filter.error-page.name=Name der Fehlerseite
undertow.filter.error-page.code=Fehlerseiten-Code
undertow.filter.error-page.path=Fehlerseiten-Pfad
undertow.filter.custom-filter=Angepasster Filter
undertow.filter.custom-filter.add=Angepassten Filter hinzuf\u00FCgen
undertow.filter.custom-filter.remove=Angepassten Filter entfernen
undertow.filter.custom-filter.class-name=Klassenname von HttpHandler
undertow.filter.custom-filter.module=Name des Moduls, von dem die Klasse geladen werden kann
undertow.filter.custom-filter.parameters=Filterparameter
undertow.filter.expression-filter=Ein von der Undertow-Ausdruckssprache geparster Filter
undertow.filter.expression-filter.add=Einen von der Undertow-Ausdruckssprache geparsten Filter hinzuf\u00FCgen
undertow.filter.expression-filter.remove=Ausdrucksfilter entfernen
undertow.filter.expression-filter.expression=Der Ausdruck, der den Filter definiert
undertow.filter.expression-filter.module=Modul, das zum Laden der Filterdefinitionen verwendet werden soll
undertow.filter.rewrite=Ein Umschreibungs- (oder Umleitungs-)Filter
undertow.filter.rewrite.add=Einen Umschreibungsfilter hinzuf\u00FCgen
undertow.filter.rewrite.remove=Einen Umschreibungsfilter entfernen
undertow.filter.rewrite.target=Der Ausdruck, der das Ziel definiert. Falls Sie zu einem konstanten Ziel umleiten, schlie\u00DFen Sie den Wert in einfache Anf\u00FChrungszeichen ein
undertow.filter.rewrite.redirect=Falls "true", erfolgt eine Umleitung statt einer Umschreibung
undertow.host.location=Enth\u00E4lt die Konfiguration der location-Ressource
undertow.host.location.add=Neuen Speicherort hinzuf\u00FCgen
undertow.host.location.remove=Diesen Speicherort entfernen
undertow.host.location.name=Name des Speicherorts, fungiert als Kontextpfad
undertow.host.location.handler=Standard-Handler f\u00FCr diesen Speicherort
undertow.host.location.filter-ref=Referenz zum Filter
undertow.host.filter-ref=Referenz zum Filter
undertow.filter-ref=Referenz zum Filter
undertow.filter-ref.add=Neue Referenz hinzuf\u00FCgen
undertow.filter-ref.remove=Gew\u00E4hlte Referenz entfernen
undertow.filter-ref.name=Referenz zu welchem Filter
undertow.filter-ref.predicate=Pr\u00E4dikate bieten einen einfachen Weg zum F\u00E4llen von true/false-Entscheidungen basierend auf einem Austausch. Viele Handler erfordern, dass sie bedingt angewendet werden, und Pr\u00E4dikate bieten einen allgemeinen Weg zum Festlegen einer Bedingung.
undertow.filter-ref.priority=Definiert die Filterreihenfolge. Sollte auf 1 oder h\u00F6her gesetzt werden; h\u00F6here Zahlen weisen den Server an, fr\u00FCher in der Handler-Kette einbezogen zu werden als andere mit demselben Kontext.
undertow.application-security-domain=Ein Mapping von einer Sicherheitsdomain, die in einer deployten Applikation referenziert ist
undertow.application-security-domain.add=F\u00FCgen Sie ein neues Sicherheitsdomain-Mapping hinzu zur Referenzierung durch die Applikation
undertow.application-security-domain.remove=Entfernen Sie ein neues Sicherheitsdomain-Mapping zur Referenzierung durch die Applikation
undertow.application-security-domain.http-authentication-factory=Die HTTP-Authentifizierungs-Factory zur Verwendung durch Deployments, die diese gemappte Sicherheitsdomain referenzieren
undertow.application-security-domain.override-deployment-config=Ob die Authentifizierungs-Konfiguration im Deployment durch die Factory au\u00DFer Kraft gesetzt werden soll.
undertow.application-security-domain.referencing-deployments=Die Deployments, die derzeit dieses Mapping referenzieren
undertow.deployment.context-root=Der Kontext-Root der Web-Anwendung
undertow.deployment.virtual-host=Der Name des virtuellen Hosts auf dem die Web-Anwendung bereitgestellt wird
undertow.deployment.server=Der Name des Servers, zu dem diese Anwendung geh\u00F6rt
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author jdimanos
undertow.deployment.active-sessions=Anzahl aktiver Sessions.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author jdimanos
undertow.deployment.expired-sessions=Anzahl abgelaufener Sessions.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author jdimanos
undertow.deployment.rejected-sessions=Anzahl abgewiesener Sessions.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author jdimanos
undertow.deployment.max-active-sessions=Maximal zul\u00E4ssige Anzahl gleichzeitiger Sessions, die dieser Session-Manager unterst\u00FCtzt
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-web/org/jboss/as/web/LocalDescriptions, author jdimanos
undertow.deployment.sessions-created=Die Gesamtzahl von Sessions
undertow.deployment.duplicated-session-ids=Anzahl der duplizierten Session-IDs durch den Zufalls-Quelle generiert (alles gr\u00F6\u00DFer als 0 bedeutet Probleme)
undertow.deployment.session-avg-alive-time=Durchschnittliche Zeit (in Sekunden), f\u00FCr die die abgelaufenen Sitzungen aktiv waren
undertow.deployment.session-max-alive-time=L\u00E4ngste Zeit (in Sekunden), f\u00FCr die die abgelaufenen Sitzungen aktiv waren
undertow.deployment.servlet.servlet-name=Name des Servlets
undertow.deployment.servlet.servlet-class=Klasse des Servlets
undertow.deployment.servlet.min-request-time=Mindestzeit zur Anfrageverarbeitung
undertow.deployment.servlet.max-request-time=H\u00F6chstzeit zur Anfrageverarbeitung
undertow.deployment.servlet.total-request-time=Gesamtzeit aufgewendet zur Verarbeitung aller Anfragen
undertow.deployment.servlet.request-count=Anzahl aller Anfragen
undertow.deployment.servlet.mappings=Servlet-Mappings
undertow.deployment.websocket.endpoint-class=Die Endpunkt-Klasse
undertow.deployment.websocket.path=Der Pfad, auf dem der Endpunkt bereitgestellt wird
undertow.filter.mod-cluster=Ein mod-cluster Frontend-Lastverteiler
undertow.handler.mod-cluster=Ein mod-cluster Frontend-Lastverteiler
undertow.handler.mod-cluster.add=F\u00FCgt einen mod-proxy Frontend-Lastverteiler hinzu
undertow.handler.mod-cluster.remove=Entfernt einen mod-proxy Proxy-Handler
undertow.handler.mod-cluster.security-key=Der Sicherheitsschl\u00FCssel, der f\u00FCr die mod-cluster-Gruppe verwendet wird. Alle Mitglieder m\u00FCssen denselben Sicherheitsschl\u00FCssel verwenden.
undertow.handler.mod-cluster.advertise-protocol=Das verwendete Protokoll.
undertow.handler.mod-cluster.advertise-path=Der Pfad, unter dem mod-cluster registriert ist.
undertow.handler.mod-cluster.advertise-frequency=Die Frequenz (in Millisekunden), mit der mod-cluster Advertise-Nachrichten auf dem Netzwerk sendet
undertow.handler.mod-cluster.health-check-interval=Die Frequenz von Pr\u00FCf-Pings (Health Checks) an Backend-Knoten
undertow.handler.mod-cluster.broken-node-timeout=Die Anzahl der Minuten, die verstreichen m\u00FCssen, bevor ein ausgefallener Knoten aus der Tabelle entfernt wird
undertow.handler.mod-cluster.max-request-time=Die maximale Zeitspanne, die eine Anfrage an einen Backend-Knoten dauern darf, bevor sie beendet wird
undertow.handler.mod-cluster.management-access-predicate=Ein Pr\u00E4dikat, das auf eingehende Anfragen angewendet wird, um zu entscheiden, ob diese mod_cluster-Managementbefehle ausf\u00FChren d\u00FCrfen. Dies bietet zus\u00E4tzliche Sicherheit zus\u00E4tzlich zur Einschr\u00E4nkung des Managements auf Ressourcen, die vom Management-Socket-Binding kommen
undertow.handler.mod-cluster.session-cookie-names=Kommagetrennte Liste mit Session-Cookie-Namen. Im Allgemeinen ist dies nur JSESSIONID.
undertow.handler.mod-cluster.connections-per-thread=Die Anzahl der Verbindungen pro IO-Thread, die zu Backend-Servern aufrecht erhalten werden.
undertow.handler.mod-cluster.request-queue-size=Die Anzahl der Anfragen, die in die Warteschlange platziert werden k\u00F6nnen, wenn der Verbindungspool voll ist, bevor Anfragen mit einem 503-Fehler abgelehnt werden
undertow.handler.mod-cluster.cached-connections-per-thread=Die Anzahl der Verbindungen, die zeitlich unbegrenzt aktiv gehalten werden.
undertow.handler.mod-cluster.connection-idle-timeout=Die Zeitspanne, die eine Verbindung unt\u00E4tig sein darf, ehe sie geschlossen wird. Verbindungen unterliegen keinem Timeout, sobald die Poolgr\u00F6\u00DFe auf das konfigurierte Minimum abgesunken ist (konfiguriert von cached-connections-per-thread)
undertow.handler.mod-cluster.worker=Der XNIO-Worker, der zum Senden von Advertise-Nachrichten verwendet wird
undertow.handler.mod-cluster.ssl-context=Referenz zum SSLContext, der von diesem Filter verwendet werden soll.
undertow.handler.mod-cluster.security-realm=Der Sicherheitsbereich, der die SSL-Konfiguration bereitstellt
undertow.handler.mod-cluster.security-realm.deprecated=Verwenden Sie das Attribut ssl-context, um direkt einen konfigurierten SSLContext zu referenzieren.
undertow.handler.mod-cluster.use-alias=Ob eine Alias-Pr\u00FCfung durchgef\u00FChrt wird
undertow.handler.mod-cluster.enable-http2=Ob der Lastverteiler versuchen soll, Backend-Verbindungen auf HTTP2 hochzustufen. Falls HTTP2 nicht unterst\u00FCtzt wird, so wird wie \u00FCblich HTTP oder HTTPS verwendet
undertow.handler.mod-cluster.max-ajp-packet-size=Die maximale Gr\u00F6\u00DFe f\u00FCr AJP-Pakete. Ein Anheben dieses Werts erm\u00F6glicht AJP die Handhabung von Anfragen/Antworten, die umfangreiche Header haben. Dies ist eine fortgeschrittene Option und muss auf Lastverteilern und Backend-Servern gleich eingestellt sein.
undertow.handler.mod-cluster.http2-enable-push=Ob Push f\u00FCr HTTP/2-Verbindungen aktiviert sein soll
undertow.handler.mod-cluster.http2-max-frame-size=Die maximale HTTP/2 Frame-Gr\u00F6\u00DFe
undertow.handler.mod-cluster.http2-max-concurrent-streams=Die maximale Anzahl von HTTP/2 Streams, die auf einer einzelnen Verbindung gleichzeitig aktiv sein k\u00F6nnen
undertow.handler.mod-cluster.http2-max-header-list-size=Die maximale Gr\u00F6\u00DFe von Anfrage-Headern, die der Server bereit ist zu akzeptieren
undertow.handler.mod-cluster.http2-initial-window-size=Die Fenstergr\u00F6\u00DFe der Flusskontrolle, die steuert, wie schnell der Client Daten zum Server senden kann
undertow.handler.mod-cluster.http2-header-table-size=Die Gr\u00F6\u00DFe der Header-Tabelle, die zur HPACK-Komprimierung verwendet wird, in Bytes. Diese Speichermenge wird pro Verbindung f\u00FCr die Komprimierung reserviert. Gr\u00F6\u00DFere Werte brauchen mehr Speicher, erreichen jedoch m\u00F6glicherweise eine bessere Komprimierung.
undertow.handler.mod-cluster.balancer=Laufzeitdarstellung eines mod_cluster-Lastverteilers
undertow.handler.mod-cluster.balancer.sticky-session-path=Der Pfad des Sticky-Session-Cookies
undertow.handler.mod-cluster.balancer.sticky-session=Ob Sticky Sessions aktiviert sind
undertow.handler.mod-cluster.balancer.sticky-session-cookie=Der Session-Cookie-Name
undertow.handler.mod-cluster.balancer.sticky-session-force=Falls "true", wird ein Fehler ausgegeben, falls die Anfrage nicht zum Sticky-Knoten geleitet werden kann; andernfalls wird die Anfrage auf einen anderen Knoten geleitet
undertow.handler.mod-cluster.balancer.sticky-session-remove=Session-Cookie entfernen, falls die Anfrage nicht auf den korrekten Host geleitet werden kann
undertow.handler.mod-cluster.balancer.max-attempts=Die Anzahl der Versuche, die Anfrage an einen Backend-Server zu senden
undertow.handler.mod-cluster.balancer.wait-worker=Die Anzahl der Sekunden, die auf einen verf\u00FCgbaren Worker gewartet werden soll
undertow.handler.mod-cluster.max-retries=Die Anzahl der Neuversuche f\u00FCr einen fehlgeschlagenen Aufruf. Beachten Sie, dass ein Aufruf, der als idempotent gilt, nur erneut versucht wird, falls der Proxy sichergehen kann, dass er nicht an den Backend-Server geschickt wurde.
undertow.handler.mod-cluster.balancer.node=Laufzeitdarstellung eines mod_cluster-Knotens
undertow.handler.mod-cluster.balancer.node.context=Laufzeitdarstellung eines mod_cluster-Kontexts
undertow.handler.mod-cluster.balancer.node.context.requests=Die Anzahl der Anfragen f\u00FCr diesen Kontext
undertow.handler.mod-cluster.balancer.node.context.status=Der Status dieses Kontexts
undertow.handler.mod-cluster.balancer.node.load=Die aktuelle Last auf diesem Knoten
undertow.handler.mod-cluster.balancer.node.elected=Wie oft er gew\u00E4hlt wurde
undertow.handler.mod-cluster.balancer.node.status=Der aktuelle Status dieses Knotens
undertow.handler.mod-cluster.balancer.node.disable=Deaktiviert alle Kontexte auf diesem Knoten
undertow.handler.mod-cluster.balancer.node.enable=Aktiviert alle Kontexte auf diesem Knoten
undertow.handler.mod-cluster.balancer.node.stop=Stoppt alle Kontexte auf diesem Knoten
undertow.handler.mod-cluster.balancer.node.uri=Die URI, die der Lastverteiler zum Verbinden mit dem Knoten verwendet
undertow.handler.mod-cluster.balancer.node.aliases=Die Knoten-Aliasse
undertow.handler.mod-cluster.balancer.node.context.disable=Deaktiviert diesen Kontext
undertow.handler.mod-cluster.balancer.node.context.enable=Aktiviert diesen Kontext
undertow.handler.mod-cluster.balancer.node.context.stop=Stoppt diesen Kontext
undertow.handler.mod-cluster.balancer.node.load-balancing-group=Die Lastverteilungsgruppe, zu der dieser Knoten geh\u00F6rt
undertow.handler.mod-cluster.balancer.node.cache-connections=Die Anzahl der Verbindungen, die zeitlich unbegrenzt aktiv gehalten werden.
undertow.handler.mod-cluster.balancer.node.max-connections=Die maximale Anzahl der Verbindungen pro IO-Thread.
undertow.handler.mod-cluster.balancer.node.open-connections=Die aktuelle Anzahl von offenen Verbindungen.
undertow.handler.mod-cluster.balancer.node.ping=Der Knoten-Ping
undertow.handler.mod-cluster.balancer.node.read=Die Anzahl der Bytes, die von diesem Knoten gelesen wurden
undertow.handler.mod-cluster.balancer.node.timeout=Der Anfrage-Timeout
undertow.handler.mod-cluster.balancer.node.written=Die Anzahl der Bytes, die auf diesen Knoten \u00FCbertragen wurden
undertow.handler.mod-cluster.balancer.node.ttl=Die Zeitspanne, die Verbindungen ohne Anfragen offen gehalten werden, ehe sie geschlossen werden, falls die Anzahl der Verbindungen gr\u00F6\u00DFer als cache-connections ist
undertow.handler.mod-cluster.balancer.node.flush-packets=Ob empfangene Daten sofort bereinigt werden sollen
undertow.handler.mod-cluster.balancer.node.queue-new-requests=Falls eine Anfrage in die Warteschlange platziert werden soll, falls nicht sofort ein Worker verf\u00FCgbar ist
undertow.handler.mod-cluster.balancer.node.request-queue-size=Die Gr\u00F6\u00DFe der Anfragewarteschlange
undertow.handler.mod-cluster.balancer.load-balancing-group=Eine Lastverteilungsgruppe
undertow.handler.mod-cluster.balancer.load-balancing-group.enable-nodes=Aktiviert alle Knoten in einer Lastverteilungsgruppe
undertow.handler.mod-cluster.balancer.load-balancing-group.disable-nodes=Deaktiviert alle Knoten in einer Lastverteilungsgruppe
undertow.handler.mod-cluster.balancer.load-balancing-group.stop-nodes=Stoppt alle Knoten in einer Lastverteilungsgruppe
