batch.jberet=Subsistema de lotes  (JSR-352)
batch.jberet.add=A\u00F1ade el subsistema de lotes.
batch.jberet.remove=Borra el subsistema de lotes.
batch.jberet.default-job-repository=El nombre del repositorio de tareas predeterminado.
batch.jberet.default-thread-pool=El nombre del thread-pool predeterminado.
batch.jberet.restart-jobs-on-resume=Si se establece a 'true' cuando una operaci\u00F3n de reinicio ha sido invocada, las tareas detenidas durante la suspensi\u00F3n ser\u00E1n reiniciadas. Un valor de 'false' abandonar\u00E1 las tareas en un estado detenido.
batch.jberet.security-domain=Hace referencia al dominio de seguridad para tareas de lotes. Esto solamentes puede definirse si el subsistema Elytron est\u00E1 disponible.
batch.jberet.in-memory-job-repository=Un repositorio de tareas que almacena informaci\u00F3n de tareas en memoria.
batch.jberet.in-memory-job-repository.add=Agrega un repositorio de tareas en memoria.
batch.jberet.in-memory-job-repository.remove=Retira un repositorio de tareas en memoria.
batch.jberet.jdbc-job-repository=Agrega un repositorio de tareas que almacena informaci\u00F3n de tareas en una base de datos.
batch.jberet.jdbc-job-repository.add=Agrega un repositorio de tareas JDBC.
batch.jberet.jdbc-job-repository.remove=Retira un repositorio de tareas JDBC.
batch.jberet.jdbc-job-repository.data-source=Nombre de la fuente de datos para conectarse a la base de datos.
batch.jberet.thread-pool=El grupo de hilos utilizado para las tareas de lotes. Observe que el atributo siempre debe ser mayor que 3. Se reservan dos hilos para garantizar que las tareas de partici\u00F3n puedan ejecutarse.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author guegl
batch.jberet.thread-pool.add=A\u00F1ade un grupo de hilos de desvinculados.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author guegl
batch.jberet.thread-pool.remove=Borra un grupo de hilos de desvinculados.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author guegl
batch.jberet.thread-pool.name=El nombre del grupo de hilos. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author angela.garcia
batch.jberet.thread-pool.rejected-count=El n\u00FAmero de tareas que se han rechazado.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author guegl
threadpool.common.active-count=El n\u00FAmero aproximado de hilos que est\u00E1n activamente ejecutando tareas.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author guegl
threadpool.common.completed-task-count=El n\u00FAmero total de tareas que han completado la ejecuci\u00F3n.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author guegl
threadpool.common.current-thread-count=El n\u00FAmero actual de hilos en el grupo.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author guegl
threadpool.common.keepalive-time=Se utiliza para especificar la cantidad de tiempo que los hilos deben mantenerse en ejecuci\u00F3n cuando est\u00E1n detenidos; si no se especifica, entonces los hilos se ejecutar\u00E1n hasta que el ejecutor se apague. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author angela.garcia
threadpool.common.keepalive-time.time=El tiempo
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author angela.garcia
threadpool.common.keepalive-time.unit=La unidad de tiempo
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author guegl
threadpool.common.largest-thread-count=El mayor n\u00FAmero de hilos que hayan estado alguna vez en forma simult\u00E1nea en el grupo.
threadpool.common.max-threads=El tama\u00F1o m\u00E1ximo del grupo de hilos. Observe que el atributo siempre debe ser mayor que 3. Se reservan dos hilos para garantizar que las tareas de partici\u00F3n puedan ejecutarse.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author guegl
threadpool.common.name=El nombre del grupo de hilos. 
threadpool.common.queue-size=El tama\u00F1o de la cola.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author guegl
threadpool.common.task-count=El n\u00FAmero total aproximado de tareas que alguna vez hayan sido programadas para ejecuci\u00F3n.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author guegl
threadpool.common.thread-factory=Especifica el nombre de una determinada f\u00E1brica de hilos a usar para crear hilos de trabajador. Si no se define, se utilizar\u00E1 una f\u00E1brica de hilos apropiada. 
batch.jberet.thread-factory=El hilo utilizado para el grupo de hilos.
batch.jberet.deployment=Informaci\u00F3n sobre el subsistema de lotes para la implementaci\u00F3n.
batch.jberet.deployment.job-xml-names=Se  encontr\u00F3 una lista de descriptores de tareas XML para la implementaci\u00F3n.  
batch.jberet.deployment.start-job=Inicia una tarea de lotes.
batch.jberet.deployment.start-job.job-xml-name=El nombre del descriptor de tareas XML a usar cuando inicie la tarea.
batch.jberet.deployment.start-job.properties=Propiedades opcionales a usar cuando inicia la tarea de lotes.
batch.jberet.deployment.stop-job=Detiene una tarea de lotes.
batch.jberet.deployment.stop-job.execution-id=El Id de ejecuci\u00F3n de la tarea que va a detenerse.
batch.jberet.deployment.restart-job=Reinicia una tarea de lotes. Reinicia \u00FAnicamente las tareas en un estado STOPPED o FAILED (DETENIDO o FALLIDO).
batch.jberet.deployment.restart-job.execution-id=\ IDde ejecuci\u00F3n de la tarea que va a reiniciar. Debe ser el ID de ejecuci\u00F3n m\u00E1s reciente.
batch.jberet.deployment.restart-job.properties=Propiedades opcionales a usar cuando reinicia la tarea de lotes.
batch.jberet.deployment.job=Informaci\u00F3n sobre una tarea de lotes espec\u00EDfica.
batch.jberet.deployment.job.running-executions=El n\u00FAmero de ejecuciones en curso en el host.
batch.jberet.deployment.job.instance-count=El n\u00FAmero de instancias  para la tarea.
batch.jberet.deployment.job.job-xml-names=Se encontr\u00F3 una lista de descriptores de tareas XML para describir esta tarea.  
batch.jberet.deployment.job.execution=Informaci\u00F3n de ejecuci\u00F3n para la tarea con el valor de la ruta como el ID de ejecuci\u00F3n.
batch.jberet.deployment.job.execution.instance-id=El Id de la instancia para la ejecuci\u00F3n.
batch.jberet.deployment.job.execution.batch-status=El estado de la ejecuci\u00F3n.
batch.jberet.deployment.job.execution.exit-status=El estado de salida de la ejecuci\u00F3n.
batch.jberet.deployment.job.execution.create-time=La hora en la que se cre\u00F3 la ejecuci\u00F3n en el formato ISO 8601.
batch.jberet.deployment.job.execution.start-time=La hora de ejecuci\u00F3n en la que se ingres\u00F3 el estado STARTED (iniciado) en el formato ISO 8601.
batch.jberet.deployment.job.execution.last-updated-time=La hora de ejecuci\u00F3n en la que fue actualizada por \u00FAltima vez en el formato ISO 8601.
batch.jberet.deployment.job.execution.end-time=La hora de ejecuci\u00F3n en la que se ingres\u00F3 el estado COMPLETED (completado), STOPPED(detenido) o FAILED (fallido) en el formato ISO 8601.
batch.jberet.deployment.job.execution.stop-job=Detiene una tarea de lotes.
batch.jberet.deployment.job.execution.restart-job=Reinicia una tarea de lotes. Reinicia \u00FAnicamente las tareas en un estado STOPPED o FAILED (DETENIDO o FALLIDO). Tambi\u00E9n debe ser la ejecuci\u00F3n de tareas m\u00E1s reciente.
batch.jberet.deployment.job.execution.restart-job.properties=Propiedades opcionales a usar cuando reinicia la tarea de lotes.
