# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author angela.garcia
ee=La configuraci\u00F3n del subsistema JEE.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author angela.garcia
ee.add=Agrega el subsistema EE.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author angela.garcia
ee.remove=Borra el subsistema EE.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author angela.garcia
ee.global-modules=Una lista de m\u00F3dulos que se deben hacer disponibles para todas las implementaciones.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author angela.garcia
ee.global-modules.name=El nombre del m\u00F3dulo
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author angela.garcia
ee.global-modules.slot=La casilla del m\u00F3dulo
ee.global-modules.annotations=Si un \u00EDndice de una anotaci\u00F3n precomputada se debe importar del META-INF/jandex.idx
ee.global-modules.meta-inf=Si un directorio META-INF m\u00F3dulos se debe hacer disponible al cargador de clases de la implementaci\u00F3n
ee.global-modules.services=Si los servicios expuestos en META-INF/services se deben hacer disponibles en el cargador de clases de la implementaci\u00F3n
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author angela.garcia
ee.ear-subdeployments-isolated=Bandera que indica si cada subimplementaci\u00F3n dentro de un .ear puede acceder a las clases pertenecientes a otra subimplementaci\u00F3n dentro del mismo .ear. Un valor de 'false' significa que las subimplementaciones pueden ver las clases que pertenecientes a las otras subimplementaciones dentro del .ear.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author M Benitez
ee.spec-descriptor-property-replacement=Bandera que indica si los descriptores definidos por la especificaci\u00F3n Java EE presentar\u00E1n reemplazo de propiedades
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author M Benitez
ee.jboss-descriptor-property-replacement=Bandera que indica si los descriptores de despliegue JBoss presentar\u00E1n remplazos a sus propiedades
ee.annotation-property-replacement=Bandera que indica si se le aplicar\u00E1n reemplazos de propiedades a las anotaciones Java EE
service=Servicios configurables centralmente que hacen parte del subsistema EE.
context-service=Un servicio de contexto
context-service.add=Agrega un servicio de contexto
context-service.remove=Retira un servicio de contexto
context-service.jndi-name=El nombre JNDI  a buscar en el servicio de contexto.
context-service.use-transaction-setup-provider=Una bandera que indica si la configuraci\u00F3n del proveedor de transacciones debe utilizarse. 
managed-thread-factory=Una f\u00E1brica de hilos administrados
managed-thread-factory.add=Agrega una f\u00E1brica de hilos administrados
managed-thread-factory.remove=Retira una f\u00E1brica de hilos administrados
managed-thread-factory.jndi-name=El nombre JNDI  a buscar en la f\u00E1brica de hilos administrados.
managed-thread-factory.context-service=El nombre del servicio de contexto a utilizar por la f\u00E1brica de hilos administrados.
managed-thread-factory.priority=La prioridad aplicada a los hilos creados por la f\u00E1brica
managed-executor-service=Un servicio ejecutor administrado
managed-executor-service.add=Agrega el ejecutor
managed-executor-service.remove=Retira el ejecutor.
managed-executor-service.jndi-name=El nombre JNDI  a buscar en el srvicio de ejecutor administrado.
managed-executor-service.context-service=El nombre del servicio de contexto a utilizar por el ejecutor.
managed-executor-service.thread-factory=El nombre de la f\u00E1brica de hilos a ser utilizados por el ejecutor.
managed-executor-service.hung-task-threshold=El tiempo de ejecuci\u00F3n en milisegundos para tareas a ser consideradas suspendidas por el servicio ejecutor. Si el valor es 0, las  tareas nunca ser\u00E1n suspendidas.
managed-executor-service.long-running-tasks=Indicador que da una idea de la duraci\u00F3n de las tareas ejecutadas por el ejecutor.
managed-executor-service.core-threads=El n\u00FAmero m\u00EDnimo de hilos que deben ser utilizados por el ejecutor. Si se deja como indefinido, el core-size ser\u00E1 calculado con base en el n\u00FAmero de procesadores. No se recomienda un valor de cero y en algunos casos no es v\u00E1lido. Vea el atributo queue-length para obtener detalles de c\u00F3mo se utiliza para determinar la estrategia de cola.
managed-executor-service.max-threads=El n\u00FAmero m\u00EDnimo de hilos utilizados por el ejecutor. Si se deja como indefinido, el valor core-size ser\u00E1 utilizado Este valor sera ignorado si la cola sin l\u00EDmites es utilizada (\u00FAnicamente para core-threads servir\u00E1 en este caso).
managed-executor-service.keepalive-time=Cuando el n\u00FAmero de hilos es mayor que el n\u00FAcleo, este es el tiempo m\u00E1ximo en milisegundos, dichos hilos inactivos esperar\u00E1n las nuevas tareas antes de finalizar.
managed-executor-service.queue-length=La capacidad de cola de tareas de ejecutores. Una longitude de 0 significa que puede ocurrir una liberaci\u00F3n directa y un posible rechazo. Una longitud indefinida (la predeterminada) o Integer.MAX_VALUE, indica que debe utilizarse una cola ilimitada. Todos los valores especifican un tama\u00F1o de cola exacta. Si una cola ilimitada o liberada es utilizada, se requerir\u00E1 un valor  de core-threads mayor que cero. 
managed-executor-service.reject-policy=La pol\u00EDtica a ser aplicada a las tareas abortadas.
managed-scheduled-executor-service=Un servicio ejecutor programado administrado
managed-scheduled-executor-service.add=Agrega el ejecutor programado
managed-scheduled-executor-service.remove=Retira el ejecutor programado.
managed-scheduled-executor-service.jndi-name=El nombre JNDI  a buscar en el servicio de ejecutor administrado y programado.
managed-scheduled-executor-service.context-service=El nombre JNDI  del  servicio de contexto a ser utilizado por el ejecutor programado.
managed-scheduled-executor-service.thread-factory=El nombre de la f\u00E1brica de hilos a ser utilizados por el ejecutor programado.
managed-scheduled-executor-service.hung-task-threshold=El tiempo de ejecuci\u00F3n en milisegundos para tareas a ser consideradas suspendidas por el servicio ejecutor. Si el valor es 0, las  tareas nunca ser\u00E1n consideradas suspendidas.
managed-scheduled-executor-service.long-running-tasks=Indicador que da una idea de la duraci\u00F3n de las tareas ejecutadas por el ejecutor programado.
managed-scheduled-executor-service.core-threads=El n\u00FAmero m\u00EDnimo de hilos a ser utilizados por el ejecutor programado.
managed-scheduled-executor-service.keepalive-time=Cuando el n\u00FAmero de hilos es mayor que el n\u00FAcleo, este es el tiempo m\u00E1ximo en milisegundos, dichos hilos inactivos esperar\u00E1n las nuevas tareas antes de finalizar.
managed-scheduled-executor-service.reject-policy=La pol\u00EDtica a ser aplicada a las tareas abortadas.
default-bindings=Los nombres JNDI para los enlaces EE  predeterminados
default-bindings.add=Agrega los nombres JNDI  para los enlaces EE  predeterminados
default-bindings.remove=Retira los nombres JNDI  para los enlaces EE  predeterminados
default-bindings.context-service=El nombre JNDI  donde se encuentra el servicio EE Context predeterminado.
default-bindings.datasource=El nombre JNDI  donde se encuentra el servicioEE Datasource  predeterminado.
default-bindings.jms-connection-factory=El nombre JNDI  donde se encuentra el EE JMS Connection Factory  predeterminado.
default-bindings.managed-executor-service=El nombre JNDI  donde se encuentra el servicio EE Managed Executor predeterminado.
default-bindings.managed-scheduled-executor-service=El nombre JNDI  donde se encuentra el servicio EE Managed Scheduled Executor predeterminado.
default-bindings.managed-thread-factory=El nombre JNDI  donde se encuentra el servicio EE Managed Thread Factory predeterminado.
