# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author jdimanos
ee=Die Konfiguration des EE-Untersystems.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author jdimanos
ee.add=F\u00FCgt das EE-Untersystem hinzu.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author jdimanos
ee.remove=Entfernt das EE-Untersystem.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author jdimanos
ee.global-modules=Eine Liste von Modulen, die allen Deployments verf\u00FCgbar gemacht werden sollten.  
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author jdimanos
ee.global-modules.name=Der Name des Moduls
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author jdimanos
ee.global-modules.slot=Der Platz des Moduls
ee.global-modules.annotations=Ob ein vorab berechneter Annotationsindex aus META-INF/jandex.idx importiert werden soll
ee.global-modules.meta-inf=Ob ein Modul META-INF Verzeichnis dem Deployments-Klassenlader verf\u00FCgbar gemacht werden sollte
ee.global-modules.services=Ob in META-INF/services offengelegte Dienste dem Deployments-Klassenlader verf\u00FCgbar gemacht werden sollten
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author Hedda Peters
ee.ear-subdeployments-isolated=Flag, das anzeigt, ob jedes der Unterdeployments innerhalb eines .ear auf Klassen zugreifen kann, die zu einem anderen Unterdeployment innerhalb desselben .ear geh\u00F6rt. Der Wert 'false' bedeutet, dass die Unterdeployments Klassen sehen k\u00F6nnen, die zu anderen Unterdeployments innerhalb des .ear geh\u00F6ren.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author jdimanos
ee.spec-descriptor-property-replacement=Flag,das anzeigt, ob an durch die Java EE Spezifikation definierten Deskriptoren Property-Replacements angewendet werden
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author jdimanos
ee.jboss-descriptor-property-replacement=Flag,das anzeigt, ob an JBoss spezifische Deployment-Deskriptoren Property-Replacements angewendet werden
ee.annotation-property-replacement=Flag,das anzeigt, ob an EJB-Annotationen Property-Replacements angewendet werden
service=Zentral konfigurierbare Dienste, die Teil des EE-Untersystems sind.
context-service=Ein Kontextdienst
context-service.add=F\u00FCgt einen Kontextdienst hinzu
context-service.remove=Entfernt einen Kontextdienst
context-service.jndi-name=Der JNDI-Name zum Abrufen des Kontextdienstes.
context-service.use-transaction-setup-provider=Flag, das anzeigt, ob der Transaktions-Setup-Provider verwendet werden soll
managed-thread-factory=Eine verwaltete Thread-Factory
managed-thread-factory.add=F\u00FCgt die verwaltete Thread-Factory hinzu
managed-thread-factory.remove=Entfernt die verwaltete Thread-Factory
managed-thread-factory.jndi-name=Der JNDI-Name zum Abrufen der verwalteten Thread-Factory.
managed-thread-factory.context-service=Der Name des Kontextdienstes, der von der verwalteten Thread-Factory verwendet werden soll.
managed-thread-factory.priority=Die Priorit\u00E4t, die auf Threads von dieser Factory angewendet werden soll
managed-executor-service=Ein verwalteter Executor-Dienst
managed-executor-service.add=F\u00FCgt den Executor hinzu
managed-executor-service.remove=Entfernt den Executor
managed-executor-service.jndi-name=Der JNDI-Name zum Abrufen des verwalteten Executor-Dienstes.
managed-executor-service.context-service=Der Name des Kontextdienstes, der von dem Executor verwendet werden soll.
managed-executor-service.thread-factory=Der Name der Thread-Factory, die vom Executor verwendet werden soll.
managed-executor-service.hung-task-threshold=Die Laufzeit in Millisekunden, nach denen ein Task vom verwalteten Executor-Dienst als h\u00E4ngengeblieben betrachtet wird. Der Wert 0 bedeutet, dass Tasks nie als h\u00E4ngengeblieben betrachtet werden.
managed-executor-service.long-running-tasks=Flag, das einen Hinweis auf die Dauer von Tasks gibt, die vom Executor ausgef\u00FChrt werden.
managed-executor-service.core-threads=Die Mindestanzahl von Threads, die vom Executor verwendet werden. Falls nicht definiert, wird die standardm\u00E4\u00DFige Core-Gr\u00F6\u00DFe basierend auf der Anzahl von Prozessoren berechnet. Der Wert 0 wird nicht empfohlen und ist in einigen F\u00E4llen ung\u00FCltig. Siehe queue-length Attribut f\u00FCr Details dar\u00FCber, wie dieser Wert zum Bestimmen der Queuing-Strategie verwendet wird.
managed-executor-service.max-threads=Die H\u00F6chstanzahl von Threads, die vom Executor verwendet werden. Falls nicht definiert, wird der Wert von core-size verwendet. Dieser Wert wird ignoriert, falls eine unbegrenzte Warteschlange verwendet wird (in diesem Fall wird nur core-threads verwendet).
managed-executor-service.keepalive-time=Wenn die Anzahl der Threads gr\u00F6\u00DFer ist als der Core, dann ist dies die maximale Zeit (in Millisekunden), w\u00E4hrend der \u00FCbersch\u00FCssige unt\u00E4tige Threads auf neue Tasks warten, ehe sie beenden.
managed-executor-service.queue-length=Die Kapazit\u00E4t der Task-Warteschlange des Executors. Die L\u00E4nge 0 bedeutet sofortiges Abgeben und eine m\u00F6gliche Ablehnung. Eine undefinierte L\u00E4nge (Standard) oder Integer.MAX_VALUE zeigt an, dass eine unbegrenzte Warteschlange verwendet werden soll. Alle anderen Werte definieren eine exakte Warteschlangengr\u00F6\u00DFe. Falls eine unbegrenzte Warteschlange oder sofortiges Abgeben verwendet wird, ist ein core-threads-Wert gr\u00F6\u00DFer als Null erforderlich.
managed-executor-service.reject-policy=Die Richtlinie, die auf abgebrochene Tasks angewendet werden soll.
managed-scheduled-executor-service=Ein verwalteter, geplanter Executor-Dienst
managed-scheduled-executor-service.add=F\u00FCgt den geplanten Executor hinzu
managed-scheduled-executor-service.remove=Entfernt den geplanten Executor.
managed-scheduled-executor-service.jndi-name=Der JNDI-Name zum Abrufen des verwalteten, geplanten Executor-Dienstes.
managed-scheduled-executor-service.context-service=Der Name des Kontextdienstes, der von dem geplanten Executor verwendet werden soll.
managed-scheduled-executor-service.thread-factory=Der Name der Thread-Factory, die vom geplanten Executor verwendet werden soll.
managed-scheduled-executor-service.hung-task-threshold=Die Laufzeit in Millisekunden, nach denen ein Task vom geplanten Executor als h\u00E4ngengeblieben betrachtet wird. Der Wert 0 bedeutet, dass Tasks nie als h\u00E4ngengeblieben betrachtet werden.
managed-scheduled-executor-service.long-running-tasks=Flag, das einen Hinweis auf die Dauer von Tasks gibt, die vom geplanten Executor ausgef\u00FChrt werden.
managed-scheduled-executor-service.core-threads=Die Mindestzahl von Threads, die vom geplanten Executor verwendet werden sollen.
managed-scheduled-executor-service.keepalive-time=Wenn die Anzahl der Threads gr\u00F6\u00DFer ist als der Core, dann ist dies die maximale Zeit (in Millisekunden), w\u00E4hrend der \u00FCbersch\u00FCssige unt\u00E4tige Threads auf neue Tasks warten, ehe sie beenden.
managed-scheduled-executor-service.reject-policy=Die Richtlinie, die auf abgebrochene Tasks angewendet werden soll.
default-bindings=Die JNDI-Namen f\u00FCr die standardm\u00E4\u00DFigen EE-Bindings
default-bindings.add=F\u00FCgt die JNDI-Namen f\u00FCr die standardm\u00E4\u00DFigen EE-Bindings hinzu
default-bindings.remove=Entfernt die JNDI-Namen f\u00FCr die standardm\u00E4\u00DFigen EE-Bindings
default-bindings.context-service=Der JNDI-Name, in dem sich der standardm\u00E4\u00DFige EE-Kontextdienst befindet
default-bindings.datasource=Der JNDI-Name, in dem sich die standardm\u00E4\u00DFige EE-Datenquelle befindet
default-bindings.jms-connection-factory=Der JNDI-Name, in dem sich die standardm\u00E4\u00DFige EE-JMS-Connection-Factory befindet
default-bindings.managed-executor-service=Der JNDI-Name, in dem sich der standardm\u00E4\u00DFige verwaltete EE-Executor-Dienst befindet
default-bindings.managed-scheduled-executor-service=Der JNDI-Name, in dem sich der standardm\u00E4\u00DFige verwaltete, geplante EE-Executor-Dienst befindet
default-bindings.managed-thread-factory=Der JNDI-Name, in dem sich die standardm\u00E4\u00DFige verwaltete EE-Thread-Factory befindet
