# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author ldelima@redhat.com
ee=A configura\u00E7\u00E3o do subsistema EE.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author ldelima@redhat.com
ee.add=Adiciona o subsistema EE.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author ldelima@redhat.com
ee.remove=Remove o subsistema EE.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author ldelima@redhat.com
ee.global-modules=Uma lista de m\u00F3dulos que devem ser disponibilizados para todas as implanta\u00E7\u00F5es.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author ldelima@redhat.com
ee.global-modules.name=O nome do m\u00F3dulo
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author ldelima@redhat.com
ee.global-modules.slot=O slot do m\u00F3dulo.
ee.global-modules.annotations=Caso um indexe de anota\u00E7\u00E3o pr\u00E9-computado deve ser importado a partir do META-INF/jandex.idx
ee.global-modules.meta-inf=Caso um diret\u00F3rio META-INF dos m\u00F3dulos deve ser disponibilizado ao carregador da classe de implementa\u00E7\u00F5es
ee.global-modules.services=Caso quaisquer servi\u00E7os expostos no META-INF/services deve ser disponibilizado ao carregador da classe de implementa\u00E7\u00F5es
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author ldelima@redhat.com
ee.ear-subdeployments-isolated=O aviso indicando se \u00E9 que cada uma das subimplanta\u00E7\u00F5es com um .ear pode acessar as classes pertencentes a outra subimplanta\u00E7\u00E3o com o mesmo .ear. O valor falso significa que as subimplanta\u00E7\u00F5es podem visualizar classes pertencentes a outras subimplanta\u00E7\u00F5es com o .ear.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author ldelima@redhat.com
ee.spec-descriptor-property-replacement=Aviso indicando se \u00E9 que os descritores definidos pela especifica\u00E7\u00E3o Java EE ter\u00E3o as substitui\u00E7\u00F5es da propriedade aplicadas
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author ldelima@redhat.com
ee.jboss-descriptor-property-replacement=O aviso indicando se \u00E9 que os descritores de implanta\u00E7\u00E3o espec\u00EDfica ter\u00E3o a substitui\u00E7\u00F5es da propriedade aplicadas
ee.annotation-property-replacement=O aviso indicando se \u00E9 que as anota\u00E7\u00F5es EJB ter\u00E3o substitui\u00E7\u00F5es de propriedade aplicadas
service=Servi\u00E7os configur\u00E1veis centralmente que s\u00E3o parte do subsistema EE.
context-service=Um servi\u00E7o de contexto 
context-service.add=Adiciona um servi\u00E7o de contexto
context-service.remove=Remove um servi\u00E7o de contexto
context-service.jndi-name=O nome JNDI para pesquisar o servi\u00E7o de contexto. 
context-service.use-transaction-setup-provider=Sinalizador que indica se o provedor de instala\u00E7\u00E3o de transa\u00E7\u00E3o deve ser utilizado
managed-thread-factory=Uma f\u00E1brica de threads gerenciada 
managed-thread-factory.add=Adiciona a f\u00E1brica de threads gerenciada
managed-thread-factory.remove=Remove a f\u00E1brica de threads gerenciada
managed-thread-factory.jndi-name=O nome JNDI para pesquisar a f\u00E1brica de threads gerenciada. 
managed-thread-factory.context-service=O nome do servi\u00E7o de contexto a ser utilizado pela f\u00E1brica de threads gerenciada
managed-thread-factory.priority=A prioridade aplicada \u00E0s threads criadas pela f\u00E1brica. 
managed-executor-service=Um  servi\u00E7o de executor gerenciado
managed-executor-service.add=Adiciona o executor
managed-executor-service.remove=Remove o executor 
managed-executor-service.jndi-name=O Nome JNDI para pesquisar o servi\u00E7o de executor gerenciado. 
managed-executor-service.context-service=O nome do servi\u00E7o de contexto para ser utilizado pelo executor. 
managed-executor-service.thread-factory=O nome da f\u00E1brica de threads para ser utilizado pelo executor. 
managed-executor-service.hung-task-threshold=O tempo de execu\u00E7\u00E3o, em milissegundos,  para tarefas serem consideradas suspensas pelo servi\u00E7o de executor gerenciado. Se o valor for 0, as tarefas nunca ser\u00E3o consideradas suspensas. 
managed-executor-service.long-running-tasks=Sinalizador que indica a dura\u00E7\u00E3o das tarefas executada pelo executor. 
managed-executor-service.core-threads=O n\u00FAmero m\u00EDnimo de threads a ser utilizado pelo executor.  Se for indefinido,  o core-size predeterminado \u00E9 calculado baseado no n\u00FAmero de processadores.  O valor zero n\u00E3o \u00E9 aconselh\u00E1vel  e em alguns casos inv\u00E1lido. Consulte o atributo queue-length para detalhes de como este valor \u00E9 utilizado para determinar a estrat\u00E9gia de enfileiramento.   
managed-executor-service.max-threads=O n\u00FAmero m\u00E1ximo de threads a ser utilizado pelo executor. Se for indefinido o valor do core-size ser\u00E1 utilizado. Este valor \u00E9 ignorado se uma fila sem limite \u00E9 utilizada (somente core-threads ser\u00E3o utilizadas neste caso). 
managed-executor-service.keepalive-time=Quando um n\u00FAmero de threads \u00E9 maior que o n\u00FAcleo, este \u00E9 o tempo m\u00E1ximo, em milissegundos, que threads inativas em excesso ir\u00E3o aguardar novas tarefas antes de finalizar. 
managed-executor-service.queue-length=A capacidade de fila de tarefas de executores. Um comprimento de 0 significa entrega direta e poss\u00EDvel  rejei\u00E7\u00E3o ir\u00E3o ocorrer. Um comprimento n\u00E3o definido (predeterminado), ou Integer.MAX_VALUE, indica que deve ser utilizada uma fila sem limites. Todos outros valores especificam  um tamanho exato de fila.  Se uma fila sem limites ou de entrega direta for utilizada, um valor de core-threads maior que zero \u00E9 necess\u00E1rio. 
managed-executor-service.reject-policy=A pol\u00EDtica  a ser aplicada para abortar tarefas. 
managed-scheduled-executor-service=Um servi\u00E7o de executor programado gerenciado
managed-scheduled-executor-service.add=Adiciona um executor programado
managed-scheduled-executor-service.remove=Remove um executor programado. 
managed-scheduled-executor-service.jndi-name=O nome JNDI para pesquisar o servi\u00E7o de executor gerenciado programado. 
managed-scheduled-executor-service.context-service=O nome do servi\u00E7o de contexto a ser utilizado pelo executor programado.
managed-scheduled-executor-service.thread-factory=O nome da f\u00E1brica de thread a ser utilizado pelo pelo executor programado. 
managed-scheduled-executor-service.hung-task-threshold=O tempo de execu\u00E7\u00E3o, em milissegundos, para tarefas serem consideradas suspensas pelo executor programado. Se 0 as tarefas nunca ser\u00E3o consideradas suspensas. 
managed-scheduled-executor-service.long-running-tasks=Sinalizador que indica a dura\u00E7\u00E3o de tarefas executadas pelo executor programado. 
managed-scheduled-executor-service.core-threads=O n\u00FAmero m\u00EDnimo de threads a serem utilizados pelo executor programado. 
managed-scheduled-executor-service.keepalive-time=Quando o n\u00FAmero de threads for maior do que o n\u00FAcleo, este ser\u00E1 o tempo m\u00E1ximo, em milissegundos, que threads inativas aguardar\u00E3o por novas tarefas antes de finalizarem. 
managed-scheduled-executor-service.reject-policy=A pol\u00EDtica  a ser aplicada para abortar tarefas. 
default-bindings=Os nomes JNDI para as associa\u00E7\u00F5es EE predeterminadas
default-bindings.add=Adiciona os nomes JNDI para as associa\u00E7\u00F5es EE predeterminadas
default-bindings.remove=Remove os nomes JNDI para as associa\u00E7\u00F5es EE predeterminadas
default-bindings.context-service=Os nomes JNDI onde se encontra o servi\u00E7o  EE Context predeterminado. 
default-bindings.datasource=O nome JNDI onde se encontra o EE Datasource predeterminado.
default-bindings.jms-connection-factory=O nome JNDI onde se encontra o EE JMS Connection Factory  predeterminado. 
default-bindings.managed-executor-service=O nome JNDI onde se encontra o servi\u00E7o EE Managed Executor predeterminado. 
default-bindings.managed-scheduled-executor-service=O nome JNDI onde se encontra o servi\u00E7o EE Managed Scheduled Executor predeterminado. 
default-bindings.managed-thread-factory=O nome JNDI onde se encontra o servi\u00E7o EE Managed Thread Factory predeterminado. 
