# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author Yamamoto Mie
ee=EE \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8A2D\u5B9A
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author Yamamoto Mie
ee.add=EE \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8FFD\u52A0
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author Yamamoto Mie
ee.remove=EE \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u524A\u9664
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author Yamamoto Mie
ee.global-modules=\u5168\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3067\u5229\u7528\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u4E00\u89A7
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author Yamamoto Mie
ee.global-modules.name=\u30E2\u30B8\u30E5\u30FC\u30EB\u540D
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author Yamamoto Mie
ee.global-modules.slot=\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30B9\u30ED\u30C3\u30C8
ee.global-modules.annotations=\u4E8B\u524D\u306B\u8A08\u7B97\u3055\u308C\u305F\u30A2\u30CE\u30C6\u30FC\u30B7\u30E7\u30F3\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u3092 META-INF/jandex.idx \u304B\u3089\u30A4\u30F3\u30DD\u30FC\u30C8\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u5834\u5408
ee.global-modules.meta-inf=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC\u3067\u30E2\u30B8\u30E5\u30FC\u30EB META-INF \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3092\u4F7F\u7528\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u5834\u5408
ee.global-modules.services=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC\u3067 META-INF/\u30B5\u30FC\u30D3\u30B9\u3067\u516C\u958B\u3055\u308C\u305F\u3059\u3079\u3066\u306E\u30B5\u30FC\u30D3\u30B9\u3092\u4F7F\u7528\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u5834\u5408
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author Yamamoto Mie
ee.ear-subdeployments-isolated=.ear \u5185\u306E\u5404\u30B5\u30D6\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C\u540C\u3058.ear \u5185\u306E\u5225\u306E\u30B5\u30D6\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u6240\u5C5E\u3059\u308B\u30AF\u30E9\u30B9\u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u308B\u304B\u6307\u5B9A\u3059\u308B\u30D5\u30E9\u30B0\u3002\u5024\u304C false \u306E\u5834\u5408\u306F\u3001\u30B5\u30D6\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C.ear \u5185\u306E\u307B\u304B\u306E\u30B5\u30D6\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u6240\u5C5E\u3059\u308B\u30AF\u30E9\u30B9\u3092\u53C2\u7167\u3067\u304D\u308B\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author Yamamoto Mie
ee.spec-descriptor-property-replacement=Java EE \u4ED5\u69D8\u3067\u5B9A\u7FA9\u3055\u308C\u305F\u8A18\u8FF0\u5B50\u306B\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u7F6E\u304D\u63DB\u3048\u304C\u9069\u7528\u3055\u308C\u3066\u3044\u308B\u304B\u6307\u5B9A\u3059\u308B\u30D5\u30E9\u30B0
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author Yamamoto Mie
ee.jboss-descriptor-property-replacement=JBoss \u56FA\u6709\u306E\u914D\u5099\u8A18\u8FF0\u5B50\u306B\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u7F6E\u304D\u63DB\u3048\u304C\u9069\u7528\u3055\u308C\u3066\u3044\u308B\u304B\u6307\u5B9A\u3059\u308B\u30D5\u30E9\u30B0
ee.annotation-property-replacement=Java EE \u30A2\u30CE\u30C6\u30FC\u30B7\u30E7\u30F3\u306B\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306E\u7F6E\u63DB\u3092\u9069\u7528\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u793A\u3059\u30D5\u30E9\u30B0
service=EE \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u4E00\u90E8\u3067\u3042\u308B\u4E00\u5143\u7684\u306B\u8A2D\u5B9A\u53EF\u80FD\u306A\u30B5\u30FC\u30D3\u30B9
context-service=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30B5\u30FC\u30D3\u30B9
context-service.add=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30B5\u30FC\u30D3\u30B9\u3092\u8FFD\u52A0
context-service.remove=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30B5\u30FC\u30D3\u30B9\u3092\u524A\u9664
context-service.jndi-name=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30B5\u30FC\u30D3\u30B9\u3092\u30EB\u30C3\u30AF\u30A2\u30C3\u30D7\u3059\u308B JNDI \u540D\u3002
context-service.use-transaction-setup-provider=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30BB\u30C3\u30C8\u30A2\u30C3\u30D7\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304C\u4F7F\u7528\u3055\u308C\u308B\u3079\u304D\u3067\u3042\u308B\u3053\u3068\u3092\u793A\u3059\u30D5\u30E9\u30B0
managed-thread-factory=\u7BA1\u7406\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC
managed-thread-factory.add=\u7BA1\u7406\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3092\u8FFD\u52A0
managed-thread-factory.remove=\u7BA1\u7406\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3092\u524A\u9664
managed-thread-factory.jndi-name=\u7BA1\u7406\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3092\u30EB\u30C3\u30AF\u30A2\u30C3\u30D7\u3059\u308B JNDI \u540D\u3002
managed-thread-factory.context-service=\u7BA1\u7406\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30B5\u30FC\u30D3\u30B9\u306E\u540D\u524D
managed-thread-factory.priority=\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306B\u3088\u3063\u3066\u4F5C\u6210\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u306B\u9069\u7528\u3055\u308C\u308B\u512A\u5148\u9806\u4F4D
managed-executor-service=\u7BA1\u7406\u3055\u308C\u305F\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9
managed-executor-service.add=\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u3092\u8FFD\u52A0
managed-executor-service.remove=\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u3092\u524A\u9664
managed-executor-service.jndi-name=\u7BA1\u7406\u3055\u308C\u305F\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u3092\u30EB\u30C3\u30AF\u30A2\u30C3\u30D7\u3059\u308B JNDI \u540D\u3002
managed-executor-service.context-service=\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30B5\u30FC\u30D3\u30B9\u306E\u540D\u524D\u3002
managed-executor-service.thread-factory=\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u540D\u524D\u3002
managed-executor-service.hung-task-threshold=\u7BA1\u7406\u3055\u308C\u305F\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u306B\u3088\u3063\u3066\u30BF\u30B9\u30AF\u304C\u30CF\u30F3\u30B0\u3057\u305F\u3068\u898B\u306A\u3055\u308C\u308B\u30E9\u30F3\u30BF\u30A4\u30E0 (\u30DF\u30EA\u79D2\u5358\u4F4D)\u3002\u5024\u304C 0 \u306E\u5834\u5408\u306F\u30BF\u30B9\u30AF\u304C\u30CF\u30F3\u30B0\u3057\u305F\u3068\u898B\u306A\u3055\u308C\u308B\u3053\u3068\u306F\u3042\u308A\u307E\u305B\u3093\u3002
managed-executor-service.long-running-tasks=\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u306B\u3088\u3063\u3066\u5B9F\u884C\u3055\u308C\u305F\u30BF\u30B9\u30AF\u306E\u671F\u9593\u3092\u6697\u793A\u3059\u308B\u30D5\u30E9\u30B0\u3002
managed-executor-service.core-threads=\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u306E\u6700\u5C0F\u6570\u3002\u672A\u5B9A\u7FA9\u306E\u307E\u307E\u306B\u3059\u308B\u3068\u3001\u30D7\u30ED\u30BB\u30B9\u306E\u6570\u3092\u57FA\u306B\u3057\u3066\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30B3\u30A2\u30B5\u30A4\u30BA\u304C\u7B97\u51FA\u3055\u308C\u307E\u3059\u3002\u30BC\u30ED\u3092\u6307\u5B9A\u3059\u308B\u3053\u3068\u306F\u63A8\u5968\u3055\u308C\u305A\u3001\u5834\u5408\u306B\u3088\u3063\u3066\u306F\u7121\u52B9\u306B\u306A\u308A\u307E\u3059\u3002\u30AD\u30E5\u30FC\u30A4\u30F3\u30B0\u30B9\u30C8\u30E9\u30C6\u30B8\u30FC\u3092\u6C7A\u5B9A\u3059\u308B\u305F\u3081\u306B\u3069\u306E\u3088\u3046\u306B\u3053\u306E\u5024\u3092\u4F7F\u7528\u3059\u308B\u304B\u306B\u95A2\u3057\u3066\u306F\u3001queue-length \u5C5E\u6027\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
managed-executor-service.max-threads=\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u306E\u6700\u5927\u6570\u3002\u672A\u5B9A\u7FA9\u306E\u307E\u307E\u306B\u3059\u308B\u3068\u3001\u30B3\u30A2\u30B5\u30A4\u30BA\u304B\u3089\u306E\u5024\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u3066\u3044\u306A\u3044\u30AD\u30E5\u30FC\u304C\u4F7F\u7528\u3055\u308C\u308B\u5834\u5408\u306F\u3053\u306E\u5024\u306F\u7121\u8996\u3055\u308C\u307E\u3059 (\u3053\u306E\u5834\u5408\u3001\u30B3\u30A2\u30B9\u30EC\u30C3\u30C9\u306E\u307F\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059)\u3002
managed-executor-service.keepalive-time=\u30B9\u30EC\u30C3\u30C9\u306E\u6570\u304C\u30B3\u30A2\u3088\u308A\u3082\u5927\u304D\u3044\u5834\u5408\u3001\u7D42\u4E86\u3059\u308B\u524D\u306B\u4F59\u5206\u306A\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u306E\u30B9\u30EC\u30C3\u30C9\u304C\u65B0\u3057\u3044\u30BF\u30B9\u30AF\u3092\u5F85\u3064\u6700\u5927\u6642\u9593 (\u30DF\u30EA\u79D2\u5358\u4F4D)\u3002
managed-executor-service.queue-length=\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u30BF\u30B9\u30AF\u306E\u30AD\u30E5\u30FC\u5BB9\u91CF\u3002\u9577\u3055\u304C 0 \u306E\u5834\u5408\u306F\u76F4\u63A5\u30CF\u30F3\u30C9\u30AA\u30D5\u3092\u610F\u5473\u3057\u3001\u62D2\u5426\u3055\u308C\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u9577\u3055\u304C\u672A\u5B9A\u7FA9 (\u30C7\u30D5\u30A9\u30EB\u30C8) \u307E\u305F\u306F  Integer.MAX_VALUE \u306E\u5834\u5408\u306F\u3001\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u3066\u3044\u306A\u3044\u30AD\u30E5\u30FC\u304C\u4F7F\u7528\u3055\u308C\u308B\u3079\u304D\u3067\u3042\u308B\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002\u4ED6\u306E\u3059\u3079\u3066\u306E\u5024\u306F\u6B63\u78BA\u306A\u30AD\u30E5\u30FC\u306E\u30B5\u30A4\u30BA\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u3066\u3044\u306A\u3044\u30AD\u30E5\u30FC\u307E\u305F\u306F\u76F4\u63A5\u30CF\u30F3\u30C9\u30AA\u30D5\u304C\u4F7F\u7528\u3055\u308C\u308B\u5834\u5408\u306F\u3001core-threads \u306E\u5024\u3092\u30BC\u30ED\u3088\u308A\u3082\u5927\u304D\u304F\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
managed-executor-service.reject-policy=\u30A2\u30DC\u30FC\u30C8\u3055\u308C\u305F\u30BF\u30B9\u30AF\u306B\u9069\u7528\u3055\u308C\u308B\u30DD\u30EA\u30B7\u30FC\u3002
managed-scheduled-executor-service=\u7BA1\u7406\u304A\u3088\u3073\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9
managed-scheduled-executor-service.add=\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u3092\u8FFD\u52A0
managed-scheduled-executor-service.remove=\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u3092\u524A\u9664
managed-scheduled-executor-service.jndi-name=\u7BA1\u7406\u304A\u3088\u3073\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u3092\u30EB\u30C3\u30AF\u30A2\u30C3\u30D7\u3059\u308B JNDI \u540D\u3002
managed-scheduled-executor-service.context-service=\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30B5\u30FC\u30D3\u30B9\u306E\u540D\u524D\u3002
managed-scheduled-executor-service.thread-factory=\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u540D\u524D\u3002
managed-scheduled-executor-service.hung-task-threshold=\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u306B\u3088\u3063\u3066\u30BF\u30B9\u30AF\u304C\u30CF\u30F3\u30B0\u3057\u305F\u3068\u898B\u306A\u3055\u308C\u308B\u30E9\u30F3\u30BF\u30A4\u30E0 (\u30DF\u30EA\u79D2\u5358\u4F4D)\u30020 \u306E\u5834\u5408\u306F\u30BF\u30B9\u30AF\u304C\u30CF\u30F3\u30B0\u3057\u305F\u3068\u898B\u306A\u3055\u308C\u308B\u3053\u3068\u306F\u3042\u308A\u307E\u305B\u3093\u3002
managed-scheduled-executor-service.long-running-tasks=\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u306B\u3088\u3063\u3066\u5B9F\u884C\u3055\u308C\u305F\u30BF\u30B9\u30AF\u306E\u671F\u9593\u3092\u6697\u793A\u3059\u308B\u30D5\u30E9\u30B0\u3002
managed-scheduled-executor-service.core-threads=\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u306E\u6700\u5C0F\u6570\u3002
managed-scheduled-executor-service.keepalive-time=\u30B9\u30EC\u30C3\u30C9\u306E\u6570\u304C\u30B3\u30A2\u3088\u308A\u3082\u5927\u304D\u3044\u5834\u5408\u3001\u7D42\u4E86\u3059\u308B\u524D\u306B\u4F59\u5206\u306A\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u306E\u30B9\u30EC\u30C3\u30C9\u304C\u65B0\u3057\u3044\u30BF\u30B9\u30AF\u3092\u5F85\u3064\u6700\u5927\u6642\u9593 (\u30DF\u30EA\u79D2\u5358\u4F4D)\u3002
managed-scheduled-executor-service.reject-policy=\u30A2\u30DC\u30FC\u30C8\u3055\u308C\u305F\u30BF\u30B9\u30AF\u306B\u9069\u7528\u3055\u308C\u308B\u30DD\u30EA\u30B7\u30FC\u3002
default-bindings=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E EE \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306E JNDI \u540D
default-bindings.add=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E EE \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306E JNDI \u540D\u3092\u8FFD\u52A0
default-bindings.remove=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E EE \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306E JNDI \u540D\u3092\u524A\u9664
default-bindings.context-service=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E EE\u30B3\u30F3\u30C6\u30F3\u30C4\u30B5\u30FC\u30D3\u30B9\u3092\u898B\u3064\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u308B JNDI \u540D
default-bindings.datasource=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E EE \u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u3092\u898B\u3064\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u308B JNDI \u540D
default-bindings.jms-connection-factory=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E EE JMS \u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3092\u898B\u3064\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u308B JNDI \u540D
default-bindings.managed-executor-service=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E EE \u3067\u7BA1\u7406\u3055\u308C\u305F\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u3092\u898B\u3064\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u308BJNDI \u540D
default-bindings.managed-scheduled-executor-service=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E EE \u3067\u7BA1\u7406\u304A\u3088\u3073\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u3092\u898B\u3064\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u308BJNDI \u540D
default-bindings.managed-thread-factory=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E EE \u3067\u7BA1\u7406\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3092\u898B\u3064\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u308B JNDI \u540D
