# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author croe@redhat.com
ee=La configuration du sous-syst\u00E8me EE.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author croe@redhat.com
ee.add=Ajouter le sous-syst\u00E8me EE.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author croe@redhat.com
ee.remove=Supprimer le sous-syst\u00E8me EE.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author croe@redhat.com
ee.global-modules=Une liste de modules qui doivent \u00EAtre rendus disponibles pour tous les d\u00E9ploiements.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author croe@redhat.com
ee.global-modules.name=Le nom du module.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author croe@redhat.com
ee.global-modules.slot=Le slot du module
ee.global-modules.annotations=Indique si un index d'annotations pr\u00E9-calcul\u00E9es doit \u00EAtre import\u00E9 de META-INF/jandex.idx
ee.global-modules.meta-inf=Indique si le r\u00E9pertoire META-INF doit \u00EAtre disponible pour le chargeur de classes de d\u00E9ploiements
ee.global-modules.services=Indique si un des services expos\u00E9s dans les META-INF/services doit \u00EAtre disponible pour le chargeur de classes de d\u00E9ploiements
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author croe@redhat.com
ee.ear-subdeployments-isolated=Drapeau qui indique si chacun des sous-d\u00E9ploiements qui se trouvent dans .ear peuvent acc\u00E9der aux classes qui appartiennent \u00E0 un autre sous-d\u00E9ploiement dans le m\u00EAme .ear. False signifie que les sous-d\u00E9ploiements peuvent voir des classes qui appartiennent \u00E0 d'autres sous-d\u00E9ploiements dans le .ear.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author croe@redhat.com
ee.spec-descriptor-property-replacement=Drapeau qui indique si les descripteurs d\u00E9finis par la sp\u00E9cification Java EE pourront avoir des nouvelles propri\u00E9t\u00E9s qui puissent s'appliquer.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-ee/org/jboss/as/ee/subsystem/LocalDescriptions, author croe@redhat.com
ee.jboss-descriptor-property-replacement=Drapeau qui indique si les descripteurs de d\u00E9ploiement sp\u00E9cifiques \u00E0 JBoss pourront avoir des nouvelles propri\u00E9t\u00E9s qui puissent s'appliquer.
ee.annotation-property-replacement=Indicateur pour savoir si les annotations EJB ont re\u00E7u des remplacements de propri\u00E9t\u00E9s
service=Services configurables de fa\u00E7on centrale et faisant partie du sous-syst\u00E8me EE.
context-service=Un service de contexte
context-service.add=Ajoute un service de contexte
context-service.remove=Supprime un service de contexte
context-service.jndi-name=Nom JNDI pour rechercher le service de contexte.
context-service.use-transaction-setup-provider=Marqueur indiquant so le fournisseur d'installation de transaction devrait \u00EAtre utilis\u00E9
managed-thread-factory=Une fabrique de threads g\u00E9r\u00E9s
managed-thread-factory.add=Ajoute la fabrique de threads
managed-thread-factory.remove=\ Supprime la fabrique de threads
managed-thread-factory.jndi-name=Nom JNDI pour rechercher la fabrique de threads g\u00E9r\u00E9s.
managed-thread-factory.context-service=Nom du service de contexte devant \u00EAtre utilis\u00E9 par la fabrique de threads g\u00E9r\u00E9s. 
managed-thread-factory.priority=Priorit\u00E9 appliqu\u00E9e aux threads cr\u00E9\u00E9s par la fabrique
managed-executor-service=Service d'ex\u00E9cuteur g\u00E9r\u00E9
managed-executor-service.add=Ajoute l'ex\u00E9cuteur
managed-executor-service.remove=Supprime l'ex\u00E9cuteur
managed-executor-service.jndi-name=Nom JNDI pour rechercher le service d'ex\u00E9cuteur g\u00E9r\u00E9.
managed-executor-service.context-service=Nom du service de contexte devant \u00EAtre utilis\u00E9 par l'ex\u00E9cuteur. 
managed-executor-service.thread-factory=Nom de l'usine de threads devant \u00EAtre utilis\u00E9 par l'ex\u00E9cuteur. 
managed-executor-service.hung-task-threshold=Le temps d'ex\u00E9cution, en millisecondes, pour les t\u00E2ches consid\u00E9r\u00E9es comme suspendues par le service d'ex\u00E9cuteur g\u00E9r\u00E9. Si la valeur correspond \u00E0 0, les t\u00E2ches ne sont jamais consid\u00E9r\u00E9es comme suspendues.
managed-executor-service.long-running-tasks=Indicateur qui donne une id\u00E9e sur la dur\u00E9e des t\u00E2ches ex\u00E9cut\u00E9es par l'ex\u00E9cuteur.
managed-executor-service.core-threads=Le nombre minimal de threads \u00E0 utiliser par l'ex\u00E9cuteur. Si non d\u00E9fini, la valeur de core-size par d\u00E9faut est calcul\u00E9 en fonction du nombre de processeurs. Une valeur de z\u00E9ro n'est pas conseill\u00E9e, et est parfois valide. Consultez l'attribut de longueur de la file d'attente pour plus de d\u00E9tails sur la fa\u00E7on dont cette valeur est utilis\u00E9e pour d\u00E9terminer la strat\u00E9gie de files d'attente.
managed-executor-service.max-threads=Le nombre maximal de threads \u00E0 utiliser par l'ex\u00E9cuteur. Si non d\u00E9fini, la valeur de core-size sera utilis\u00E9e. Cette valeur est ignor\u00E9e si l'on utilise une file d'attente illimit\u00E9e (la valeur de core-threads uniquement servira dans ce cas).
managed-executor-service.keepalive-time=Lorsque le nombre de threads est sup\u00E9rieur \u00E0 la valeur de core-threads, c'est le temps maximal, en millisecondes, pendant lequel des threads inactifs exc\u00E8s attendront de nouvelles t\u00E2ches avant de se terminer.
managed-executor-service.queue-length=La capacit\u00E9 de file d'attente de t\u00E2ches d'ex\u00E9cuteurs. Une longueur 0 signifie une livraison directe et une r\u00E9jection est possible. Une longueur ind\u00E9finie (par d\u00E9faut), ou Integer.MAX_VALUE, indique qu'une file d'attente illimit\u00E9e doit \u00EAtre utilis\u00E9e. Toutes les autres valeurs sp\u00E9cifient une taille de file d'attente exacte. En cas de file d'attente illimit\u00E9e ou de livraison directe,  on aura besoin d'une valeur de core-threads sup\u00E9rieure \u00E0 z\u00E9ro.
managed-executor-service.reject-policy=La strat\u00E9gie \u00E0 appliquer aux t\u00E2ches abandonn\u00E9es.
managed-scheduled-executor-service=Service d'ex\u00E9cuteur g\u00E9r\u00E9 programm\u00E9
managed-scheduled-executor-service.add=Ajoute l'ex\u00E9cuteur programm\u00E9
managed-scheduled-executor-service.remove=Supprime l'ex\u00E9cuteur programm\u00E9
managed-scheduled-executor-service.jndi-name=Nom JNDI pour rechercher le service d'ex\u00E9cuteur g\u00E9r\u00E9 programm\u00E9.
managed-scheduled-executor-service.context-service=Nom du service de contexte devant \u00EAtre utilis\u00E9 par l'ex\u00E9cuteur programm\u00E9. 
managed-scheduled-executor-service.thread-factory=Nom de l'usine de threads devant \u00EAtre utilis\u00E9 par l'ex\u00E9cuteur programm\u00E9. 
managed-scheduled-executor-service.hung-task-threshold=Le temps d'ex\u00E9cution, en millisecondes, pour les t\u00E2ches consid\u00E9r\u00E9es comme suspendues par le service d'ex\u00E9cuteur programm\u00E9. Si la valeur correspond \u00E0 0, les t\u00E2ches ne sont jamais consid\u00E9r\u00E9es comme suspendues.
managed-scheduled-executor-service.long-running-tasks=Indicateur qui donne une id\u00E9e sur la dur\u00E9e des t\u00E2ches ex\u00E9cut\u00E9es par l'ex\u00E9cuteur programm\u00E9.
managed-scheduled-executor-service.core-threads=Nombre minimum de threads devant \u00EAtre utilis\u00E9 par l'ex\u00E9cuteur programm\u00E9. 
managed-scheduled-executor-service.keepalive-time=Lorsque le nombre de threads est sup\u00E9rieur \u00E0 la valeur de core-threads, c'est le temps maximal, en millisecondes, pendant lequel des threads inactifs exc\u00E8s attendront de nouvelles t\u00E2ches avant de se terminer.
managed-scheduled-executor-service.reject-policy=La strat\u00E9gie \u00E0 appliquer aux t\u00E2ches abandonn\u00E9es.
default-bindings=Les noms JNDI des liaisons EE par d\u00E9faut
default-bindings.add=Les noms JNDI des liaisons EE par d\u00E9faut
default-bindings.remove=Supprime les noms JNDI des liaisons EE par d\u00E9faut
default-bindings.context-service=Le nom JNDI o\u00F9 le service de contexte EE par d\u00E9faut se trouve
default-bindings.datasource=Le nom JNDI o\u00F9 la source de donn\u00E9es EE par d\u00E9faut se trouve
default-bindings.jms-connection-factory=Le nom JNDI o\u00F9 la farique de connexions JMS EE par d\u00E9faut se trouve
default-bindings.managed-executor-service=Le nom JNDI o\u00F9 le service Managed Executor EE par d\u00E9faut se trouve
default-bindings.managed-scheduled-executor-service=Le nom JNDI o\u00F9 le service Managed Scheduled Executor EE par d\u00E9faut se trouve
default-bindings.managed-thread-factory=Le nom JNDI o\u00F9 la fabrique de threads EE g\u00E9r\u00E9e par d\u00E9faut se trouve
