iiop-openjdk.socket-binding=O nome da configura\u00E7\u00E3o socket binding que especifica a porta ORB.
iiop-openjdk.ssl-socket-binding=O nome da configura\u00E7\u00E3o socket binding que especifica a porta SSL ORB.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.security=Indica se \u00E9 que os interceptores de seguran\u00E7a est\u00E3o prestes a serem instalados (ativados) ou n\u00E3o (desativados).
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.transactions=Indica se \u00E9 que os interceptores das transa\u00E7\u00F5es est\u00E3o prestes a serem instalados (ativados ou especificados) ou n\u00E3o (desativados). O valor 'ativado' habilitou o JTS enquanto 'especificado' habilita o modo compat\u00EDvel de especifica\u00E7\u00E3o (n\u00E3o-JTS) que rejeita os contextos de transa\u00E7\u00E3o de entrada.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.root-context=O contexto root de servi\u00E7o de nomea\u00E7\u00E3o.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.export-corbaloc=Indica se \u00E9 que o contexto root deve ser exportado como corbaloc\:\:address\:port/NameService (ativado) ou n\u00E3o (desativado).
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.support-ssl=Indica se \u00E9 que o SSL deve ser suportado (ativado) ou n\u00E3o (desativado).
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.security-domain=O nome do security domain que mant\u00E9m a tecla e trust stores que ser\u00E3o usados para estabelecer conex\u00F5es SSL.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.add-component-via-interceptor=Indica se \u00E9 que os componentes SSL devem ser adicionados por um interceptor IOR (ativado) ou n\u00E3o (desativado).
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.client-supports=O valor que indica os par\u00E2metros suportados pelo cliente SSL (None, ServerAuth, ClientAuth, MutualAuth).
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.client-requires=O valor que indica os par\u00E2metros solicitados do cliente SSL (None, ServerAuth, ClientAuth, MutualAuth).
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.server-supports=O valor que indica os par\u00E2metros solicitados do servidor SSL (None, ServerAuth, ClientAuth, MutualAuth).
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.server-requires=O valor que indica o par\u00E2metros solicitados do servidor SSL (None, ServerAuth, ClientAuth, MutualAuth).
iiop-openjdk.trust-in-client=Indica se o transporte deve solicitar confiabilidade no cliente para ser estabelecido. Os valores v\u00E1lidos s\u00E3o 'none', supported' e 'required'.
iiop-openjdk.trust-in-target=Indica se o transporte deve requerer confiabilidade no destino para ser estabelecido. Os valores v\u00E1lidos s\u00E3o 'none' e 'supported'.
iiop-openjdk.integrity=Indica se \u00E9 que o transporte deve requerer prote\u00E7\u00E3o de integridade ou n\u00E3o. Os valores v\u00E1lidos s\u00E3o 'none', 'supported' e 'required'.
iiop-openjdk.confidentiality=Indica se \u00E9 que o transporte deve requerer prote\u00E7\u00E3o de integridade de confiabilidade ou n\u00E3o. Os valores v\u00E1lidos s\u00E3o 'none', 'supported' e 'required'.
iiop-openjdk.detect-replay=Indica se \u00E9 que o transporte deve requerer detec\u00E7\u00E3o de resposta ou n\u00E3o. Os valores v\u00E1lidos s\u00E3o 'none', 'supported' e 'required'.
iiop-openjdk.detect-misordering=Indica se \u00E9 que o transporte deve requerer a detec\u00E7\u00E3o desordenada ou n\u00E3o. Os valores v\u00E1lidos s\u00E3o 'none', 'supported' e 'required'.
iiop-openjdk.ior-settings.as-context=O servi\u00E7o de autentica\u00E7\u00E3o
iiop-openjdk.auth-method=O m\u00E9todo de autentica\u00E7\u00E3o. Os valores v\u00E1lidos s\u00E3o 'none' e 'username_password'.
iiop-openjdk.realm=O nome realm do authentication service (AS - servi\u00E7o de autentica\u00E7\u00E3o).
iiop-openjdk.required=Indica se a autentica\u00E7\u00E3o \u00E9 requerida (verdadeiro) ou n\u00E3o (falso).
iiop-openjdk.caller-propagation=Indica se \u00E9 que a identidade do chamador deve ser propagada no contexto SAS ou n\u00E3o. Os valores v\u00E1lidos s\u00E3o 'none' e 'supported'.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.properties=A lista de propriedades de tecla/valor gen\u00E9rico.
