iiop-openjdk=La configuraci\u00F3n del subsistema iiop-openjdk.
iiop-openjdk.add=Agrega el subsistema  iiop-openjdk
iiop-openjdk.remove=Borra el subsistema de nombrado. 
iiop-openjdk.configuration=Especifica la categor\u00EDa de la configuraci\u00F3n del subsistema.
iiop-openjdk.persistent-server-id=ID persistente del servidor. Las referencias de objeto persistente son v\u00E1lidas a trav\u00E9s de varias activaciones del servidor y se identifican mediante esta propiedad. Como resultado, muchas activaciones del mismo servidor deber\u00EDan tener esta propiedad establecida con el mismo valor, las diferentes instancias de servidor que se ejecutan en el mismo host deber\u00EDan tener ID de servidor diferentes.
iiop-openjdk.giop-version=La versi\u00F3n menor GIOP a utilizar.
iiop-openjdk.socket-binding=El nombre de la configuraci\u00F3n de enlace de sockets que especifica el puerto ORB.
iiop-openjdk.ssl-socket-binding=El nombre de la configuraci\u00F3n de enlace de sockets que especifica el puerto SSL ORB.
iiop-openjdk.high-water-mark=Par\u00E1metro de la cach\u00E9 de conexi\u00F3n TCP. Cada vez que el n\u00FAmero de conexiones excede este valor ORB intenta reclamar conexiones. El n\u00FAmero de conexiones reclamadas es especificado por la propiedad tcp-number-to-reclaim. Si esta propiedad no est\u00E1 definida, entonces se configura como OpenJDK ORB predeterminada.
iiop-openjdk.number-to-reclaim=Par\u00E1metro de la cach\u00E9 de conexi\u00F3n TCP. Cada vez que el n\u00FAmero de conexiones excede la propiedad  tcp-high-water-mark, ORB intenta reclamar conexiones. El n\u00FAmero de conexiones reclamadas es especificado por esta propiedad.  Si no est\u00E1 definida, entonces se configura como OpenJDK ORB predeterminada.
iiop-openjdk.security=Indica si los interceptores de seguridad se deben instalar (client, identity, elytron) o no (none).
iiop-openjdk.authentication-context=El nombre del contexto de autenticaci\u00F3n utilizado cuando el inicializador de seguridad se configura en 'elytron'.
iiop-openjdk.transactions=Indica si los interceptores de transacci\u00F3n se deben instalar (full o spec) o no (none). El valor 'full' habilita JTS, mientras que el valor 'spec' habilita un modo que cumple con las especificaciones (no JTS) que rechaza los contextos de transacci\u00F3n entrantes.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author angela.garcia
iiop-openjdk.root-context=El contexto ra\u00EDz del servicio de nombrado.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author angela.garcia
iiop-openjdk.export-corbaloc=Indica si el contexto ra\u00EDz se debe exportar como  corbaloc\:\:address\:port/NameService (on) o no (off).
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author angela.garcia
iiop-openjdk.support-ssl=Indica si SSL se debe soportar (on) o no (off).
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author angela.garcia
iiop-openjdk.security-domain=El nombre del dominio de seguridad que mantiene los almacenes de llave y de confianza que se utilizar\u00E1n para establecer conexiones SSL.
iiop-openjdk.server-ssl-context=El nombre del contexto SSL utilizado para crear sockets SSL del lado del servidor.
iiop-openjdk.client-ssl-context=El nombre del contexto SSL utilizado para crear sockets SSL del lado del cliente.
iiop-openjdk.client-requires-ssl=Indica si las conexiones IIOP desde servidor requieren SSL.
iiop-openjdk.server-requires-ssl=Indica si las conexiones IIOP hacia el servidor requieren SSL.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author angela.garcia
iiop-openjdk.add-component-via-interceptor=Indica si los componentes SSL deben ser agregados por un interceptor IOR (on) o no (off).
iiop-openjdk.add-component-via-interceptor.deprecated=Indica si los componentes SSL deben ser agregados por un interceptor IOR (on) o no (off).
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author angela.garcia
iiop-openjdk.client-supports=Valor que indica los par\u00E1metros soportados por SSL cliente (None, ServerAuth, ClientAuth, MutualAuth).
iiop-openjdk.client-supports.deprecated=Use client-requires-ssl en su lugar.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author angela.garcia
iiop-openjdk.client-requires=Valor que indica los par\u00E1metros soportados por SSL cliente (None, ServerAuth, ClientAuth, MutualAuth).
iiop-openjdk.client-requires.deprecated=Use client-requires-ssl en su lugar.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author angela.garcia
iiop-openjdk.server-supports=Valor que indica los par\u00E1metros soportados por SSL servidor (None, ServerAuth, ClientAuth, MutualAuth).
iiop-openjdk.server-supports.deprecated=Use server-requires-ssl en su lugar.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author angela.garcia
iiop-openjdk.server-requires=Valor que indica los par\u00E1metros requeridos por SSL servidor (None, ServerAuth, ClientAuth, MutualAuth).
iiop-openjdk.server-requires.deprecated=Use server-requires-ssl en su lugar.
iiop-openjdk.trust-in-client=Indica si el transporte debe requerir el establecer confianza en el cliente. Los valores v\u00E1lidos son 'none', 'supported' y 'required'.
iiop-openjdk.trust-in-client.deprecated=Use server-requires-ssl en su lugar.
iiop-openjdk.trust-in-target=Indica si el transporte tiene que requerir la confianza en el destino para poder establecerse. Los valores v\u00E1lidos son 'none' y 'supported'.
iiop-openjdk.trust-in-target.deprecated=Use server-requires-ssl en su lugar.
iiop-openjdk.integrity=Indica si el transporte tiene que requerir protecci\u00F3n de integridad o no. Los valores v\u00E1lidos son 'none', 'supported' y 'required'.
iiop-openjdk.integrity.deprecated=Use server-requires-ssl en su lugar.
iiop-openjdk.confidentiality=Indica si el transporte tiene que requerir protecci\u00F3n de confidencialidad o no. Los valores v\u00E1lidos son 'none', 'supported' y 'required'.
iiop-openjdk.confidentiality.deprecated=Use server-requires-ssl en su lugar.
iiop-openjdk.detect-replay=Indica si el transporte tiene que requerir detecci\u00F3n de volver a ver o no. Los valores v\u00E1lidos son 'none', 'supported' y 'required'.
iiop-openjdk.detect-replay.deprecated=Use server-requires-ssl en su lugar.
iiop-openjdk.detect-misordering=Indica si el transporte tiene que requerir detecci\u00F3n de orden equivocado o no. Los valores v\u00E1lidos son 'none', 'supported' y 'required'.
iiop-openjdk.detect-misordering.deprecated=Use server-requires-ssl en su lugar.
iiop-openjdk.ior-settings.as-context=La configuraci\u00F3n del contexto del servicio de autenticaci\u00F3n (SA).
iiop-openjdk.auth-method=El m\u00E9todo de autenticaci\u00F3n. Los valores v\u00E1lidos son 'none' y 'username_password'.
iiop-openjdk.realm=El nombre del campo del servicio de autenticaci\u00F3n (AS).
iiop-openjdk.required=Indica si la autenticaci\u00F3n se requiere (true) o no (false).
iiop-openjdk.caller-propagation=Indica si la identidad del que realiza la llamada se debe propagar en el contexto SAS o no. Los valores v\u00E1lidos son 'none' y 'supported'.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author angela.garcia
iiop-openjdk.properties=Una lista de propiedades de valor/llave gen\u00E9ricos.
iiop-openjdk.properties.add=Agrega el recurso que contiene una lista de las propiedades gen\u00E9ricas de llave/valor. 
iiop-openjdk.properties.remove=Retira el recurso que contiene una lista de las propiedades gen\u00E9ricas de llave/valor. 
iiop-openjdk.properties.property=Propiedades de llave/valor gen\u00E9ricas.
iiop-openjdk.properties.property.add=Agrega el recurso que contiene una propiedade de llave/valor gen\u00E9rica. 
iiop-openjdk.properties.property.remove=Retira el recurso que contiene una propiedade de llave/valor gen\u00E9rica. 
iiop-openjdk.properties.property.value=Valor de la propiedad.
