iiop-openjdk=Die iiop-openjdk-Untersystem Konfiguration.
iiop-openjdk.add=F\u00FCgt das iiop-openjdk Untersystem hinzu.
iiop-openjdk.remove=Entfernt die Naming-Konfiguration.
iiop-openjdk.configuration=Legt die Kategorie der Subsystemkonfiguration fest.
iiop-openjdk.persistent-server-id=Persistente ID des Servers. Persistente Objektreferenzen sind g\u00FCltig \u00FCber viele Aktivierungen des Servers hinweg und identifizieren den Server anhand dieser Property. Daraus folgt, dass viele Aktivierungen desselben Servers denselben Wert f\u00FCr diese Property haben sollten, verschiedene Server-Instanzen auf demselben Host dagegen sollten verschiedene Server-IDs haben.
iiop-openjdk.giop-version=Die zu verwendende GIOP-Version.
iiop-openjdk.socket-binding=Der Name der Socket-Anbindung Konfiguration, die den ORB-Port definiert.
iiop-openjdk.ssl-socket-binding=Der Name der Socket-Anbindung Konfiguration, die den ORB-SSL-Port definiert.
iiop-openjdk.high-water-mark=TCP-Verbindungscache-Parameter. Jedes Mal, wenn die Anzahl der Verbindungen diesen Wert \u00FCbersteigt, versucht ORB Verbindungen zur\u00FCckzuerhalten. Die Anzahl der zur\u00FCckerhaltenen Verbindungen wird festgelegt durch die Property tcp-number-to-reclaim. Falls diese Property nicht festgelegt ist, wird der OpenJDK ORB Standard konfiguriert.
iiop-openjdk.number-to-reclaim=TCP-Verbindungscache-Parameter. Jedes Mal, wenn die Anzahl der Verbindungen den Wert der Property tcp-high-water-mark \u00FCbersteigt, versucht ORB Verbindungen zur\u00FCckzuerhalten. Die Anzahl der zur\u00FCckerhaltenen Verbindungen wird festgelegt durch diese Property. Falls sie nicht festgelegt ist, wird der OpenJDK ORB Standard konfiguriert.
iiop-openjdk.security=Gibt an, ob die Sicherheitsinterzeptoren installiert werden sollen  (client, identity, elytron) oder nicht (none).
iiop-openjdk.authentication-context=Der Name des verwendeten Authentifizierungskontexts, wenn der Sicherheits-Initializer auf "elytron" gesetzt ist.
iiop-openjdk.transactions=Gibt an, ob die Transaktionsinterzeptoren installiert werden sollen (full oder spec) oder nicht (none). Der Wert "full" aktiviert JTS, w\u00E4hrend "spec" einen Spec-konformen Modus (nicht JTS) aktiviert, der eingehende Transaktionskontexte ablehnt.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author Hedda Peters
iiop-openjdk.root-context=Der Naming-Service Root-Kontext
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author jdimanos
iiop-openjdk.export-corbaloc=Zeigt an, ob der Root-Kontext als corbaloc\:\:address\:port/NameService exportiert werden soll (on) oder nicht (off).
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author jdimanos
iiop-openjdk.support-ssl=Zeigt an, ob SSL unterst\u00FCtzt werden soll (on) oder nicht (off).
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author Hedda Peters
iiop-openjdk.security-domain=Der Name der Sicherheitsdomain, welche die Key- und Truststores enth\u00E4lt, die zum Aufbau von SSL-Verbindungen verwendet werden.
iiop-openjdk.server-ssl-context=Der Name des SSL-Kontexts, mit dem serverseitige SSL-Sockets erstellt werden.
iiop-openjdk.client-ssl-context=Der Name des SSL-Kontexts, mit dem clientseitige SSL-Sockets erstellt werden.
iiop-openjdk.client-requires-ssl=Gibt an, ob IIOP-Verbindungen vom Server SSL erfordern.
iiop-openjdk.server-requires-ssl=Gibt an, ob IIOP-Verbindungen zum Server SSL erfordern.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author jdimanos
iiop-openjdk.add-component-via-interceptor=Zeigt an, ob SSL-Komponenten von einem IOR-Interzeptor hinzugef\u00FCgt werden sollen (on) oder nicht (off).
iiop-openjdk.add-component-via-interceptor.deprecated=Zeigt an, ob SSL-Komponenten von einem IOR-Interzeptor hinzugef\u00FCgt werden sollen (on) oder nicht (off).
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author jdimanos
iiop-openjdk.client-supports=Wert, der die Client-SSL unterst\u00FCtzten Parameter anzeigt (None, ServerAuth, ClientAuth, MutualAuth).
iiop-openjdk.client-supports.deprecated=Verwenden Sie stattdessen "client-requires-ssl".
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author jdimanos
iiop-openjdk.client-requires=Wert, der die Client-SSL erforderlichen Parameter anzeigt (None, ServerAuth, ClientAuth, MutualAuth).
iiop-openjdk.client-requires.deprecated=Verwenden Sie stattdessen "client-requires-ssl".
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author jdimanos
iiop-openjdk.server-supports=Wert, der die Server-SSL unterst\u00FCtzten Parameter anzeigt (None, ServerAuth, ClientAuth, MutualAuth).
iiop-openjdk.server-supports.deprecated=Verwenden Sie stattdessen "server-requires-ssl".
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author jdimanos
iiop-openjdk.server-requires=Wert, der die Server-SSL erforderlichen Parameter anzeigt (None, ServerAuth, ClientAuth, MutualAuth).
iiop-openjdk.server-requires.deprecated=Verwenden Sie stattdessen "server-requires-ssl".
iiop-openjdk.trust-in-client=Gibt an, ob der Transport ein "Trust in Client" (eine Trusted-Beziehung) zur Erstellung erfordert. G\u00FCltige Werte sind 'none', 'supported' und 'required'.
iiop-openjdk.trust-in-client.deprecated=Verwenden Sie stattdessen "server-requires-ssl".
iiop-openjdk.trust-in-target=Gibt an, ob der Transport ein "Trust in Target" (eine Trusted-Beziehung) zur Erstellung erfordert. G\u00FCltige Werte sind 'none' und 'supported'.
iiop-openjdk.trust-in-target.deprecated=Verwenden Sie stattdessen "server-requires-ssl".
iiop-openjdk.integrity=Gibt an, ob der Transport einen Integrit\u00E4tsschutz (Integrity Protection) erfordert oder nicht. G\u00FCltige Werte sind 'none', 'supported' und 'required'.
iiop-openjdk.integrity.deprecated=Verwenden Sie stattdessen "server-requires-ssl".
iiop-openjdk.confidentiality=Gibt an, ob der Transport einen Vertraulichkeitsschutz (Confidentiality Protection) erfordert oder nicht. G\u00FCltige Werte sind 'none', 'supported' und 'required'.
iiop-openjdk.confidentiality.deprecated=Verwenden Sie stattdessen "server-requires-ssl".
iiop-openjdk.detect-replay=Gibt an, ob der Transport eine Replay-Erkennung erfordert oder nicht. G\u00FCltige Werte sind 'none', 'supported' und 'required'.
iiop-openjdk.detect-replay.deprecated=Verwenden Sie stattdessen "server-requires-ssl".
iiop-openjdk.detect-misordering=Gibt an, ob der Transport eine Misordering-Erkennung erfordert oder nicht. G\u00FCltige Werte sind 'none', 'supported' und 'required'.
iiop-openjdk.detect-misordering.deprecated=Verwenden Sie stattdessen "server-requires-ssl".
iiop-openjdk.ior-settings.as-context=Die Kontext-Einstellungen f\u00FCr den Authentication Service (AS).
iiop-openjdk.auth-method=Die Authentifizierungsmethode. G\u00FCltige Werte sind 'none' und 'username_password'.
iiop-openjdk.realm=Der authentication service (AS) Bereichsname.
iiop-openjdk.required=Gibt an, ob Authentifizierung notwendig ist (true) oder nicht (false).
iiop-openjdk.caller-propagation=Gibt an, ob die Aufruferidentit\u00E4t (Caller-ID) im SAS-Kontext propagiert werden sollte oder nicht. G\u00FCltige Werte sind 'none' und 'supported'.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author jdimanos
iiop-openjdk.properties=Eine Liste generischer Schl\u00FCssel/Wert Properties.
iiop-openjdk.properties.add=F\u00FCgt die Ressource hinzu, die eine Liste generischer Schl\u00FCssel/Wert-Properties enth\u00E4lt.
iiop-openjdk.properties.remove=Entfernt die Ressource, die eine Liste generischer Schl\u00FCssel/Wert-Properties enth\u00E4lt.
iiop-openjdk.properties.property=Generische Schl\u00FCssel/Wert Properties.
iiop-openjdk.properties.property.add=F\u00FCgt die Ressource hinzu, die eine generische Schl\u00FCssel/Wert-Property enth\u00E4lt.
iiop-openjdk.properties.property.remove=Entfernt die Ressource, die eine generische Schl\u00FCssel/Wert-Property enth\u00E4lt.
iiop-openjdk.properties.property.value=Wert der Property.
