iiop-openjdk=Configura\u00E7\u00E3o do subsistema iiop-openjdk.
iiop-openjdk.add=Adiciona o subsistema iiop-openjdk. 
iiop-openjdk.remove=Remove configura\u00E7\u00E3o de nomenclatura. 
iiop-openjdk.configuration=Especifica categoria de configura\u00E7\u00E3o de subsistema. 
iiop-openjdk.persistent-server-id=ID persistente do servidor. Refer\u00EAncias de objetos persistentes s\u00E3o v\u00E1lidas para  ativa\u00E7\u00F5es do servidor e identificam a utiliza\u00E7\u00E3o desta propriedade. Como resultado disto\: muitas ativa\u00E7\u00F5es do mesmo servidor deve ter esta propriedade definida para o mesmo valor, inst\u00E2ncias de servidores diferentes executando no mesmo host devem ter id de servidores diferentes.
iiop-openjdk.giop-version=A vers\u00E3o GIOP a ser utilizada. 
iiop-openjdk.socket-binding=O nome da configura\u00E7\u00E3o socket binding que especifica a porta ORB.
iiop-openjdk.ssl-socket-binding=O nome da configura\u00E7\u00E3o socket binding que especifica a porta SSL ORB.
iiop-openjdk.high-water-mark=O par\u00E2metro da cache de conex\u00E3o TCP. Cada vez que o n\u00FAmero de conex\u00F5es excede este valor ORB tenta recuperar conex\u00F5es. O n\u00FAmero de conex\u00F5es recuperadas est\u00E1 especificado pela propriedade tcp-number-to-reclaim. Caso esta propriedade n\u00E3o esteja definida ent\u00E3o \u00E9 configurada como padr\u00E3o OpenJDK ORB .
iiop-openjdk.number-to-reclaim=O par\u00E2metro da cache de conex\u00E3o TCP. Cada vez que o n\u00FAmero de conex\u00F5es exceder a propriedade tcp-high-water-mark ent\u00E3o ORB  tenta recuperar conex\u00F5es. O n\u00FAmero de conex\u00F5es recuperadas \u00E9 especificado por esta propriedade. Se n\u00E3o estiver definido, ent\u00E3o \u00E9 configurada como padr\u00E3o  OpenJDK ORB.
iiop-openjdk.security=Indica se os interceptores de seguran\u00E7a devem ser instalados (client, identity, elytron) ou n\u00E3o (none).
iiop-openjdk.authentication-context=O nome do contexto de autentica\u00E7\u00E3o usado quando o inicializador de seguran\u00E7a est\u00E1 definido como "elytron".
iiop-openjdk.transactions=Indica se os interceptores de transa\u00E7\u00F5es devem ser instalados (full ou spec) ou n\u00E3o (none). O valor "full" ativa o JTS enquanto que "spec" ativa um modo de conformidade com especifica\u00E7\u00F5es (n\u00E3o JTS) que rejeita contextos de transa\u00E7\u00E3o de entrada.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.root-context=O contexto root de servi\u00E7o de nomea\u00E7\u00E3o.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.export-corbaloc=Indica se \u00E9 que o contexto root deve ser exportado como corbaloc\:\:address\:port/NameService (ativado) ou n\u00E3o (desativado).
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.support-ssl=Indica se \u00E9 que o SSL deve ser suportado (ativado) ou n\u00E3o (desativado).
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.security-domain=O nome do security domain que mant\u00E9m a tecla e trust stores que ser\u00E3o usados para estabelecer conex\u00F5es SSL.
iiop-openjdk.server-ssl-context=O nome do contexto SSL usado para criar soquetes SSL no lado do servidor.
iiop-openjdk.client-ssl-context=O nome do contexto SSL usado para criar soquetes SSL no lado do cliente.
iiop-openjdk.client-requires-ssl=Indica se conex\u00F5es IIOP do servidor requerem SSL.
iiop-openjdk.server-requires-ssl=Indica se conex\u00F5es IIOP para o servidor requerem SSL.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.add-component-via-interceptor=Indica se \u00E9 que os componentes SSL devem ser adicionados por um interceptor IOR (ativado) ou n\u00E3o (desativado).
iiop-openjdk.add-component-via-interceptor.deprecated=Indica se componentes SSL devem ser adicionados por um interceptor IOR (on) ou n\u00E3o (off).
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.client-supports=O valor que indica os par\u00E2metros suportados pelo cliente SSL (None, ServerAuth, ClientAuth, MutualAuth).
iiop-openjdk.client-supports.deprecated=Use client-requires-ssl em seu lugar.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.client-requires=O valor que indica os par\u00E2metros solicitados do cliente SSL (None, ServerAuth, ClientAuth, MutualAuth).
iiop-openjdk.client-requires.deprecated=Use client-requires-ssl em seu lugar.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.server-supports=O valor que indica os par\u00E2metros solicitados do servidor SSL (None, ServerAuth, ClientAuth, MutualAuth).
iiop-openjdk.server-supports.deprecated=Use server-requires-ssl em seu lugar.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.server-requires=O valor que indica o par\u00E2metros solicitados do servidor SSL (None, ServerAuth, ClientAuth, MutualAuth).
iiop-openjdk.server-requires.deprecated=Use server-requires-ssl em seu lugar.
iiop-openjdk.trust-in-client=Indica se o transporte deve solicitar confiabilidade no cliente para ser estabelecido. Os valores v\u00E1lidos s\u00E3o 'none', supported' e 'required'.
iiop-openjdk.trust-in-client.deprecated=Use server-requires-ssl em seu lugar.
iiop-openjdk.trust-in-target=Indica se o transporte deve requerer confiabilidade no destino para ser estabelecido. Os valores v\u00E1lidos s\u00E3o 'none' e 'supported'.
iiop-openjdk.trust-in-target.deprecated=Use server-requires-ssl em seu lugar.
iiop-openjdk.integrity=Indica se \u00E9 que o transporte deve requerer prote\u00E7\u00E3o de integridade ou n\u00E3o. Os valores v\u00E1lidos s\u00E3o 'none', 'supported' e 'required'.
iiop-openjdk.integrity.deprecated=Use server-requires-ssl em seu lugar.
iiop-openjdk.confidentiality=Indica se \u00E9 que o transporte deve requerer prote\u00E7\u00E3o de integridade de confiabilidade ou n\u00E3o. Os valores v\u00E1lidos s\u00E3o 'none', 'supported' e 'required'.
iiop-openjdk.confidentiality.deprecated=Use server-requires-ssl em seu lugar.
iiop-openjdk.detect-replay=Indica se \u00E9 que o transporte deve requerer detec\u00E7\u00E3o de resposta ou n\u00E3o. Os valores v\u00E1lidos s\u00E3o 'none', 'supported' e 'required'.
iiop-openjdk.detect-replay.deprecated=Use server-requires-ssl em seu lugar.
iiop-openjdk.detect-misordering=Indica se \u00E9 que o transporte deve requerer a detec\u00E7\u00E3o desordenada ou n\u00E3o. Os valores v\u00E1lidos s\u00E3o 'none', 'supported' e 'required'.
iiop-openjdk.detect-misordering.deprecated=Use server-requires-ssl em seu lugar.
iiop-openjdk.ior-settings.as-context=O servi\u00E7o de autentica\u00E7\u00E3o
iiop-openjdk.auth-method=O m\u00E9todo de autentica\u00E7\u00E3o. Os valores v\u00E1lidos s\u00E3o 'none' e 'username_password'.
iiop-openjdk.realm=O nome realm do authentication service (AS - servi\u00E7o de autentica\u00E7\u00E3o).
iiop-openjdk.required=Indica se a autentica\u00E7\u00E3o \u00E9 requerida (verdadeiro) ou n\u00E3o (falso).
iiop-openjdk.caller-propagation=Indica se \u00E9 que a identidade do chamador deve ser propagada no contexto SAS ou n\u00E3o. Os valores v\u00E1lidos s\u00E3o 'none' e 'supported'.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jacorb/org/jboss/as/jacorb/LocalDescriptions, author ldelima@redhat.com
iiop-openjdk.properties=A lista de propriedades de tecla/valor gen\u00E9rico.
iiop-openjdk.properties.add=Adiciona o recurso que cont\u00E9m uma lista de propriedades de chave/valor gen\u00E9rico. 
iiop-openjdk.properties.remove=Remove um recurso que cont\u00E9m uma lista de propriedades de chaves/valor gen\u00E9rico. 
iiop-openjdk.properties.property=Propriedades de chave/valor gen\u00E9ricas . 
iiop-openjdk.properties.property.add=Adiciona o recurso que cont\u00E9m uma lista de propriedades de chave/valor gen\u00E9ricas. 
iiop-openjdk.properties.property.remove=Remove um recurso que cont\u00E9m uma propriedade de chave/valor gen\u00E9rica.
iiop-openjdk.properties.property.value=Valor da propriedade. 
