# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan=infinispan \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8A2D\u5B9A\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.add=infinispan \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u8FFD\u52A0\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.describe=infinispan \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8AAC\u660E
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.remove=infinispan \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u524A\u9664
infinispan.cache-container=infinispan \u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u8A2D\u5B9A
infinispan.cache-container.default-cache=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E infinispan \u30AD\u30E3\u30C3\u30B7\u30E5
infinispan.cache-container.listener-executor=\u30EC\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30AD\u30E5\u30FC\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC
infinispan.cache-container.listener-executor.deprecated=\u975E\u63A8\u5968\u3002\u4ECA\u5F8C\u306E\u30EA\u30EA\u30FC\u30B9\u3067\u306F\u3001\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306B\u57CB\u3081\u8FBC\u307E\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u8A2D\u5B9A\u306B\u7F6E\u304D\u63DB\u3048\u3089\u308C\u307E\u3059\u3002
infinispan.cache-container.eviction-executor=\u30A8\u30D3\u30AF\u30B7\u30E7\u30F3\u306B\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC
infinispan.cache-container.eviction-executor.deprecated=\u975E\u63A8\u5968\u3002\u4ECA\u5F8C\u306E\u30EA\u30EA\u30FC\u30B9\u3067\u306F\u3001\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306B\u57CB\u3081\u8FBC\u307E\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u8A2D\u5B9A\u306B\u7F6E\u304D\u63DB\u3048\u3089\u308C\u307E\u3059\u3002
infinispan.cache-container.replication-queue-executor=\u975E\u540C\u671F\u30AD\u30E3\u30C3\u30B7\u30E5\u64CD\u4F5C\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC
infinispan.cache-container.replication-queue-executor.deprecated=\u975E\u63A8\u5968\u3002\u4ECA\u5F8C\u306E\u30EA\u30EA\u30FC\u30B9\u3067\u306F\u3001\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306B\u57CB\u3081\u8FBC\u307E\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u8A2D\u5B9A\u306B\u7F6E\u304D\u63DB\u3048\u3089\u308C\u307E\u3059\u3002
infinispan.cache-container.jndi-name=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u3092\u30D0\u30A4\u30F3\u30C9\u3059\u308B jndi \u540D\u3002
infinispan.cache-container.module=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u8A2D\u5B9A\u3092\u69CB\u7BC9\u3059\u308B\u6642\u306B\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC\u304C\u4F7F\u7528\u3055\u308C\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u3002
infinispan.cache-container.start=EAGER (\u5373\u6642\u8D77\u52D5) \u307E\u305F\u306F LAZY (\u30AA\u30F3\u30C7\u30DE\u30F3\u30C9\u8D77\u52D5) \u306E\u3044\u305A\u308C\u304B\u306B\u306A\u308B\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u8D77\u52D5\u30E2\u30FC\u30C9\u3002
infinispan.cache-container.start.deprecated=\u975E\u63A8\u5968\u3002\u4ECA\u5F8C\u306E\u30EA\u30EA\u30FC\u30B9\u3067\u306F LAZY \u30E2\u30FC\u30C9\u306E\u307F\u304C\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u307E\u3059\u3002
infinispan.cache-container.statistics-enabled=\u6709\u52B9\u306A\u5834\u5408\u306F\u3001\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u306B\u95A2\u3059\u308B\u7D71\u8A08\u60C5\u5831\u304C\u53CE\u96C6\u3055\u308C\u307E\u3059\u3002
infinispan.cache-container.thread-pool=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
infinispan.cache-container.cache=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u304C\u4F7F\u7528\u3067\u304D\u308B\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u4E00\u89A7
infinispan.cache-container.singleton=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u5358\u4E00\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u8A2D\u5B9A\u8981\u7D20\u306E\u30BB\u30C3\u30C8\u3002
infinispan.cache-container.aliases=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u4E00\u89A7
infinispan.cache-container.add-alias=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u8FFD\u52A0
infinispan.cache-container.add-alias.name=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306B\u8FFD\u52A0\u3059\u308B\u30A8\u30A4\u30EA\u30A2\u30B9\u306E\u540D\u524D\u3002
infinispan.cache-container.add-alias.deprecated=\u975E\u63A8\u5968\u3002\u4EE3\u308F\u308A\u306B list-add \u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
infinispan.cache-container.remove-alias=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u524A\u9664
infinispan.cache-container.remove-alias.name=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u304B\u3089\u524A\u9664\u3059\u308B\u30A8\u30A4\u30EA\u30A2\u30B9\u306E\u540D\u524D\u3002
infinispan.cache-container.remove-alias.deprecated=\u975E\u63A8\u5968\u3002\u4EE3\u308F\u308A\u306B list-remove \u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
infinispan.cache-container.add=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u3092 infinispan  \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3078\u8FFD\u52A0
infinispan.cache-container.remove=infinispan \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3088\u308A\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u3092\u524A\u9664
infinispan.cache-container.cache-manager-status=\u30AD\u30E3\u30C3\u30B7\u30E5\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u30B9\u30C6\u30FC\u30BF\u30B9\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u8D77\u52D5\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache-container.is-coordinator=\u3053\u306E\u30CE\u30FC\u30C9\u304C\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u30B3\u30FC\u30C7\u30A3\u30CD\u30FC\u30BF\u30FC\u3067\u3042\u308B\u5834\u5408\u306F\u3001true \u306B\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u8D77\u52D5\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache-container.coordinator-address=\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u30B3\u30FC\u30C7\u30A3\u30CD\u30FC\u30BF\u30FC\u306E\u8AD6\u7406\u30A2\u30C9\u30EC\u30B9\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u8D77\u52D5\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache-container.local-address=\u30CE\u30FC\u30C9\u306E\u8AD6\u7406\u30A2\u30C9\u30EC\u30B9\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u8D77\u52D5\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache-container.cluster-name=\u3053\u306E\u30CE\u30FC\u30C9\u304C\u5C5E\u3059\u308B\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u540D\u524D\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u8D77\u52D5\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache-container.transport=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u306E\u5B50\u3002
infinispan.cache-container.local-cache=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u30ED\u30FC\u30AB\u30EB\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u5B50\u3002
infinispan.cache-container.invalidation-cache=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u7121\u52B9\u5316\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u5B50\u3002
infinispan.cache-container.replicated-cache=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u30EC\u30D7\u30EA\u30B1\u30FC\u30C8\u3055\u308C\u305F\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u5B50\u3002
infinispan.cache-container.distributed-cache=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u5206\u6563\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u5B50\u3002
infinispan.thread-pool.async-operations=\u975E\u540C\u671F\u64CD\u4F5C\u306B\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
infinispan.thread-pool.listener=\u975E\u540C\u671F\u30AD\u30E3\u30C3\u30B7\u30E5\u30EA\u30B9\u30CA\u30FC\u901A\u77E5\u306B\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
infinispan.thread-pool.persistence=\u6C38\u7D9A\u30B9\u30C8\u30A2\u3068\u5BFE\u8A71\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
infinispan.thread-pool.remote-command=\u30EA\u30E2\u30FC\u30C8\u30B3\u30DE\u30F3\u30C9\u3092\u5B9F\u884C\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
infinispan.thread-pool.state-transfer=\u72B6\u614B\u306E\u9077\u79FB\u306B\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
infinispan.thread-pool.transport=\u975E\u540C\u671F\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u901A\u4FE1\u306B\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
infinispan.thread-pool.expiration=\u30A8\u30D3\u30AF\u30B7\u30E7\u30F3\u306B\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
infinispan.thread-pool.add=\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.thread-pool.remove=\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u30A8\u30AF\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u3092\u524A\u9664\u3057\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author Yamamoto Mie
infinispan.thread-pool.min-threads=\u6700\u5927\u30D7\u30FC\u30EB\u30B5\u30A4\u30BA\u3088\u308A\u3082\u5C0F\u3055\u3044\u30B3\u30A2\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u30B5\u30A4\u30BA\u3002\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u30B3\u30A2\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u30B5\u30A4\u30BA\u306F\u6700\u5927\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u30B5\u30A4\u30BA\u3068\u540C\u3058\u3067\u3059\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author Yamamoto Mie
infinispan.thread-pool.max-threads=\u6700\u5927\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u30B5\u30A4\u30BA
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-threads/org/jboss/as/threads/LocalDescriptions, author Yamamoto Mie
infinispan.thread-pool.queue-length=\u30AD\u30E5\u30FC\u9577
infinispan.thread-pool.keepalive-time=\u30A2\u30A4\u30C9\u30EB\u6642\u306B\u30D7\u30FC\u30EB\u30B9\u30EC\u30C3\u30C9\u306E\u5B9F\u884C\u3092\u7D99\u7D9A\u3059\u3079\u304D\u6642\u9593 (\u30DF\u30EA\u79D2) \u3092\u6307\u5B9A\u3059\u308B\u969B\u306B\u5229\u7528\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001\u30B9\u30EC\u30C3\u30C9\u306F\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u304C\u7D42\u4E86\u3059\u308B\u307E\u3067\u5B9F\u884C\u3055\u308C\u307E\u3059\u3002
infinispan.transport.jgroups=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u306E\u8AAC\u660E
infinispan.transport.jgroups.add=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u3078\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u3092\u8FFD\u52A0
infinispan.transport.jgroups.remove=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u3088\u308A\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u3092\u524A\u9664
infinispan.transport.jgroups.channel=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u306E\u30C1\u30E3\u30CD\u30EB\u3002
infinispan.transport.jgroups.cluster=\u30B0\u30EB\u30FC\u30D7\u901A\u4FE1\u30AF\u30E9\u30B9\u30BF\u30FC\u540D
infinispan.transport.jgroups.cluster.deprecated=\u975E\u63A8\u5968\u3002\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30AF\u30E9\u30B9\u30BF\u30FC\u306F\u3001JGroups \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3088\u308A\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002
infinispan.transport.jgroups.executor=\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u306B\u4F7F\u7528\u3059\u308B\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC
infinispan.transport.jgroups.executor.deprecated=\u975E\u63A8\u5968\u3002\u4ECA\u5F8C\u306E\u30EA\u30EA\u30FC\u30B9\u3067\u306F\u3001\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306B\u57CB\u3081\u8FBC\u307E\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u8A2D\u5B9A\u306B\u7F6E\u304D\u63DB\u3048\u3089\u308C\u307E\u3059\u3002
infinispan.transport.jgroups.lock-timeout=\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u306E\u30ED\u30C3\u30AF\u306B\u5BFE\u3059\u308B\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
infinispan.transport.jgroups.machine=\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u306E\u30DE\u30B7\u30F3\u8B58\u5225\u5B50
infinispan.transport.jgroups.rack=\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u306E\u30E9\u30C3\u30AF\u8B58\u5225\u5B50
infinispan.transport.jgroups.site=\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u306E\u30B5\u30A4\u30C8\u8B58\u5225\u5B50
infinispan.transport.jgroups.stack=\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u306B\u4F7F\u7528\u3059\u308B jgroups \u30B9\u30BF\u30C3\u30AF
infinispan.transport.jgroups.stack.deprecated=\u975E\u63A8\u5968\u3002\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30D7\u30ED\u30C8\u30B3\u30EB\u30B9\u30BF\u30C3\u30AF\u306F\u3001JGroups \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3088\u308A\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002
infinispan.transport.none=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30ED\u30FC\u30AB\u30EB\u306E\u307F\u306E\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8
infinispan.transport.none.add=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u3092\u30ED\u30FC\u30AB\u30EB\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u3078\u8FFD\u52A0
infinispan.transport.none.remove=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u304B\u3089\u30ED\u30FC\u30AB\u30EB\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u3092\u524A\u9664
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.cache.start=\u30AD\u30E3\u30C3\u30B7\u30E5\u8D77\u52D5\u30E2\u30FC\u30C9\u3067\u3001EAGER (\u5373\u6642\u8D77\u52D5) \u3042\u308B\u3044\u306F LAZY (on-demand \u8D77\u52D5) \u306E\u3044\u305A\u308C\u304B\u306B\u306A\u308A\u307E\u3059\u3002
infinispan.cache.start.deprecated=\u975E\u63A8\u5968\u3002LAZY \u30E2\u30FC\u30C9\u306E\u307F\u304C\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u307E\u3059\u3002
infinispan.cache.statistics-enabled=\u6709\u52B9\u306A\u5834\u5408\u306F\u3001\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u95A2\u3059\u308B\u7D71\u8A08\u60C5\u5831\u304C\u53CE\u96C6\u3055\u308C\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.cache.batching=\u6709\u52B9\u306B\u3059\u308B\u3068\u3001\u547C\u3073\u51FA\u3057\u30D0\u30C3\u30C1\u306EAPI \u304C\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u3067\u5229\u7528\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002
infinispan.cache.batching.deprecated=\u975E\u63A8\u5968\u3002BATCH \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30E2\u30FC\u30C9\u306B\u7F6E\u304D\u63DB\u3048\u3089\u308C\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.cache.indexing=\u6709\u52B9\u306B\u3059\u308B\u3068\u3001\u30AD\u30E3\u30C3\u30B7\u30E5\u3078\u306E\u8FFD\u52A0\u6642\u306B\u30A8\u30F3\u30C8\u30EA\u306F\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u5316\u3055\u308C\u307E\u3059\u3002\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u306F\u3001\u30A8\u30F3\u30C8\u30EA\u306E\u5909\u66F4\u3042\u308B\u3044\u306F\u524A\u9664\u3068\u540C\u6642\u306B\u66F4\u65B0\u3055\u308C\u307E\u3059\u3002
infinispan.cache.indexing.deprecated=\u975E\u63A8\u5968\u3002\u5F71\u97FF\u306A\u3057\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.cache.jndi-name=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u306E jndi-name 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.cache.module=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u8A2D\u5B9A\u3092\u69CB\u7BC9\u3059\u308B\u3068\u304D\u306B\u4F7F\u7528\u3059\u3079\u304D\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC\u306E\u30E2\u30B8\u30E5\u30FC\u30EB\u3002
infinispan.cache.indexing-properties=\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u4F5C\u6210\u306E\u6319\u52D5\u3092\u5236\u5FA1\u3059\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC
infinispan.cache.indexing-properties.deprecated=\u975E\u63A8\u5968\u3002\u5F71\u97FF\u306A\u3057\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.cache.remove=\u3053\u306E\u30B3\u30F3\u30C6\u30CA\u30FC\u304B\u3089\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.cache.cache-status=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u30B9\u30C6\u30FC\u30BF\u30B9\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.average-read-time=\u30AD\u30E3\u30C3\u30B7\u30E5\u8AAD\u307F\u53D6\u308A\u306E\u5E73\u5747\u6642\u9593 (\u30DF\u30EA\u79D2\u5358\u4F4D)\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.average-write-time=\u30AD\u30E3\u30C3\u30B7\u30E5\u66F8\u304D\u8FBC\u307F\u306E\u5E73\u5747\u6642\u9593 (\u30DF\u30EA\u79D2\u5358\u4F4D)\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.elapsed-time=\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u304B\u3089\u7D4C\u904E\u3057\u305F\u6642\u9593 (\u79D2\u5358\u4F4D)\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.hit-ratio=\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30D2\u30C3\u30C8/\u30DF\u30B9\u7387 (\u30D2\u30C3\u30C8\u6570/\u30D2\u30C3\u30C8\u6570 + \u30DF\u30B9\u6570)\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.hits=\u30AD\u30E3\u30C3\u30B7\u30E5\u5C5E\u6027\u30D2\u30C3\u30C8\u306E\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.misses=\u30AD\u30E3\u30C3\u30B7\u30E5\u5C5E\u6027\u30DF\u30B9\u306E\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.number-of-entries=\u30AD\u30E3\u30C3\u30B7\u30E5\u5185\u306E\u73FE\u5728\u306E\u30A8\u30F3\u30C8\u30EA\u30FC\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.read-write-ratio=\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u8AAD\u307F\u53D6\u308A/\u66F8\u304D\u8FBC\u307F\u7387 ((\u30D2\u30C3\u30C8\u6570 + \u30DF\u30B9\u6570)/\u30B9\u30C8\u30A2\u6570)\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.remove-hits=\u30AD\u30E3\u30C3\u30B7\u30E5\u5C5E\u6027\u524A\u9664\u30D2\u30C3\u30C8\u306E\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.remove-misses=\u30AD\u30E3\u30C3\u30B7\u30E5\u5C5E\u6027\u524A\u9664\u30DF\u30B9\u306E\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.stores=\u30AD\u30E3\u30C3\u30B7\u30E5\u5C5E\u6027 put \u64CD\u4F5C\u306E\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.time-since-reset=\u30AD\u30E3\u30C3\u30B7\u30E5\u7D71\u8A08\u60C5\u5831\u304C\u30EA\u30BB\u30C3\u30C8\u3055\u308C\u3066\u304B\u3089\u7D4C\u904E\u3057\u305F\u6642\u9593 (\u79D2\u5358\u4F4D)\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.invalidations=\u30AD\u30E3\u30C3\u30B7\u30E5\u7121\u52B9\u5316\u306E\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.passivations=\u30AD\u30E3\u30C3\u30B7\u30E5\u30CE\u30FC\u30C9\u30D1\u30C3\u30B7\u30D6\u5316\u306E\u6570 (\u30CE\u30FC\u30C9\u3092\u30E1\u30E2\u30EA\u30FC\u304B\u3089\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u306B\u30D1\u30C3\u30B7\u30D6\u5316\u3057\u307E\u3059)\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.activations=\u30AD\u30E3\u30C3\u30B7\u30E5\u30CE\u30FC\u30C9\u30A2\u30AF\u30C6\u30A3\u30D6\u5316\u306E\u6570 (\u30CE\u30FC\u30C9\u3092\u30E1\u30E2\u30EA\u30FC\u304B\u3089\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u306B\u79FB\u52D5\u3057\u307E\u3059)\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.cache.async-marshalling=\u6709\u52B9\u306B\u3059\u308B\u3068\u3001\u30A8\u30F3\u30C8\u30EA\u306E\u30DE\u30FC\u30B7\u30E3\u30EB\u5316\u304C\u975E\u540C\u671F\u7684\u306B\u5B9F\u884C\u3055\u308C\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002
infinispan.cache.async-marshalling.deprecated=\u975E\u63A8\u5968\u3002\u975E\u540C\u671F\u30DE\u30FC\u30B7\u30E3\u30EA\u30F3\u30B0\u306F\u30B5\u30DD\u30FC\u30C8\u5BFE\u8C61\u5916\u306B\u306A\u308A\u307E\u3057\u305F\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.cache.mode=\u975E\u540C\u671F\u64CD\u4F5C\u306E ASYNC \u304B\u3001\u540C\u671F\u64CD\u4F5C\u306E SYNC \u306E\u3044\u305A\u308C\u304B\u306B\u30AF\u30E9\u30B9\u30BF\u30FC\u30AD\u30E3\u30C3\u30B7\u30E5\u30E2\u30FC\u30C9\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.cache.queue-size=ASYNC \u30E2\u30FC\u30C9\u3067\u306F\u3001\u3053\u306E\u5C5E\u6027\u3092\u4F7F\u7528\u3057\u3066\u7279\u5B9A\u306E\u3057\u304D\u3044\u5024\u306B\u9054\u3057\u305F\u3068\u304D\u306B\u30AD\u30E5\u30FC\u306E\u30D5\u30E9\u30C3\u30B7\u30E5\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
infinispan.cache.queue-size.deprecated=\u975E\u63A8\u5968\u3002\u3053\u306E\u5C5E\u6027\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.cache.queue-flush-interval=ASYNC \u30E2\u30FC\u30C9\u3067\u306F\u3001\u30EC\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30AD\u30E5\u30FC\u64CD\u4F5C\u3092\u30D5\u30E9\u30C3\u30B7\u30E5\u3059\u308B\u305F\u3081\u306B\u3001\u975E\u540C\u671F\u30B9\u30EC\u30C3\u30C9\u3092\u4F7F\u7528\u3059\u308B\u983B\u5EA6\u3092\u3053\u306E\u5C5E\u6027\u304C\u5236\u5FA1\u3057\u307E\u3059\u3002\u3053\u308C\u306F\u6B63\u306E\u6574\u6570\u3067\u3001\u30B9\u30EC\u30C3\u30C9\u306E\u8D77\u52D5\u6642\u9593\u3092\u30DF\u30EA\u79D2\u3067\u8868\u3057\u307E\u3059\u3002
infinispan.cache.queue-flush-interval.deprecated=\u975E\u63A8\u5968\u3002\u3053\u306E\u5C5E\u6027\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.cache.remote-timeout=SYNC \u30E2\u30FC\u30C9\u3067\u306F\u3001\u30EA\u30E2\u30FC\u30C8\u547C\u3073\u51FA\u3057\u3092\u884C\u3046\u3068\u304D\u306B\u3053\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u30DF\u30EA\u79D2\u5358\u4F4D) \u3092\u4F7F\u7528\u3057\u3066\u53D7\u4FE1\u78BA\u8A8D\u3092\u5F85\u3061\u307E\u3059\u3002\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u5F8C\u3001\u547C\u3073\u51FA\u3057\u306F\u4E2D\u65AD\u3055\u308C\u3001\u4F8B\u5916\u304C\u767A\u751F\u3057\u307E\u3059\u3002
infinispan.cache.average-replication-time=\u30AF\u30E9\u30B9\u30BF\u30FC\u3067\u30C7\u30FC\u30BF\u3092\u30EC\u30D7\u30EA\u30B1\u30FC\u30C8\u3059\u308B\u306E\u306B\u304B\u304B\u308B\u5E73\u5747\u6642\u9593\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.replication-count=\u30C7\u30FC\u30BF\u304C\u30AF\u30E9\u30B9\u30BF\u30FC\u3067\u30EC\u30D7\u30EA\u30B1\u30FC\u30C8\u3055\u308C\u305F\u56DE\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.replication-failures=\u30C7\u30FC\u30BF\u30EC\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u5931\u6557\u306E\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.success-ratio=\u30C7\u30FC\u30BF\u30EC\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u6210\u529F\u7387 (\u6210\u529F\u6570/\u6210\u529F\u6570 + \u5931\u6557\u6570)\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.cache.eviction=\u30A8\u30D3\u30AF\u30B7\u30E7\u30F3\u8A2D\u5B9A\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u30A8\u30A4\u30EA\u30A2\u30B9
infinispan.cache.expiration=\u30A8\u30AF\u30B9\u30D1\u30EC\u30FC\u30B7\u30E7\u30F3\u8A2D\u5B9A\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u30A8\u30A4\u30EA\u30A2\u30B9
infinispan.cache.locking=\u30ED\u30C3\u30AD\u30F3\u30B0\u8A2D\u5B9A\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u30A8\u30A4\u30EA\u30A2\u30B9
infinispan.cache.state-transfer=\u72B6\u614B\u9077\u79FB\u8A2D\u5B9A\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u30A8\u30A4\u30EA\u30A2\u30B9
infinispan.cache.transaction=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u8A2D\u5B9A\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u30A8\u30A4\u30EA\u30A2\u30B9
infinispan.cache.file-store=\u30D5\u30A1\u30A4\u30EB\u30B9\u30C8\u30A2\u8A2D\u5B9A\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u30A8\u30A4\u30EA\u30A2\u30B9
infinispan.cache.remote-store=\u30D5\u30A1\u30A4\u30EB\u30B9\u30C8\u30A2\u8A2D\u5B9A\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u30A8\u30A4\u30EA\u30A2\u30B9
infinispan.cache.binary-keyed-jdbc-store=\u30D0\u30A4\u30CA\u30EA\u30FC jdbc \u30B9\u30C8\u30A2\u8A2D\u5B9A\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u30A8\u30A4\u30EA\u30A2\u30B9
infinispan.cache.mixed-keyed-jdbc-store=\u6DF7\u5408 jdbc \u30B9\u30C8\u30A2\u8A2D\u5B9A\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u30A8\u30A4\u30EA\u30A2\u30B9
infinispan.cache.string-keyed-jdbc-store=\u6587\u5B57\u5217 jdbc \u30B9\u30C8\u30A2\u8A2D\u5B9A\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u30A8\u30A4\u30EA\u30A2\u30B9
infinispan.cache.write-behind=\u30E9\u30A4\u30C8\u30D3\u30CF\u30A4\u30F3\u30C9\u8A2D\u5B9A\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u30A8\u30A4\u30EA\u30A2\u30B9
infinispan.cache.backup-for=backup-for \u8A2D\u5B9A\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u30A8\u30A4\u30EA\u30A2\u30B9
infinispan.cache.backup=\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u8A2D\u5B9A\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u306E\u5B50\u306E\u30A8\u30A4\u30EA\u30A2\u30B9
infinispan.local-cache=\u30ED\u30FC\u30AB\u30EB\u30AD\u30E3\u30C3\u30B7\u30E5\u8A2D\u5B9A
infinispan.local-cache.add=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306B\u30ED\u30FC\u30AB\u30EB\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u8FFD\u52A0
infinispan.local-cache.remove=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u3088\u308A\u30ED\u30FC\u30AB\u30EB\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u524A\u9664
infinispan.invalidation-cache=\u7121\u52B9\u5316\u30AD\u30E3\u30C3\u30B7\u30E5
infinispan.invalidation-cache.add=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306B\u7121\u52B9\u5316\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u8FFD\u52A0
infinispan.invalidation-cache.remove=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u304B\u3089\u7121\u52B9\u5316\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u524A\u9664
infinispan.replicated-cache=\u30EC\u30D7\u30EA\u30B1\u30FC\u30C8\u3055\u308C\u305F\u30AD\u30E3\u30C3\u30B7\u30E5\u8A2D\u5B9A
infinispan.replicated-cache.add=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306B\u30EC\u30D7\u30EA\u30B1\u30FC\u30C8\u3055\u308C\u305F\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u8FFD\u52A0
infinispan.replicated-cache.remove=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u304B\u3089\u30EC\u30D7\u30EA\u30B1\u30FC\u30C8\u3055\u308C\u305F\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u524A\u9664
infinispan.component.partition-handling=\u5206\u6563\u30AD\u30E3\u30C3\u30B7\u30E5\u304A\u3088\u3073\u30EC\u30D7\u30EA\u30B1\u30FC\u30C8\u3055\u308C\u305F\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u51E6\u7406\u8A2D\u5B9A\u3002
infinispan.component.partition-handling.add=\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u51E6\u7406\u8A2D\u5B9A\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.component.partition-handling.remove=\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u51E6\u7406\u8A2D\u5B9A\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.component.partition-handling.enabled=\u6709\u52B9\u3067\u3042\u308B\u3068\u3001\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u4E0D\u6574\u5408\u3092\u767A\u751F\u3059\u308B\u304A\u305D\u308C\u304C\u3042\u308B\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30D1\u30FC\u30C6\u30A3\u30B7\u30E7\u30F3\u3092\u691C\u51FA\u3057\u305F\u5F8C\u3001\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u30C7\u30B0\u30EC\u30FC\u30C9\u30E2\u30FC\u30C9\u306B\u306A\u308A\u307E\u3059\u3002
infinispan.component.partition-handling.availability=\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u73FE\u5728\u306E\u53EF\u7528\u6027\u3092\u793A\u3057\u307E\u3059\u3002
infinispan.component.partition-handling.force-available=\u53EF\u7528\u6027\u304C\u4F4E\u4E0B\u3057\u305F\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u4F7F\u7528\u53EF\u80FD\u306B\u306A\u308B\u3088\u3046\u5F37\u5236\u3057\u307E\u3059\u3002
infinispan.component.state-transfer=\u5206\u6563\u30AD\u30E3\u30C3\u30B7\u30E5\u304A\u3088\u3073\u30EC\u30D7\u30EA\u30B1\u30FC\u30C8\u3055\u308C\u305F\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u72B6\u614B\u9077\u79FB\u8A2D\u5B9A\u3002
infinispan.component.state-transfer.add=\u72B6\u614B\u9077\u79FB\u306E\u8A2D\u5B9A\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.component.state-transfer.remove=\u72B6\u614B\u9077\u79FB\u306E\u8A2D\u5B9A\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.component.state-transfer.enabled=\u6709\u52B9\u306A\u5834\u5408\u3001\u8D77\u52D5\u6642\u306B\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u5468\u8FBA\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u72B6\u614B\u3092\u78BA\u8A8D\u3059\u308B\u3088\u3046\u306B\u306A\u308B\u305F\u3081\u3001\u30AD\u30E3\u30C3\u30B7\u30E5\u306F\u300C\u30A6\u30A9\u30FC\u30E0\u300D\u30B9\u30BF\u30FC\u30C8\u3057\u307E\u3059\u304C\u3001\u8D77\u52D5\u6642\u9593\u306B\u5F71\u97FF\u304C\u51FA\u307E\u3059\u3002
infinispan.component.state-transfer.enabled.deprecated=\u975E\u63A8\u5968\u3002\u30EC\u30D7\u30EA\u30B1\u30FC\u30C8\u3055\u308C\u305F\u30AD\u30E3\u30C3\u30B7\u30E5\u304A\u3088\u3073\u5206\u6563\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u5BFE\u3057\u3066\u5E38\u306B\u6709\u52B9\u5316\u3055\u308C\u307E\u3059\u3002
infinispan.component.state-transfer.timeout=\u5468\u8FBA\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u304B\u3089\u306E\u72B6\u614B\u3092\u5F85\u3064\u6700\u5927\u6642\u9593 (\u30DF\u30EA\u79D2\u5358\u4F4D) \u3067\u3059\u3002 \u3053\u306E\u6642\u9593\u3092\u8D85\u904E\u3059\u308B\u3068\u4F8B\u5916\u304C\u767A\u751F\u3057\u3001\u8D77\u52D5\u304C\u4E2D\u65AD\u3055\u308C\u307E\u3059\u3002
infinispan.component.state-transfer.chunk-size=\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u306E\u8EE2\u9001\u3092\u4E00\u62EC\u51E6\u7406\u3059\u308B\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8\u5358\u4F4D)\u3002
infinispan.distributed-cache=\u5206\u6563\u30AD\u30E3\u30C3\u30B7\u30E5\u8A2D\u5B9A\u3002
infinispan.distributed-cache.add=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306B\u5206\u6563\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u8FFD\u52A0
infinispan.distributed-cache.remove=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u304B\u3089\u5206\u6563\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u524A\u9664
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.distributed-cache.owners=\u5404\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u306E\u30AF\u30E9\u30B9\u30BF\u30FC\u5168\u4F53\u306E\u30EC\u30D7\u30EA\u30AB\u6570\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.distributed-cache.virtual-nodes=\u975E\u63A8\u5968\u3002\u5F71\u97FF\u306A\u3057\u3002
infinispan.distributed-cache.virtual-nodes.deprecated=\u975E\u63A8\u5968\u3002\u5F71\u97FF\u306A\u3057\u3002
infinispan.distributed-cache.segments=\u30AF\u30E9\u30B9\u30BF\u30FC\u306B\u304A\u3051\u308B\u30AD\u30FC\u5206\u6563\u306E\u7C92\u5EA6\u3068\u306A\u308B\u30CF\u30C3\u30B7\u30E5\u9818\u57DF\u30BB\u30B0\u30E1\u30F3\u30C8\u306E\u6570\u3092\u5236\u5FA1\u3057\u307E\u3059\u3002\u5024\u306F\u771F\u306B\u6B63\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author Yamamoto Mie
infinispan.distributed-cache.l1-lifespan=L1 \u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u7F6E\u304B\u308C\u3066\u3044\u308B\u30A8\u30F3\u30C8\u30EA\u306E\u6700\u5927\u5BFF\u547D\u3002\u3053\u306E\u8981\u7D20\u306F\u3001\u300C\u5206\u6563\u300D\u30AD\u30E3\u30C3\u30B7\u30E5\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5185\u306B\u3042\u308B L1 \u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u52D5\u4F5C\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u5225\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30E2\u30FC\u30C9\u306E\u5834\u5408\u306F\u3001\u3053\u306E\u8981\u7D20\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
infinispan.distributed-cache.capacity-factor=\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u4ED6\u306E\u30CE\u30FC\u30C9\u3068\u6BD4\u8F03\u3057\u3066\u3001\u30ED\u30FC\u30AB\u30EB\u30CE\u30FC\u30C9\u306B\u7F6E\u304B\u308C\u308B\u30A8\u30F3\u30C8\u30EA\u30FC\u306E\u5272\u5408\u3092\u5236\u5FA1\u3057\u307E\u3059\u3002
infinispan.distributed-cache.consistent-hash-strategy=\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u4E00\u8CAB\u3057\u305F\u30CF\u30C3\u30B7\u30E5\u30B9\u30C8\u30E9\u30C6\u30B8\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
infinispan.cache.store=\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u6C38\u7D9A\u30B9\u30C8\u30A2\u3002
infinispan.cache.component=\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u8A2D\u5B9A\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u3002
infinispan.component.locking=\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30ED\u30C3\u30AD\u30F3\u30B0\u8A2D\u5B9A\u3002
infinispan.component.locking.add=\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u30ED\u30C3\u30AD\u30F3\u30B0\u8A2D\u5B9A\u8981\u7D20\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.component.locking.remove=\u30AD\u30E3\u30C3\u30B7\u30E5\u304B\u3089\u30ED\u30C3\u30AD\u30F3\u30B0\u8A2D\u5B9A\u8981\u7D20\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.component.locking.isolation=\u30AD\u30E3\u30C3\u30B7\u30E5\u30ED\u30C3\u30AD\u30F3\u30B0\u306E\u5206\u96E2\u30EC\u30D9\u30EB\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
infinispan.component.locking.striping=True \u306E\u5834\u5408\u3001\u5171\u6709\u30ED\u30C3\u30AF\u306E\u30D7\u30FC\u30EB\u306F\u3001\u30ED\u30C3\u30AF\u306E\u5FC5\u8981\u304C\u3042\u308B\u5168\u30A8\u30F3\u30C8\u30EA\u30FC\u5411\u3051\u306B\u7DAD\u6301\u3055\u308C\u307E\u3059\u3002True \u3067\u306A\u3044\u5834\u5408\u3001\u30ED\u30C3\u30AF\u306F\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30A8\u30F3\u30C8\u30EA\u30FC\u3054\u3068\u306B\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002\u30ED\u30C3\u30AF\u30B9\u30C8\u30E9\u30A4\u30D4\u30F3\u30B0\u306B\u3088\u308A\u30E1\u30E2\u30EA\u30FC\u30D5\u30C3\u30C8\u30D7\u30EA\u30F3\u30C8\u3092\u5236\u5FA1\u3057\u3084\u3059\u304F\u306A\u308A\u307E\u3059\u304C\u3001\u30B7\u30B9\u30C6\u30E0\u306E\u540C\u6642\u5B9F\u884C\u6027\u304C\u4F4E\u4E0B\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.component.locking.acquire-timeout=\u7279\u5B9A\u306E\u30ED\u30C3\u30AF\u53D6\u5F97\u3092\u8A66\u884C\u3059\u308B\u6700\u5927\u6642\u9593\u3002
infinispan.component.locking.concurrency-level=\u30ED\u30C3\u30AF\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u540C\u6642\u5B9F\u884C\u30EC\u30D9\u30EB\u3002Infinispan \u3068\u5BFE\u8A71\u3059\u308B\u5E73\u884C\u30B9\u30EC\u30C3\u30C9\u306E\u6570\u306B\u5F93\u3063\u3066\u5024\u3092\u8ABF\u7BC0\u3057\u307E\u3059\u3002
infinispan.component.locking.current-concurrency-level=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u30B5\u30DD\u30FC\u30C8\u3067\u304D\u308B\u540C\u6642\u66F4\u65B0\u30B9\u30EC\u30C3\u30C9\u306E\u63A8\u5B9A\u3055\u308C\u308B\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.component.locking.number-of-locks-available=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u3067\u5229\u7528\u53EF\u80FD\u306A\u30ED\u30C3\u30AF\u306E\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.component.locking.number-of-locks-held=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u3067\u73FE\u5728\u4F7F\u7528\u3055\u308C\u3066\u3044\u308B\u30ED\u30C3\u30AF\u306E\u306E\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.component.transaction=\u30AD\u30E3\u30C3\u30B7\u30E5\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u8A2D\u5B9A
infinispan.component.transaction.add=\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u8A2D\u5B9A\u8981\u7D20\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.component.transaction.remove=\u30AD\u30E3\u30C3\u30B7\u30E5\u304B\u3089\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u8A2D\u5B9A\u8981\u7D20\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.component.transaction.mode=\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30E2\u30FC\u30C9\u3092 NONE\u3001NON_XA\u3001NON_DURABLE_XA\u3001FULL_XA \u306E\u3044\u305A\u308C\u304B\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
infinispan.component.transaction.stop-timeout=\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u505C\u6B62\u6642\u306B\u7D99\u7D9A\u4E2D\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u3042\u308B\u5834\u5408\u3001Infinispan \u306F\u7D99\u7D9A\u4E2D\u306E\u30EA\u30E2\u30FC\u30C8\u304A\u3088\u3073\u30ED\u30FC\u30AB\u30EB\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u7D42\u4E86\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3057\u307E\u3059\u3002\u5F85\u6A5F\u6642\u9593\u306F\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u505C\u6B62\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306B\u3088\u3063\u3066\u5B9A\u7FA9\u3055\u308C\u307E\u3059\u3002
infinispan.component.transaction.locking=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30ED\u30C3\u30AD\u30F3\u30B0\u30E2\u30FC\u30C9\u3002OPTIMISTIC \u307E\u305F\u306F PESSIMISTIC \u306B\u306A\u308A\u307E\u3059\u3002
infinispan.component.transaction.commits=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30B3\u30DF\u30C3\u30C8\u306E\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.component.transaction.prepares=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6E96\u5099\u306E\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.component.transaction.rollbacks=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u306E\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.component.eviction=\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30D3\u30AF\u30B7\u30E7\u30F3\u8A2D\u5B9A\u3002
infinispan.component.eviction.add=\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u30A8\u30D3\u30AF\u30B7\u30E7\u30F3\u8A2D\u5B9A\u8981\u7D20\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.component.eviction.remove=\u30AD\u30E3\u30C3\u30B7\u30E5\u304B\u3089\u30A8\u30D3\u30AF\u30B7\u30E7\u30F3\u8A2D\u5B9A\u8981\u7D20\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.component.eviction.strategy=\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30D3\u30AF\u30B7\u30E7\u30F3\u30B9\u30C8\u30E9\u30C6\u30B8\u30FC\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u4F7F\u7528\u53EF\u80FD\u306A\u30AA\u30D7\u30B7\u30E7\u30F3\u306F\u3001'UNORDERED'\u3001'FIFO'\u3001'LRU'\u3001'LIRS'\u3001'NONE' (\u30A8\u30D3\u30AF\u30B7\u30E7\u30F3\u306E\u7121\u52B9\u5316) \u3067\u3059\u3002
infinispan.component.eviction.max-entries=\u30AD\u30E3\u30C3\u30B7\u30E5\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u304A\u3051\u308B\u30A8\u30F3\u30C8\u30EA\u30FC\u306E\u6700\u5927\u6570\u3067\u3059\u3002\u9078\u629E\u3057\u305F\u5024\u304C 2 \u306E\u7D2F\u4E57\u3067\u306A\u3044\u5834\u5408\u3001\u5B9F\u969B\u306E\u5024\u306F\u9078\u629E\u3055\u308C\u305F\u5024\u3088\u308A\u3082\u5927\u304D\u304F\u306A\u308B\u3001\u6700\u3082\u5C0F\u3055\u3044 2 \u306E\u7D2F\u4E57\u3092\u30C7\u30D5\u30A9\u30EB\u30C8\u3068\u3057\u307E\u3059\u3002-1 \u306F\u7121\u5236\u9650\u3092\u610F\u5473\u3057\u307E\u3059
infinispan.component.eviction.evictions=\u30AD\u30E3\u30C3\u30B7\u30E5\u524A\u9664\u64CD\u4F5C\u306E\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.component.expiration=\u30AD\u30E3\u30C3\u30B7\u30E5\u6709\u52B9\u671F\u9650\u306E\u8A2D\u5B9A
infinispan.component.expiration.add=\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u6709\u52B9\u671F\u9650\u8A2D\u5B9A\u8981\u7D20\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.component.expiration.remove=\u30AD\u30E3\u30C3\u30B7\u30E5\u304B\u3089\u6709\u52B9\u671F\u9650\u8A2D\u5B9A\u8981\u7D20\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.component.expiration.max-idle=\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u304C\u30AD\u30E3\u30C3\u30B7\u30E5\u3067\u4FDD\u6301\u3055\u308C\u308B\u6700\u5927\u30A2\u30A4\u30C9\u30EB\u6642\u9593 (\u30DF\u30EA\u79D2)\u3002\u3053\u306E\u30A2\u30A4\u30C9\u30EB\u6642\u9593\u3092\u8D85\u904E\u3057\u305F\u5834\u5408\u3001\u30AF\u30E9\u30B9\u30BF\u30FC\u5168\u4F53\u3067\u30A8\u30F3\u30C8\u30EA\u30FC\u304C\u671F\u9650\u5207\u308C\u306B\u306A\u308A\u307E\u3059\u3002-1 \u306F\u30A8\u30F3\u30C8\u30EA\u30FC\u304C\u671F\u9650\u5207\u308C\u306B\u306A\u3089\u306A\u3044\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002
infinispan.component.expiration.lifespan=\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u306E\u6700\u5927\u5BFF\u547D (\u30DF\u30EA\u79D2)\u3002\u3053\u306E\u5024\u3092\u8D85\u904E\u3059\u308B\u3068\u3001\u30AF\u30E9\u30B9\u30BF\u30FC\u5168\u4F53\u3067\u30A8\u30F3\u30C8\u30EA\u30FC\u304C\u671F\u9650\u5207\u308C\u306B\u306A\u308A\u307E\u3059\u3002-1 \u306F\u30A8\u30F3\u30C8\u30EA\u30FC\u304C\u671F\u9650\u5207\u308C\u306B\u306A\u3089\u306A\u3044\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002
infinispan.component.expiration.interval=\u30E1\u30E2\u30EA\u30FC\u304A\u3088\u3073\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u304B\u3089\u6709\u52B9\u671F\u9650\u306E\u5207\u308C\u305F\u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u524A\u9664\u3059\u308B\u51E6\u7406\u3092\u5B9F\u884C\u3059\u308B\u9593\u9694 (\u30DF\u30EA\u79D2\u5358\u4F4D) \u3067\u3059\u3002\u5B9A\u671F\u7684\u306A\u30A8\u30D3\u30AF\u30B7\u30E7\u30F3\u51E6\u7406\u3092\u7121\u52B9\u306B\u3057\u305F\u3044\u5834\u5408\u306F\u3001wakeupInterval \u3092 -1 \u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
infinispan.store.custom=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u8A2D\u5B9A\u3002
infinispan.store.custom.add=\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u57FA\u672C\u7684\u306A\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u8A2D\u5B9A\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.store.custom.remove=\u30AD\u30E3\u30C3\u30B7\u30E5\u304B\u3089\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u8A2D\u5B9A\u8981\u7D20\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.store.shared=\u8907\u6570\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u540C\u3058\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u3092\u5171\u6709\u3059\u308B\u5834\u5408\u3001true \u306B\u8A2D\u5B9A\u3057\u307E\u3059 (JDBC \u30D9\u30FC\u30B9\u306E CacheStore \u3092\u4F7F\u7528\u3059\u308B\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u8907\u6570\u306E\u30CE\u30FC\u30C9\u304C\u540C\u3058\u5171\u6709\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3092\u793A\u3059\u5834\u5408\u306A\u3069)\u3002true \u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u8907\u6570\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u540C\u3058\u5909\u66F4\u3092\u8907\u6570\u56DE\u66F8\u304D\u8FBC\u307E\u306A\u3044\u3088\u3046\u306B\u3057\u307E\u3059\u3002\u6709\u52B9\u3067\u3042\u308B\u5834\u5408\u3001\u5909\u66F4\u5143\u306E\u30CE\u30FC\u30C9\u306E\u307F\u304C\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u3078\u66F8\u304D\u8FBC\u307F\u307E\u3059\u3002\u7121\u52B9\u3067\u3042\u308B\u5834\u5408\u3001\u30C7\u30FC\u30BF\u3092\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u3078\u683C\u7D0D\u3059\u308B\u3053\u3068\u3067\u3001\u5404\u30AD\u30E3\u30C3\u30B7\u30E5\u306F\u6F5C\u5728\u7684\u306A\u30EA\u30E2\u30FC\u30C8\u66F4\u65B0\u306B\u53CD\u5FDC\u3057\u307E\u3059\u3002
infinispan.store.preload=true \u306E\u5834\u5408\u3001\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u8D77\u52D5\u3059\u308B\u3068\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u306B\u683C\u7D0D\u3055\u308C\u3066\u3044\u308B\u30C7\u30FC\u30BF\u304C\u30E1\u30E2\u30EA\u30FC\u3078\u4E8B\u524D\u30ED\u30FC\u30C9\u3055\u308C\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u8D77\u52D5\u76F4\u5F8C\u306B\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u306E\u30C7\u30FC\u30BF\u304C\u5FC5\u8981\u306A\u5834\u5408\u3084\u3001\u3053\u306E\u30C7\u30FC\u30BF\u30FC\u3092\u30EC\u30A4\u30B8\u30FC\u30ED\u30FC\u30C9\u3057\u305F\u3053\u3068\u306B\u3088\u308A\u30AD\u30E3\u30C3\u30B7\u30E5\u64CD\u4F5C\u304C\u9045\u5EF6\u3057\u306A\u3044\u3088\u3046\u306B\u3059\u308B\u5834\u5408\u306B\u7279\u306B\u4FBF\u5229\u3067\u3059\u3002\u8D77\u52D5\u6642\u306B\u300C\u30A6\u30A9\u30FC\u30E0\u30AD\u30E3\u30C3\u30B7\u30E5\u300D\u3092\u63D0\u4F9B\u3059\u308B\u305F\u3081\u4F7F\u7528\u3067\u304D\u307E\u3059\u304C\u3001\u8D77\u52D5\u6642\u9593\u304C\u3053\u306E\u51E6\u7406\u306E\u5F71\u97FF\u3092\u53D7\u3051\u308B\u305F\u3081\u3001\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u304C\u4F4E\u4E0B\u3057\u307E\u3059\u3002
infinispan.store.passivation=true \u306E\u5834\u5408\u3001\u30E1\u30E2\u30EA\u30FC\u304B\u3089\u30A8\u30D3\u30AF\u30C8\u3055\u308C\u305F\u6642\u306E\u307F\u30C7\u30FC\u30BF\u304C\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u306B\u66F8\u304D\u8FBC\u307E\u308C\u307E\u3059\u3002\u3053\u308C\u306F\u300C\u30D1\u30C3\u30B7\u30D9\u30FC\u30B7\u30E7\u30F3\u300D\u3068\u547C\u3070\u308C\u307E\u3059\u3002\u30C7\u30FC\u30BF\u306F\u6B21\u56DE\u8981\u6C42\u3055\u308C\u308B\u3068\u3001\u300C\u30A2\u30AF\u30C6\u30A3\u30D9\u30FC\u30C8\u300D\u3055\u308C\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u30C7\u30FC\u30BF\u304C\u30E1\u30E2\u30EA\u30FC\u306B\u623B\u3055\u308C\u3001\u6C38\u7D9A\u30B9\u30C8\u30A2\u304B\u3089\u524A\u9664\u3055\u308C\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002false \u306E\u5834\u5408\u3001\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u306B\u30E1\u30E2\u30EA\u30FC\u5185\u5BB9\u306E\u30B3\u30D4\u30FC\u304C\u542B\u307E\u308C\u307E\u3059\u3002\u305D\u306E\u305F\u3081\u3001\u30AD\u30E3\u30C3\u30B7\u30E5\u3078\u306E\u66F8\u304D\u8FBC\u307F\u306B\u3088\u3063\u3066\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u306E\u66F8\u304D\u8FBC\u307F\u304C\u767A\u751F\u3057\u307E\u3059\u3002\u3053\u308C\u306B\u3088\u308A\u3001\u5B9F\u969B\u306B\u306F\u300C\u30E9\u30A4\u30C8\u30B9\u30EB\u30FC\u300D\u8A2D\u5B9A\u304C\u63D0\u4F9B\u3055\u308C\u307E\u3059\u3002
infinispan.store.fetch-state=true \u306E\u5834\u5408\u3001\u30AF\u30E9\u30B9\u30BF\u30FC\u306B\u53C2\u52A0\u3059\u308B\u3068\u6C38\u7D9A\u72B6\u614B\u3092\u30D5\u30A7\u30C3\u30C1\u3057\u307E\u3059\u3002\u8907\u6570\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u304C\u30C1\u30A7\u30FC\u30F3\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u3053\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3092\u6709\u52B9\u306B\u3067\u304D\u308B\u306E\u306F 1 \u3064\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u306E\u307F\u306B\u306A\u308A\u307E\u3059\u3002
infinispan.store.purge=true \u306E\u5834\u5408\u3001\u8D77\u52D5\u6642\u306B\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.store.singleton=true \u306E\u5834\u5408\u3001\u30B7\u30F3\u30B0\u30EB\u30C8\u30F3\u30B9\u30C8\u30A2\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u304C\u6709\u52B9\u306B\u306A\u308A\u307E\u3059\u3002SingletonStore \u306F\u3001\u30AF\u30E9\u30B9\u30BF\u30FC\u306E 1 \u3064\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u307F\u304C\u57FA\u76E4\u306E\u30B9\u30C8\u30A2\u3068\u5BFE\u8A71\u3059\u3079\u304D\u3067\u3042\u308B\u5834\u5408\u306B\u4F7F\u7528\u3055\u308C\u308B\u59D4\u8B72\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u3067\u3059\u3002
infinispan.store.singleton.deprecated=\u975E\u63A8\u5968\u3002\u4EE3\u308F\u308A\u306B\u3001\u30D7\u30E9\u30A4\u30DE\u30EA\u30FC\u6240\u6709\u8005\u306E\u307F\u304C\u66F8\u304D\u8FBC\u307F\u3092\u5B9F\u884C\u3059\u308B\u5171\u6709\u30B9\u30C8\u30A2\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
infinispan.store.class=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u306B\u4F7F\u7528\u3059\u308B\u30AB\u30B9\u30BF\u30E0\u306E\u30B9\u30C8\u30A2\u5B9F\u88C5\u30AF\u30E9\u30B9\u3002
infinispan.store.write-behind=\u30E9\u30A4\u30C8\u30B9\u30EB\u30FC\u3067\u306F\u306A\u304F\u30E9\u30A4\u30C8\u30D3\u30CF\u30A4\u30F3\u30C9\u3068\u3057\u3066\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u3092\u8A2D\u5B9A\u3059\u308B\u5B50\u3002
infinispan.store.properties=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306E\u4E00\u89A7\u3002
infinispan.store.properties.property=\u540D\u524D\u3068\u5024\u3092\u6301\u3064\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
infinispan.store.property=\u540D\u524D\u3068\u5024\u3092\u6301\u3064\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
infinispan.store.write=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u306E\u66F8\u304D\u8FBC\u307F\u52D5\u4F5C\u3002
infinispan.store.cache-loader-loads=\u30AD\u30E3\u30C3\u30B7\u30E5\u30ED\u30FC\u30C0\u30FC\u30CE\u30FC\u30C9\u30ED\u30FC\u30C9\u306E\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.store.cache-loader-misses=\u30AD\u30E3\u30C3\u30B7\u30E5\u30ED\u30FC\u30C0\u30FC\u30CE\u30FC\u30C9\u30DF\u30B9\u306E\u6570\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001null \u304C\u8FD4\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
infinispan.write.behind=\u30E9\u30A4\u30C8\u30B9\u30EB\u30FC\u3067\u306F\u306A\u304F\u30E9\u30A4\u30C8\u30D3\u30CF\u30A4\u30F3\u30C9\u3068\u3057\u3066\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
infinispan.write.behind.add=\u30B9\u30C8\u30A2\u306B\u30E9\u30A4\u30C8\u30D3\u30CF\u30A4\u30F3\u30C9\u8A2D\u5B9A\u8981\u7D20\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.write.behind.remove=\u30B9\u30C8\u30A2\u304B\u3089\u30E9\u30A4\u30C8\u30D3\u30CF\u30A4\u30F3\u30C9\u8A2D\u5B9A\u8981\u7D20\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.write.behind.flush-lock-timeout=\u5B9A\u671F\u7684\u306B\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u3078\u30D5\u30E9\u30C3\u30B7\u30E5\u3055\u308C\u308B\u72B6\u614B\u3092\u30AC\u30FC\u30C9\u3059\u308B\u30ED\u30C3\u30AF\u53D6\u5F97\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3002
infinispan.write.behind.flush-lock-timeout.deprecated=\u975E\u63A8\u5968\u3002\u3053\u306E\u5C5E\u6027\u306F\u4F7F\u7528\u3055\u308C\u306A\u3044\u3088\u3046\u306B\u306A\u308A\u307E\u3057\u305F\u3002
infinispan.write.behind.modification-queue-size=\u975E\u540C\u671F\u30AD\u30E5\u30FC\u306E\u6700\u5927\u30A8\u30F3\u30C8\u30EA\u30FC\u6570\u3002\u30AD\u30E5\u30FC\u304C\u6E80\u676F\u306E\u5834\u5408\u3001\u30B9\u30C8\u30A2\u306F\u65B0\u3057\u3044\u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u8A31\u53EF\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308B\u307E\u3067\u30E9\u30A4\u30C8\u30B9\u30EB\u30FC\u306B\u306A\u308A\u307E\u3059\u3002
infinispan.write.behind.shutdown-timeout=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u505C\u6B62\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u30DF\u30EA\u79D2)\u3002
infinispan.write.behind.shutdown-timeout.deprecated=\u975E\u63A8\u5968\u3002\u3053\u306E\u5C5E\u6027\u306F\u4F7F\u7528\u3055\u308C\u306A\u3044\u3088\u3046\u306B\u306A\u308A\u307E\u3057\u305F\u3002
infinispan.write.behind.thread-pool-size=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u3078\u5909\u66F4\u3092\u9069\u7528\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u3092\u6301\u3064\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306E\u30B5\u30A4\u30BA\u3002
infinispan.write.through=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u3092\u30E9\u30A4\u30C8\u30B9\u30EB\u30FC\u3068\u3057\u3066\u8A2D\u5B9A\u3057\u307E\u3059\u3002
infinispan.write.through.add=\u30E9\u30A4\u30C8\u30B9\u30EB\u30FC\u8A2D\u5B9A\u3092\u30B9\u30C8\u30A2\u306B\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.write.through.remove=\u30B9\u30C8\u30A2\u3078\u306E\u30E9\u30A4\u30C8\u30B9\u30EB\u30FC\u8A2D\u5B9A\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.property=\u540D\u524D\u3068\u5024\u3092\u6301\u3064\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
infinispan.property.deprecated=\u975E\u63A8\u5968\u3002\u9069\u5207\u306A\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u30EA\u30BD\u30FC\u30B9\u306E properties \u5C5E\u6027\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
infinispan.property.add=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.property.remove=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.property.value=\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306E\u5024\u3002
infinispan.store.none=\u30B9\u30C8\u30A2\u306E\u306A\u3044\u8A2D\u5B9A\u3002
infinispan.store.none.add=\u30B9\u30C8\u30A2\u306E\u306A\u3044\u8A2D\u5B9A\u3092\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u8FFD\u52A0
infinispan.store.none.remove=\u30B9\u30C8\u30A2\u306E\u306A\u3044\u8A2D\u5B9A\u3092\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u304B\u3089\u524A\u9664
infinispan.store.file=\u30AD\u30E3\u30C3\u30B7\u30E5\u30D5\u30A1\u30A4\u30EB\u30B9\u30C8\u30A2\u8A2D\u5B9A\u3002
infinispan.store.file.add=\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u30D5\u30A1\u30A4\u30EB\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u8A2D\u5B9A\u8981\u7D20\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.store.file.remove=\u30AD\u30E3\u30C3\u30B7\u30E5\u304B\u3089\u30AD\u30E3\u30C3\u30B7\u30E5\u30D5\u30A1\u30A4\u30EB\u30B9\u30C8\u30A2\u8A2D\u5B9A\u8981\u7D20\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.store.file.relative-to=\u6307\u5B9A\u3055\u308C\u305F\u30D1\u30B9\u304C\u76F8\u5BFE\u3059\u308B\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u3002
infinispan.store.file.path=\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u3002\u3053\u306E\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u4E0B\u3067\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u306E\u30A8\u30F3\u30C8\u30EA\u30FC\u304C\u6C38\u7D9A\u5316\u3055\u308C\u307E\u3059\u3002
infinispan.store.jdbc=\u30AD\u30E3\u30C3\u30B7\u30E5 JDBC \u30B9\u30C8\u30A2\u8A2D\u5B9A\u3002
infinispan.store.jdbc.add=JDBC \u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u8A2D\u5B9A\u8981\u7D20\u3092\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.store.jdbc.remove=JDBC \u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u8A2D\u5B9A\u8981\u7D20\u3092\u30AD\u30E3\u30C3\u30B7\u30E5\u304B\u3089\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.store.jdbc.data-source=\u3053\u306E\u30B9\u30C8\u30A2\u3078\u63A5\u7D9A\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u3092\u53C2\u7167\u3057\u307E\u3059\u3002
infinispan.store.jdbc.datasource=\u3053\u306E\u30B9\u30C8\u30A2\u306B\u63A5\u7D9A\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u306E jndi \u540D\u3002
infinispan.store.jdbc.datasource.deprecated=\u975E\u63A8\u5968\u3002data-source \u306B\u7F6E\u304D\u63DB\u3048\u3089\u308C\u307E\u3057\u305F\u3002
infinispan.store.jdbc.dialect=\u3053\u306E\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u306E\u30C0\u30A4\u30A2\u30EC\u30AF\u30C8\u3002
infinispan.store.jdbc.table=\u6C38\u7D9A\u30AD\u30E3\u30C3\u30B7\u30E5\u30C7\u30FC\u30BF\u3092\u4FDD\u5B58\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C6\u30FC\u30D6\u30EB\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
infinispan.store.jdbc.binary-keyed-table=\u30AD\u30FC\u3092\u6587\u5B57\u5217\u3068\u3057\u3066\u8868\u73FE\u3067\u304D\u306A\u3044\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u4FDD\u5B58\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C6\u30FC\u30D6\u30EB\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
infinispan.store.jdbc.binary-keyed-table.deprecated=\u975E\u63A8\u5968\u3002table\=binary \u5B50\u30EA\u30BD\u30FC\u30B9\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
infinispan.store.jdbc.binary-keyed-table.table.prefix=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30C6\u30FC\u30D6\u30EB\u540D\u306E\u63A5\u982D\u8F9E\u3002
infinispan.store.jdbc.binary-keyed-table.table.batch-size=DB \u633F\u5165\u3067\u306F\u3001\u4E00\u62EC\u51E6\u7406\u3055\u308C\u308B\u633F\u5165\u306E\u6570\u306F\u30D0\u30C3\u30C1\u30B5\u30A4\u30BA\u3067\u6C7A\u307E\u308A\u307E\u3059\u3002
infinispan.store.jdbc.binary-keyed-table.table.fetch-size=DB \u30AF\u30A8\u30EA\u3067\u306F\u3001\u30D5\u30A7\u30C3\u30C1\u30B5\u30A4\u30BA\u3092\u4F7F\u7528\u3057\u3066 ResultSets \u306B\u30D5\u30A7\u30C3\u30C1\u30B5\u30A4\u30BA\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
infinispan.store.jdbc.binary-keyed-table.table.column.name=\  
infinispan.store.jdbc.binary-keyed-table.table.column.type=\  
infinispan.store.jdbc.binary-keyed-table.table.id-column=\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC ID \u3092\u4FDD\u6301\u3059\u308B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u3002
infinispan.store.jdbc.binary-keyed-table.table.id-column.column.name=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u540D\u524D\u3002
infinispan.store.jdbc.binary-keyed-table.table.id-column.column.type=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u578B\u3002
infinispan.store.jdbc.binary-keyed-table.table.data-column=\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u30C7\u30FC\u30BF\u3092\u4FDD\u6301\u3059\u308B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u3002
infinispan.store.jdbc.binary-keyed-table.table.data-column.column.name=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u540D\u524D\u3002
infinispan.store.jdbc.binary-keyed-table.table.data-column.column.type=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u578B\u3002
infinispan.store.jdbc.binary-keyed-table.table.timestamp-column=\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u3092\u4FDD\u6301\u3059\u308B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u3002
infinispan.store.jdbc.binary-keyed-table.table.timestamp-column.column.name=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u540D\u524D\u3002
infinispan.store.jdbc.binary-keyed-table.table.timestamp-column.column.type=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u578B\u3002
infinispan.store.jdbc.string-keyed-table=\u6C38\u7D9A\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u4FDD\u5B58\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C6\u30FC\u30D6\u30EB\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
infinispan.store.jdbc.string-keyed-table.deprecated=\u975E\u63A8\u5968\u3002table\=string \u5B50\u30EA\u30BD\u30FC\u30B9\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
infinispan.store.jdbc.string-keyed-table.table.prefix=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30C6\u30FC\u30D6\u30EB\u540D\u306E\u63A5\u982D\u8F9E\u3002
infinispan.store.jdbc.string-keyed-table.table.batch-size=DB \u633F\u5165\u3067\u306F\u3001\u4E00\u62EC\u51E6\u7406\u3055\u308C\u308B\u633F\u5165\u306E\u6570\u306F\u30D0\u30C3\u30C1\u30B5\u30A4\u30BA\u3067\u6C7A\u307E\u308A\u307E\u3059\u3002
infinispan.store.jdbc.string-keyed-table.table.fetch-size=DB \u30AF\u30A8\u30EA\u3067\u306F\u3001\u30D5\u30A7\u30C3\u30C1\u30B5\u30A4\u30BA\u3092\u4F7F\u7528\u3057\u3066 ResultSets \u306B\u30D5\u30A7\u30C3\u30C1\u30B5\u30A4\u30BA\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
infinispan.store.jdbc.string-keyed-table.table.column.name=\ 
infinispan.store.jdbc.string-keyed-table.table.column.type=\ 
infinispan.store.jdbc.string-keyed-table.table.id-column=\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC ID \u3092\u4FDD\u6301\u3059\u308B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u3002
infinispan.store.jdbc.string-keyed-table.table.id-column.column.name=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u540D\u524D\u3002
infinispan.store.jdbc.string-keyed-table.table.id-column.column.type=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u578B\u3002
infinispan.store.jdbc.string-keyed-table.table.data-column=\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u30C7\u30FC\u30BF\u3092\u4FDD\u6301\u3059\u308B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u3002
infinispan.store.jdbc.string-keyed-table.table.data-column.column.name=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u540D\u524D\u3002
infinispan.store.jdbc.string-keyed-table.table.data-column.column.type=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u578B\u3002
infinispan.store.jdbc.string-keyed-table.table.timestamp-column=\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u3092\u4FDD\u6301\u3059\u308B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u3002
infinispan.store.jdbc.string-keyed-table.table.timestamp-column.column.name=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u540D\u524D\u3002
infinispan.store.jdbc.string-keyed-table.table.timestamp-column.column.type=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u578B\u3002
infinispan.store.binary-jdbc.deprecated=\u975E\u63A8\u5968\u3002\u4ECA\u5F8C\u306E\u30EA\u30EA\u30FC\u30B9\u3067\u524A\u9664\u3055\u308C\u3001\u4EE3\u66FF\u3082\u306A\u3044\u4E88\u5B9A\u3067\u3059\u3002\u4EE3\u308F\u308A\u306B store\=jdbc \u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
infinispan.store.mixed-jdbc.deprecated=\u975E\u63A8\u5968\u3002\u4ECA\u5F8C\u306E\u30EA\u30EA\u30FC\u30B9\u3067\u524A\u9664\u3055\u308C\u3001\u4EE3\u66FF\u3082\u306A\u3044\u4E88\u5B9A\u3067\u3059\u3002\u4EE3\u308F\u308A\u306B store\=jdbc \u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
infinispan.table.binary=\u30AD\u30FC\u3092\u6587\u5B57\u5217\u3068\u3057\u3066\u8868\u73FE\u3067\u304D\u306A\u3044\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u4FDD\u5B58\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C6\u30FC\u30D6\u30EB\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
infinispan.table.binary.deprecated=\u975E\u63A8\u5968\u3002\u30AD\u30FC\u3092\u6587\u5B57\u5217\u3068\u3057\u3066\u8868\u73FE\u3067\u304D\u306A\u3044\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u4FDD\u5B58\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C6\u30FC\u30D6\u30EB\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
infinispan.table.binary.add=\u30AD\u30FC\u3092\u6587\u5B57\u5217\u3068\u3057\u3066\u8868\u73FE\u3067\u304D\u306A\u3044\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u4FDD\u5B58\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C6\u30FC\u30D6\u30EB\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.table.binary.remove=\u30AD\u30FC\u3092\u6587\u5B57\u5217\u3068\u3057\u3066\u8868\u73FE\u3067\u304D\u306A\u3044\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u4FDD\u5B58\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C6\u30FC\u30D6\u30EB\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.table.string=\u30AD\u30FC\u3092\u6587\u5B57\u5217\u3068\u3057\u3066\u8868\u73FE\u3067\u304D\u308B\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u4FDD\u5B58\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C6\u30FC\u30D6\u30EB\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
infinispan.table.string.add=\u30AD\u30FC\u3092\u6587\u5B57\u5217\u3068\u3057\u3066\u8868\u73FE\u3067\u304D\u308B\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u4FDD\u5B58\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C6\u30FC\u30D6\u30EB\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.table.string.remove=\u30AD\u30FC\u3092\u6587\u5B57\u5217\u3068\u3057\u3066\u8868\u73FE\u3067\u304D\u308B\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u4FDD\u5B58\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C6\u30FC\u30D6\u30EB\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.table.prefix=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30C6\u30FC\u30D6\u30EB\u540D\u306E\u63A5\u982D\u8F9E\u3002
infinispan.table.batch-size=DB \u633F\u5165\u3067\u306F\u3001\u4E00\u62EC\u51E6\u7406\u3055\u308C\u308B\u633F\u5165\u306E\u6570\u306F\u30D0\u30C3\u30C1\u30B5\u30A4\u30BA\u3067\u6C7A\u307E\u308A\u307E\u3059\u3002
infinispan.table.fetch-size=DB \u30AF\u30A8\u30EA\u3067\u306F\u3001\u30D5\u30A7\u30C3\u30C1\u30B5\u30A4\u30BA\u3092\u4F7F\u7528\u3057\u3066 ResultSets \u306B\u30D5\u30A7\u30C3\u30C1\u30B5\u30A4\u30BA\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
infinispan.table.id-column=\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC ID \u3092\u4FDD\u6301\u3059\u308B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u3002
infinispan.table.id-column.column.name=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u540D\u524D\u3002
infinispan.table.id-column.column.type=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u578B\u3002
infinispan.table.data-column=\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u30C7\u30FC\u30BF\u3092\u4FDD\u6301\u3059\u308B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u3002
infinispan.table.data-column.column.name=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u540D\u524D\u3002
infinispan.table.data-column.column.type=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u578B\u3002
infinispan.table.timestamp-column=\u30AD\u30E3\u30C3\u30B7\u30E5\u30A8\u30F3\u30C8\u30EA\u30FC\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u3092\u4FDD\u6301\u3059\u308B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u3002
infinispan.table.timestamp-column.column.name=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u540D\u524D\u3002
infinispan.table.timestamp-column.column.type=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5217\u306E\u578B\u3002
infinispan.store.remote=\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30EA\u30E2\u30FC\u30C8\u30B9\u30C8\u30A2\u8A2D\u5B9A\u3002
infinispan.store.remote.cache=\u3053\u306E\u30EA\u30E2\u30FC\u30C8\u30B9\u30C8\u30A2\u306B\u4F7F\u7528\u3059\u308B\u30EA\u30E2\u30FC\u30C8\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u540D\u524D\u3002
infinispan.store.remote.tcp-no-delay=\u30EA\u30E2\u30FC\u30C8\u30AD\u30E3\u30C3\u30B7\u30E5\u901A\u4FE1\u306E TCP_NODELAY \u5024\u3002
infinispan.store.remote.socket-timeout=\u30EA\u30E2\u30FC\u30C8\u30AD\u30E3\u30C3\u30B7\u30E5\u901A\u4FE1\u306E\u30BD\u30B1\u30C3\u30C8\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3002
infinispan.store.remote.remote-servers=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u306E\u30EA\u30E2\u30FC\u30C8\u30B5\u30FC\u30D0\u30FC\u4E00\u89A7
infinispan.store.remote.remote.servers.remote-server=\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306B\u3088\u3063\u3066\u5B9A\u7FA9\u3055\u308C\u308B\u30EA\u30E2\u30FC\u30C8\u30B5\u30FC\u30D0\u30FC\u3002
infinispan.store.remote.remote-servers.remote-server.outbound-socket-binding=\u30EA\u30E2\u30FC\u30C8\u30B5\u30FC\u30D0\u30FC\u306E\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3002
infinispan.store.remote.add=\u30EA\u30E2\u30FC\u30C8\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30A2\u8A2D\u5B9A\u8981\u7D20\u3092\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.store.remote.remove=\u30AD\u30E3\u30C3\u30B7\u30E5\u30EA\u30E2\u30FC\u30C8\u30B9\u30C8\u30A2\u8A2D\u5B9A\u8981\u7D20\u3092\u30AD\u30E3\u30C3\u30B7\u30E5\u304B\u3089\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.backup=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u30EC\u30D7\u30EA\u30B1\u30FC\u30C8\u3059\u308B\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30A4\u30C8\u3002
infinispan.backup.add=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30A4\u30C8\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.backup.remove=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u304B\u3089\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30A4\u30C8\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.backup.strategy=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B9\u30C8\u30E9\u30C6\u30B8\u30FC
infinispan.backup.failure-policy=\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30A4\u30C8\u3078\u306E\u63A5\u7D9A\u306B\u5931\u6557\u3057\u305F\u3068\u304D\u306B\u5F93\u3046\u30DD\u30EA\u30B7\u30FC\u3002
infinispan.backup.enabled=\u3053\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30A4\u30C8\u304C\u6709\u52B9\u306B\u306A\u3063\u3066\u3044\u308B\u304B\u3069\u3046\u304B\u3092\u793A\u3057\u307E\u3059\u3002
infinispan.backup.timeout=\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30A4\u30C8\u3078\u30EC\u30D7\u30EA\u30B1\u30FC\u30C8\u3059\u308B\u3068\u304D\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3002
infinispan.backup.after-failures=\u5931\u6557\u56DE\u6570\u3092\u793A\u3057\u307E\u3059\u3002\u3053\u306E\u5024\u3092\u8D85\u3048\u308B\u3068\u3053\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30A4\u30C8\u304C\u30AA\u30D5\u30E9\u30A4\u30F3\u306B\u306A\u308A\u307E\u3059\u3002
infinispan.backup.min-wait=\u6700\u5927\u306E\u5931\u6557\u56DE\u6570\u306B\u5230\u9054\u3057\u305F\u5F8C\u306B\u5F85\u6A5F\u3059\u308B\u6700\u5C0F\u6642\u9593 (\u30DF\u30EA\u79D2\u5358\u4F4D) \u3092\u793A\u3057\u307E\u3059\u3002\u3053\u306E\u5024\u3092\u8D85\u3048\u308B\u3068\u3001\u3053\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30A4\u30C8\u304C\u30AA\u30D5\u30E9\u30A4\u30F3\u306B\u306A\u308A\u307E\u3059\u3002
infinispan.backup.site-status=\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30A4\u30C8\u306E\u73FE\u5728\u306E\u72B6\u614B\u3092\u8868\u793A\u3057\u307E\u3059\u3002
infinispan.backup.bring-site-online=\u4EE5\u524D\u7121\u52B9\u306B\u3057\u305F\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30A4\u30C8\u3092\u518D\u5EA6\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
infinispan.backup.take-site-offline=\u30EA\u30E2\u30FC\u30C8\u30B5\u30A4\u30C8\u3078\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3092\u7121\u52B9\u306B\u3057\u307E\u3059\u3002
infinispan.component.backup-for=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3068\u3057\u3066\u52D5\u4F5C\u3059\u308B\u30AD\u30E3\u30C3\u30B7\u30E5 (\u30AF\u30ED\u30B9\u30B5\u30A4\u30C8\u30EC\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3067\u4F7F\u7528\u3055\u308C\u307E\u3059)\u3002
infinispan.component.backup-for.add=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u6307\u5B9A\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.component.backup-for.remove=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u6307\u5B9A\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.component.backup-for.remote-cache=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3068\u3057\u3066\u52D5\u4F5C\u3059\u308B\u30EA\u30E2\u30FC\u30C8\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u540D\u524D\u3002
infinispan.component.backup-for.remote-site=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3068\u3057\u3066\u52D5\u4F5C\u3059\u308B\u30EA\u30E2\u30FC\u30C8\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30B5\u30A4\u30C8\u3002
infinispan.component.backups=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30EA\u30E2\u30FC\u30C8\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3002
infinispan.component.backups.add=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30EA\u30E2\u30FC\u30C8\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30DD\u30FC\u30C8\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
infinispan.component.backups.remove=\u3053\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30EA\u30E2\u30FC\u30C8\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30DD\u30FC\u30C8\u3092\u524A\u9664\u3057\u307E\u3059\u3002
infinispan.component.backups.backup=\u30EA\u30E2\u30FC\u30C8\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3002
